{"rating":"5.0 out of 5 stars","title":"offer a light easily bright enough for the guy with old eyes","author":"Gregory E. Howard","date":"on April 21, 2018","body":"These were exactly the model I was hoping for, even tho' the brand name is different than the two I bought 3 years ago. They are solid, well constructed, offer a light easily bright enough for the guy with old eyes, and my original two never eat batteries. I may get another 4-pack so I'll have one in every room of the house."}
{"rating":"5.0 out of 5 stars","title":"Dependable","author":"Sue","date":"on April 20, 2018","body":"It's a great bright LED light. Perfect for the car, walking the dog at night, or those times that you have to find something and you need more light in one place."}
{"rating":"5.0 out of 5 stars","title":"Good product. Cheap price","author":"Sajjatul I Nobel","date":"on April 19, 2018","body":"Compare to the price not bad. Used only one day so can’t say anything more."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Margil Flores","date":"on April 19, 2018","body":"The light is nice!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on April 19, 2018","body":"Very bright."}
{"rating":"5.0 out of 5 stars","title":"Power in a small package","author":"Karen D.","date":"on April 18, 2018","body":"I was surprised at how small these flashlights are, but with a single AA battery (not included), they are really very bright. I keep one in my car and one in my bag."}
{"rating":"4.0 out of 5 stars","title":"Nice flashlights for the money","author":"E. Davila","date":"on April 18, 2018","body":"Pretty bright, seem to be well made. I don't know if they are waterproof or shockproof but they are pretty nice."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"legoman27281","date":"on April 18, 2018","body":"Extremely bright for the size of the flashlight\nhi, low and strobe settings\nfocus works well"}
{"rating":"5.0 out of 5 stars","title":"suit perfect for kids","author":"David M. Groce","date":"on April 17, 2018","body":"They are very mini flashlight, suit perfect for kids. We will use them when we go to camping, kids will love them!"}
{"rating":"5.0 out of 5 stars","title":"It isn't very bright but it's small and will easily fit in a pocket","author":"Alexander Cable","date":"on April 17, 2018","body":"It isn't very bright but it's small and will easily fit in a pocket. If you use and loose flash lights a lot these are perfect."}
{"rating":"5.0 out of 5 stars","title":"Bright, but eats batteries","author":"Courtney","date":"on April 16, 2018","body":"Very bright, I work in a run down steel mill and there are a lot of dark rooms to explore and shop in, but without light it’s impossible. It comes with two lights, one clips into my hard hat clip and the other is handy in my pocket at all times..z must have for the price"}
{"rating":"4.0 out of 5 stars","title":"They work pretty good. Didn't blow me away","author":"GREGORY TEEUWEN","date":"on April 16, 2018","body":"They work pretty good. Didn't blow me away, and they seem fragile (although it is fair to say that I have NOT tested how tough they are)."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Blaqirishman","date":"on April 16, 2018","body":"I will only say for now so far so good, will see in a few months"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Scott","date":"on April 16, 2018","body":"Great little flashlight, very bright, will buy again."}
{"rating":"5.0 out of 5 stars","title":"Works good on 1.2 volt Rechargeable Ni-Mh Batteries!","author":"ALFRED W","date":"on April 15, 2018","body":"Nice well made little flashlight, they work good on 1.2 volt rechargeable Ni-Mh batteries."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Richard Seeley","date":"on April 15, 2018","body":"It's exactly as described and I received it quickly."}
{"rating":"5.0 out of 5 stars","title":"Dependable light","author":"shadowphx","date":"on April 14, 2018","body":"Very small and very bright. These fit easy into any pocket yet they are bright. They make a good every day carry light. Pair it with amazon rechargeable battery and you are ready to go. The clip is sturdy and easy to clip onto the pocket."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Jimbo's Account","date":"on April 14, 2018","body":"Good flashlights at a good price."}
{"rating":"2.0 out of 5 stars","title":"One worked fine, the other would not turn","author":"garry godbehere","date":"on April 14, 2018","body":"Received 2 flashlights. One worked fine, the other would not turn on"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Josh","date":"on April 14, 2018","body":"These lights are alot nicer than I expected for the price"}
{"rating":"4.0 out of 5 stars","title":"Well made, solid aluminum","author":"Allstar","date":"on April 14, 2018","body":"Well made, solid aluminum. Was tough to figure out how to unscrew it to put batteries in. Its the little cap on the end where the push button on switch is."}
{"rating":"1.0 out of 5 stars","title":"When you zoom in it doesnt even look like the LED shape","author":"Amazon Customer","date":"on April 13, 2018","body":"Not what i got as advertised. When you zoom in it doesnt even look like the LED shape, it is blurry and week. Quality wasn't the greatest when i took the flashlight apart. Electronics were not well put together and weren't held in place."}
{"rating":"1.0 out of 5 stars","title":"Do not waste your money","author":"FATMAN","date":"on April 13, 2018","body":"Junk junk junk sums it up"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"CS McCulloh","date":"on April 13, 2018","body":"Really good for the price."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"ED Stoeckel","date":"on April 12, 2018","body":"They both work great. Can adjust beam very easily. Fast shipping"}
{"rating":"1.0 out of 5 stars","title":"Flash lights","author":"Amazon Customer","date":"on April 12, 2018","body":"The 1st flashlight I used at work fell apart in my pocket.The barrel that focuses the light stripped out the inner threads.I will try the 2nd light this week."}
{"rating":"5.0 out of 5 stars","title":"Perfect for camping","author":"CMill","date":"on April 12, 2018","body":"I ordered these to put in our camper for a light that didn't require a lot of room. These are perfect and give off light exactly what as I wanted. I would buy them again."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on April 12, 2018","body":"This flashlight is exactly what I wanted."}
{"rating":"5.0 out of 5 stars","title":"A GREAT BUY","author":"H Tims","date":"on April 12, 2018","body":"Really great flashlights. Well made, bright light! A great buy!"}
{"rating":"5.0 out of 5 stars","title":"Good Quality","author":"ST Harris","date":"on April 11, 2018","body":"Good little well made flashlight. Can't beat them for the price. They make nice gifts."}
{"rating":"2.0 out of 5 stars","title":"Not worth a 3star review.","author":"Chazz","date":"on April 11, 2018","body":"Because they were $4 each that got them one star. Because they worked they got another. Because they did not work properly two stars is all they are worth."}
{"rating":"5.0 out of 5 stars","title":"Great range for a small package","author":"Gene H.","date":"on April 11, 2018","body":"We were looking for a decent flashlight for outdoor use - primary in the back yard to spot the pets or other critters. I took a shot at these since they were on sale. They arrived and we kinda laughed thinking they wouldn't do the job.\n\nWe were wrong. Our back yard goes back 80 feet or so. This thing lights it up in spot mode or the more open mode. It's great. I'll be picking up a couple more."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Cwazy Wabbit","date":"on April 11, 2018","body":"Very nice, works great"}
{"rating":"5.0 out of 5 stars","title":"Sturdy little lights","author":"S. E. Jelliff","date":"on April 11, 2018","body":"These are sturdy little flashlights that we plan to use in our kayaks in case we need a light. They are a lot sturdier than I would have thought for the price, and they have the flashing lights that would be of use if we find ourselves stranded out at night."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"JG123","date":"on April 10, 2018","body":"EXCELLENT FLASHLIGHT ! Not sure exactly what people ,who wrote a 2 paragraph review, were expecting from a $5 flashlight !?"}
{"rating":"5.0 out of 5 stars","title":"Love this product","author":"Jerome Bledsoe","date":"on April 10, 2018","body":"This is the 2nd set of RockBirds I have purchased! Love this product! Sturdy, powerful beam, lightweight an compact!"}
{"rating":"5.0 out of 5 stars","title":"Light but bright","author":"ksmile","date":"on April 10, 2018","body":"It is small but mighty. This little flashlight is very bright. It also is light so I can carry in my pocket, purse, or on my belt loop."}
{"rating":"5.0 out of 5 stars","title":"You cant lose.","author":"Desertdude","date":"on April 10, 2018","body":"Just the right size for pocket, good light ,variable beam great to work with, bottom line for the price you can't lose"}
{"rating":"5.0 out of 5 stars","title":"Love the daily dealz.","author":"Andy","date":"on April 10, 2018","body":"I purchased some larger flashlights recently but needed something that was easier to carry daily. I love the size and the build quality. Plus just one AA battery is nice. They are nice and bright and have a cool zoom feature."}
{"rating":"5.0 out of 5 stars","title":"Love em","author":"Only in Virginia","date":"on April 10, 2018","body":"What a great price you just can't beat it."}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"Amazon Customer","date":"on April 10, 2018","body":"These are very cheaply made. Once of these broke after 2 uses."}
{"rating":"5.0 out of 5 stars","title":"Sturdy little lights that work every time as","author":"David C. Bradford","date":"on April 10, 2018","body":"Sturdy little lights that work every time as advertised"}
{"rating":"5.0 out of 5 stars","title":"Well-made, bright, and good deal.","author":"James G. Demian","date":"on April 10, 2018","body":"Wow. Nicely made. Work very well with Li Ion 14500 batteries as well as with AA alkaline (of course dimmer). Not hard to get used to the (stupid) inclusion of Strobe Mode. They automatically cycle from mode to mode each time you turn them off\/on with the tail switch. Hint to make your life easier (such as it is): When (not if) it turns on automatically (every third time) in strobe mode, just gently push down slightly once or twice on the switch to make it cycle between modes to get what you want. Instead of \"jumping up and down, screaming and shouting\", just think ZEN thoughts (Ooooommmm. All is beauty) and gently depress the switch.\n\nAnd think of the amazingness of this: A bright (and cheap and well-made) LED flashlight that operates on one lousy battery at 1 1\/2 volts (yes, even cheap light \"heavy duty\" non-alkalines) or an NiMH rechargeable at 1.35 volts and yet is still not destroyed by 3.7 volt Li Ion's. Would I be as enthusiastic if I'd not got them on sale at 6.99? Well, maybe a little less because the competition in quantity goes for about $3 to $4 per, and if I buy 5 or 6, I'd be giving away a few to friends and that would be even more fun.\n\nOne little nit-picky thing: the \"Two Fluorescent Rings Which Shine in the Dark Night\" (not fluorescent but phosphorescent) the \"rings\" seem to be just those (cheap) little silicone rubber bands sold in handi-craft stores that are woven together (mainly by younger people, it seems) to make rings and bracelets. Yeah, some of those are sold as glow-in-the-dark. My point is that after a few minutes in the dark, I've seen matches brighter than these -yeah UNLIT matches!\n\nOne more thing - if you use 14500 Li Ion batteries: EBL 14500 Li-ion Rechargeable Batteries 3.7V 800mAh for LED Flashlight Torch, 8 Packs most of these are what is called \"unprotected\". In this case, it means if their voltage goes down in the flashlight, they are probably going to be damaged and may never again be able to be charged to full capacity - or at all. So this is my suggestion: if the \"bulb\" starts dimming or shuts off by itself: immediately open the flashlight and take out the battery. That way the flashlight cannot draw down its voltage any more. Since there's no circuit to protect your battery, you have to do it. This should help you protect your investment and continue to give you the nice bright light these batteries give with these flashlights."}
{"rating":"5.0 out of 5 stars","title":"Nice flashlight, Good value","author":"KMS Squared","date":"on April 10, 2018","body":"Nice flashlight, Good value"}
{"rating":"5.0 out of 5 stars","title":"They work. Inexpensive but don't feel cheap.","author":"Michael","date":"on April 10, 2018","body":"Bright little flashlights that feel very substantial for such a low cost."}
{"rating":"5.0 out of 5 stars","title":"Great","author":"tbrat","date":"on April 9, 2018","body":"Small and powerful"}
{"rating":"4.0 out of 5 stars","title":"Very bright","author":"Jorge Rangel","date":"on April 9, 2018","body":"Wow, I just popped an AA battery in, and this thing is bright."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Rose Williams","date":"on April 9, 2018","body":"Love these flashlights! It does everything it said it would do!"}
{"rating":"4.0 out of 5 stars","title":"This product came quickly and in perfect condition. Easy to use","author":"Jullia","date":"on April 9, 2018","body":"This product came quickly and in perfect condition. Easy to use, accurate, durable, and very useful in our camping night. Great buy."}
{"rating":"5.0 out of 5 stars","title":"Solid heavy duty flashlight.","author":"Wright","date":"on April 9, 2018","body":"Solid product. Works as well as flashlights 3 or 4 times the cost of this one, at least. I will buy another pair, soon."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Amazon Customer","date":"on April 9, 2018","body":"Great product for the price! Arrived as stated. Good packaging. Would recommend"}
{"rating":"4.0 out of 5 stars","title":"So far great light. Only time will tell how durable and ...","author":"Mary Ann Callaway","date":"on April 9, 2018","body":"Small compact light that you carry every day. So far great light. Only time will tell how durable and dependable it is."}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"Lauren Walsh","date":"on April 9, 2018","body":"Ridiculously small. You are mislead by the picture on the site."}
{"rating":"1.0 out of 5 stars","title":"The one that does is mediocre at best.","author":"Bradey Christensen","date":"on April 9, 2018","body":"Only one works. The one that does is mediocre at best."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"K Reed","date":"on April 9, 2018","body":"Awesome little light, highly recommend"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"John Weber","date":"on April 9, 2018","body":"Most: size, uses 2A battery, adjustable light beam. Least: the method used to change the light mode."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"BW","date":"on April 9, 2018","body":"Durable, lightweight and very bright"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"allena","date":"on April 9, 2018","body":"Very good quality lights for the size of flashlight"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Oscar A Campos","date":"on April 9, 2018","body":"They work great. Flashlights are small but do a great job of lighting up the area."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Laura","date":"on April 9, 2018","body":"Great little bright light!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Emanuel","date":"on April 9, 2018","body":"Great product.."}
{"rating":"5.0 out of 5 stars","title":"Compact and useful","author":"LL","date":"on April 9, 2018","body":"These are compact size flashlights, fit in palm. 3 light levels with click of button at the end of flash light. It is good for daily use to keep in the pocket for emergencies or just for walking the dog at night. Recommended"}
{"rating":"2.0 out of 5 stars","title":"Very small which was awesome and it was doing what I bought it for ...","author":"Jennifer","date":"on April 9, 2018","body":"Very small which was awesome and it was doing what I bought it for until the light stopped turning on. Flashlights seem to have a mind of there own. These would work good for around the house and emergency use but not for any type of work\/long periods of off and on usage."}
{"rating":"4.0 out of 5 stars","title":"Arrived very quickly and seem to be a good product. I admit they were smaller than I ...","author":"markfp","date":"on April 9, 2018","body":"Arrived very quickly and seem to be a good product. I admit they were smaller than I expected, but that worked out okay because they're a good size to carry in a pocket."}
{"rating":"5.0 out of 5 stars","title":"Inexpensive lighting.","author":"Curious John","date":"on April 9, 2018","body":"Lite lighting lasting longer liberally."}
{"rating":"5.0 out of 5 stars","title":"Arrived fast and in perfect condition. Using 2 in motorhome for camping and ...","author":"HMSSMS","date":"on April 9, 2018","body":"Arrived fast and in perfect condition. Using 2 in motorhome for camping and 2 for home. Tried one out at it has a very bright light for its size. Am going to love carrying a smaller, lighter flashlight around. Has a clip to hang on belt or purse. Thanks for a great product."}
{"rating":"1.0 out of 5 stars","title":"Poor quality","author":"Joseph Liu","date":"on April 9, 2018","body":"The button doesn't seem to have an actuation point so you seem to have to press rather firmly to change light settings but some times it actuates with little pressure. Edges on the frame feel uncomfortable."}
{"rating":"5.0 out of 5 stars","title":"Comes in handy","author":"Jossue Salome Reyes","date":"on April 9, 2018","body":"These flashlights are small but very powerful! I love them and are easy to have anywhere. I recommend this product."}
{"rating":"4.0 out of 5 stars","title":"Obnoxious strobe\/flashing mode you can't avoid, but decent flashlight.","author":"Trogdor","date":"on April 8, 2018","body":"FYI, to get it to switch modes, you turn it of then on again and it switches. It goes from (1) bright --> (2) Dimmer --> (3) Flashing.\n\nThe flashing is obnoxious. I wish I could get rid of that. I see no need for that in my life or 99% of anyone who buys this thing. It just threatens you with a seizure as you try to quickly switch it off and on to a different mode.\n\nBut the light is fairly bright. No big complaints with how it works when it's just on and working."}
{"rating":"5.0 out of 5 stars","title":"A Golden Pair of Mini Flashlights - YOU HAVE TO CHECK THESE OUT!!!","author":"Martoman","date":"on April 8, 2018","body":"I absolutely LOVE these mini flashlights. They illuminate so much more than one might expect from a device this size and fit cozily in your pocket, in a desk organizer, etc. You never know when you're going to need to light up under your bed, behind a large appliance or the sidewalk out to your garbage cans early in the morning. The monetary trade off is ridiculous with regards to what you get for your hard earned cash. They rest comfortably in the palm of your hand with intuitive motions to light up. Only thing I can't for the life of me figure out is why there's a strobe setting, but that's just me maybe needing a clue as to a real world application. That said, I am in no way affiliated with this company nor do I foresee any financial compensation for a glowing review. I would have been stoked receiving just one of these flashlights but getting two? i say see for yourself, you won't be disappointed!!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"daniel","date":"on April 8, 2018","body":"Excellent led , portable"}
{"rating":"4.0 out of 5 stars","title":"Smaller than they look","author":"Däch","date":"on April 8, 2018","body":"They are quite bright and seem to be solidly constructed, but the picture made them seem a bit larger than they really are. They can only hold one AA battery, so if you're expecting the larger kind with the caddy that holds three AAA batteries, you will be a bit disappointed. That said, even as small as they are, the price is very good."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Heather","date":"on April 8, 2018","body":"When I click the button it shines brightly"}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"smokey","date":"on April 8, 2018","body":"i have to buy batteries china junk"}
{"rating":"5.0 out of 5 stars","title":"Love this flashlight!","author":"Susan","date":"on April 7, 2018","body":"Arrived on time and product is as depicted. Great mini flashlights for the price. Bought these for my husband who uses them at work. Would definitely buy again"}
{"rating":"5.0 out of 5 stars","title":"the quality is also very good, the light is very bright","author":"KEVIN","date":"on April 7, 2018","body":"This is a small iron flashlight, it is very convenient to carry, the quality is also very good, the light is very bright, the lamp head part can also adjust the length of the light, and it is two equipment, cheap and affordable, I like it!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on April 7, 2018","body":"Awesome flashlight for the price!"}
{"rating":"5.0 out of 5 stars","title":"Multi purpose in a compact format","author":"Atlanta Jake","date":"on April 7, 2018","body":"Got these two flashlights on sale and well worth the price. Like the small compact size with a lot of light emanating from the bulbs. Great feature of bright, less bright, and a flasher. One is next to the bed, the other in the car for those emergencies. Also, like the ability to focus the beam when necessary. This is the kind of thing that you don't need until you get it. Highly recommend."}
{"rating":"2.0 out of 5 stars","title":"But I hated the fact that I had to cyclce through the ...","author":"An N.","date":"on April 7, 2018","body":"Decent enough light. But I hated the fact that I had to cyclce through the modes every time i turned it on."}
{"rating":"5.0 out of 5 stars","title":"Cute and bright flashlight","author":"MW","date":"on April 6, 2018","body":"It’s tiny cute flashlight. As of luminous flux , this little flashlight generates amazing light intensity that can be light up a spot 50 yards, even 100 yards away. There are two light modes, the continuous one and the twinkling one."}
{"rating":"4.0 out of 5 stars","title":"Better than I was expecting for the price and super ...","author":"Nicholas Kisling","date":"on April 6, 2018","body":"Better than I was expecting for the price and super bright for how tiny they are. If you put a good AA battery in them you will be stoked. I like that the light can focus in on small spaces. Good for exploring tight spaces. I would imagine they would be good in the mechanic industry. I mostly bought them for walking at night so people dont run me over. And for going into tunnels and sewage drains to look for clowns and stuff."}
{"rating":"5.0 out of 5 stars","title":"under closet repair and kids love it for haunted house","author":"Jing Zhang","date":"on April 6, 2018","body":"This is one of the must haves for each and every family. We used it for night time outdoor exploration, under closet repair and kids love it for haunted house."}
{"rating":"3.0 out of 5 stars","title":"Three Stars","author":"Amazon Customer","date":"on April 6, 2018","body":"One of the flashlights switch does not work."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Obafemi","date":"on April 6, 2018","body":"They are working good. I love it!"}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"jon asri","date":"on April 5, 2018","body":"DOA and this item is not eligible for return!"}
{"rating":"3.0 out of 5 stars","title":"One of mine had a bad switch.","author":"Terry","date":"on April 5, 2018","body":"They aren't bad lights, Really bright, lightly depress the switch and release to change the operating mode, I Just happened to get one with a bad switch, It pops loudly, occasionally doesn't work or won't turn off. The other flashlight is fine. Oh, the fluorescent lines? Those are silicone\/rubber bands that glow in the dark."}
{"rating":"1.0 out of 5 stars","title":"Total waste of money","author":"Marlies Fitch Ledbetter","date":"on April 5, 2018","body":"Can’t even get a battery in it. And it’s not bright at all once I finally got the top open. It just kept spinning and spinning. Now I can’t get the batteries out"}
{"rating":"1.0 out of 5 stars","title":"Waste of my money","author":"Mikki - Student","date":"on April 5, 2018","body":"1 of the 2 flashlights work. but not as advertised. Did not find the \"nonreturnable\" part until after receiving the items. Rechecked the original page for the order and nowhere does it say \"nonreturnable\". Waste of my money!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"BH","date":"on April 5, 2018","body":"It's compact, lightweight, focusable, and bright - exactly what I was looking for."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"J. Madsen","date":"on April 4, 2018","body":"Really bright for the size one aa battery a plus"}
{"rating":"3.0 out of 5 stars","title":"Ity bitty","author":"Diana R. Ortega","date":"on April 4, 2018","body":"They're very small, but work well for a 4 inch flashlight"}
{"rating":"2.0 out of 5 stars","title":"Two Stars","author":"loudheart","date":"on April 4, 2018","body":"It's okay."}
{"rating":"5.0 out of 5 stars","title":"Muy bueno.","author":"Cliente de Amazon","date":"on April 4, 2018","body":"Muy bueno."}
{"rating":"3.0 out of 5 stars","title":"Hit and Miss","author":"ME","date":"on April 4, 2018","body":"Of the two, one worked perfectly, the other would only switch on in dim mode, and needed to be switched to bright mode. They are build solidly and the working one does a good job. Amazon customer service is perfect as always and resolved the issue to my satisfaction. I would try them again, my guess is I just got a bad one."}
{"rating":"2.0 out of 5 stars","title":"One of the two lights I received does not work ...","author":"Tami Jones","date":"on April 4, 2018","body":"One of the two lights I received does not work. I didnt know it was not returnable before receiving it."}
{"rating":"1.0 out of 5 stars","title":"Flashlight cop material","author":"Antwane Robinson","date":"on April 4, 2018","body":"Ok for a kid"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"floyd morris","date":"on April 4, 2018","body":"Good little flash light."}
{"rating":"1.0 out of 5 stars","title":"0\/2 working flashlights. complete garbage.","author":"Amazon Customer","date":"on April 4, 2018","body":"So the one I could open to put a battery works ok, but the other one doesn't unscrew so its useless. Not a great deal.\nupdate (5 minutes later) After taking the battery out and trying to reassemble the one that worked, the housing which holds the lens over the LED came off, so 100% garbage. stay away."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on April 4, 2018","body":"Very small and very good quality, there are three kinds of adjustment brightness"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Ignacio Gonzales","date":"on April 3, 2018","body":"Very great LED flashlights for last minute emergencies I definitely recommend this."}
{"rating":"2.0 out of 5 stars","title":"NOT 300 LUMENS","author":"Richard S.","date":"on April 3, 2018","body":"Overall it is well built for the price however the max output is probably not even 150 lumens. To call this 300 lumens is such false advertisement. It is bright enough to do the job and AA batteries are easy to find and they are cheap enough to loose or keep around."}
{"rating":"5.0 out of 5 stars","title":"brite lite","author":"cb","date":"on April 3, 2018","body":"awesome little lights"}
{"rating":"5.0 out of 5 stars","title":"2 items. So very very cheap.BUY NOW. IT'S LIKE STEALING. AWESOME GIFT. SAFETY ANGEL.","author":"COLLAGENIKOV. JOHN M. PRESCOTT","date":"on April 3, 2018","body":"Retry??? Great product offers need great reviews POSTED, eh?"}
{"rating":"2.0 out of 5 stars","title":"One of the two flashlights works, one doesn't.","author":"Sabine A.","date":"on April 3, 2018","body":"One of the two works fine, the other one does not work at all. It doesn't click, it seems all empty inside the orange ball, where it is supposed to click on and off. Cheap stuff, not worth to send back."}
{"rating":"5.0 out of 5 stars","title":"Great little gadget","author":"Deb Mino","date":"on April 3, 2018","body":"Very practical flashlight. Comes in handy for this nurse!"}
{"rating":"5.0 out of 5 stars","title":"good quality, bright enough","author":"Ryan Shi","date":"on April 3, 2018","body":"small in size, good quality, bright enough. The reason I purchased this is because the hook that coming with it. Before this, I lost many of the flashlight. Love the hooks, no need to worry that I gonna lost it again."}
{"rating":"2.0 out of 5 stars","title":"I do not recommend this flashlight","author":"Fran Dux","date":"on April 3, 2018","body":"The zoom does not work on any of the flashlights I received. I do not recommend this flashlight."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"CHENGCHEN","date":"on April 2, 2018","body":"These were great and worth every penny."}
{"rating":"5.0 out of 5 stars","title":"This is a great mini flashlights","author":"Cindy","date":"on March 31, 2018","body":"This is a great mini flashlights! The size is small and fits so comfortable in my hand or put in my pocket. Also they are so bright than i expect. Very reasonable price for two, five stars!"}
{"rating":"5.0 out of 5 stars","title":"Love it. Small","author":"Andrew","date":"on March 31, 2018","body":"Little cute flesh lights! Love it. Small , handy and great quality."}
{"rating":"4.0 out of 5 stars","title":"Great value","author":"Harbinger of books","date":"on March 30, 2018","body":"This is a small compact flashlight with a bright light, I have found it to be handy for lots of little things and big ones like flipping the fuse box. The only downside is I hate the strobe light because it hurts my eyes and you have to see the strobe in order to turn the flashlight off. The other downside is the flashlight has a lot of blue."}
{"rating":"5.0 out of 5 stars","title":"Great flashlight, runs on AA batteries","author":"QW","date":"on March 28, 2018","body":"The flashlights are great for the price. It fits the pocket and easy to carry around. It runs on one AA battery and bright enough for most of the tasks."}
{"rating":"5.0 out of 5 stars","title":"Great product!!!!!!","author":"Lisa12138","date":"on March 28, 2018","body":"Love it. So useful when I trying to fix my pipe. Strong light with amazing size. All I can say is fantastic"}
{"rating":"5.0 out of 5 stars","title":"Good on batteries","author":"Suki","date":"on March 28, 2018","body":"These came in handy during Hurricane Irma. We live in Orlando, we lost power around midnight. These got us through that night. We eventually had to leave our home, No power for 7 days.But these little suckers were Very illuminating, Good on batteries, small but mighty. I bought one for each of my kids. It kept them entertained as the storm passed over us. We were able to play board games & cards games all night with these as our light."}
{"rating":"5.0 out of 5 stars","title":"This flashlight is super bright. I can have my bathroom light off","author":"Summy","date":"on March 28, 2018","body":"This flashlight is super bright. I can have my bathroom light off, which is in the middle of the house so very dark, and this light will light the whole room up. you can see just like the light was on. This light is amazing!"}
{"rating":"5.0 out of 5 stars","title":"easy to carry around","author":"Shelly","date":"on March 27, 2018","body":"Small and exquisite, easy to carry around."}
{"rating":"5.0 out of 5 stars","title":"super easy to carry","author":"Edward Chen","date":"on March 26, 2018","body":"Ultra-convenient and compact flashlight and a group of two, super easy to carry, do not have to fear the dark place"}
{"rating":"5.0 out of 5 stars","title":"A perfect flashlight, it’s easy to carry","author":"Amazon Customer","date":"on March 25, 2018","body":"A perfect flashlight,it’s easy to carry .The light is very bright and I don't have to worry about keeping spare batteries around for it. I bought this for my daughter dand she loves it."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"a.miller","date":"on March 25, 2018","body":"you get what pay for"}
{"rating":"5.0 out of 5 stars","title":"Zoom feature is great!","author":"Derek","date":"on March 21, 2018","body":"I own several smaller Cree LED flashlights and I'm very impressed by the performance for the size. This is a step up from the smaller lights and puts out some serious light. Brightest flashlight I've ever owned. Zoom feature is great!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on March 20, 2018","body":"These small LED flashlights are wonderful! Small enough to carry inconspicuously, yet still extremely bright when needed!!"}
{"rating":"4.0 out of 5 stars","title":"Bright lights","author":"Edward L Thacker","date":"on March 19, 2018","body":"Nice bright lights. You get what you paid for, nothing special. I would recommend them."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"William Vuzzo","date":"on March 18, 2018","body":"These are great for work. Get the upgraded batteries"}
{"rating":"5.0 out of 5 stars","title":"These flashlights are so valuable and they are very easy to carry","author":"Harris","date":"on March 17, 2018","body":"These flashlights are so valuable and they are very easy to carry, also they are very bright, i think i spent 10 dollars very worthy that hard to find another place!"}
{"rating":"1.0 out of 5 stars","title":"one works the ot doesnt","author":"Daniel Avina","date":"on March 17, 2018","body":"1 works fine . the other blinks intermittently"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Robert W.","date":"on March 17, 2018","body":"Works great."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"mdnike","date":"on March 15, 2018","body":"Great product"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"PRT","date":"on March 13, 2018","body":"GREAt, compact flashlight. Nice quality"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on March 12, 2018","body":"Excellent deal for a pair of probably most efficient flashlights ever invented."}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"B A","date":"on March 11, 2018","body":"Already no longer working after minimal use."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"KBOWDRUMS","date":"on March 10, 2018","body":"Great little flashlights."}
{"rating":"1.0 out of 5 stars","title":"I bought 2 and they worked great for 2-3 weeks then they quit working","author":"MDD","date":"on March 9, 2018","body":"I bought 2 and they worked great for 2-3 weeks then they quit working. Was using in a hot, humid climate. ( New batteries didn't help)"}
{"rating":"5.0 out of 5 stars","title":"Good flashlights for the price","author":"Eric","date":"on March 4, 2018","body":"Very bright flashlight. Used at the beach walking at night looking fir shells. Decent battery life"}
{"rating":"5.0 out of 5 stars","title":"good","author":"Hailing L.","date":"on February 27, 2018","body":"works good, I used this during hurricane irma"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Caroline Dai Prá","date":"on February 23, 2018","body":"Better quality than I was expecting...didn't use yet"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"mohand reyyashi","date":"on February 19, 2018","body":"nice"}
{"rating":"5.0 out of 5 stars","title":"Very bright and tough","author":"Tracey C","date":"on February 18, 2018","body":"These give amazing light and are very sturdy. A bit heavy for a compact light, but the clip makes it easy to carry. I ordered them for our hurricane supply kit after Irma hit us. We've used them several times and were so pleased that I got them for my brother too."}
{"rating":"1.0 out of 5 stars","title":"Faulty, low quality","author":"Chip Johnson","date":"on February 17, 2018","body":"Price is too good to be true. Don’t expect them to last. One of mine just died and the other only flashes?!?! It’s been 2 months so I can’t return. Not happy! Good luck!"}
{"rating":"5.0 out of 5 stars","title":"great, small but powerful","author":"Guy Moore","date":"on February 16, 2018","body":"great , small but powerful ."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Bill Starling","date":"on February 15, 2018","body":"They are great for reading a menu in a dark restaurant"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Chris","date":"on February 13, 2018","body":"Small and powerful!"}
{"rating":"5.0 out of 5 stars","title":"Great deal!","author":"Lars Augustsson","date":"on February 12, 2018","body":"Buy many, keep them everywhere. AA battery is a major advantage, some have.shelf-lives of decades, means always ready in boat, car or outhouse."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"iamjosearchila","date":"on February 11, 2018","body":"GReat Product!"}
{"rating":"5.0 out of 5 stars","title":"Small, Bright, Durable Flashlight","author":"Jeff Dreyfous","date":"on February 11, 2018","body":"I liked these so well that I gave them out as stocking stuffers to out family. They're built well, look nice, are plenty bright and small enough to have on hand or carry wherever you go. If you need a great little, durable flashlight, you can't go wrong with these. Highly recommended for sportsman and women of all activities, kids and folks in general looking for a small, bright, portable flashlight."}
{"rating":"4.0 out of 5 stars","title":"Miniature in size & price, but big on light output!","author":"NSB","date":"on February 10, 2018","body":"Given my many prior, poor experiences with several of the low-price\/knockoff CREE type LED, zoomable style flashlights I've bought of this design, these lights are a surprisingly good purchase. I've left off 1 of the 5 stars for 2 main reasons detailed in PRO's\/CON's list below:\nCONS:\n1- Without (very) fresh batteries, the luminosity quoted in the product description isn't consistently provided by these lights- except on full, fresh batteries, the light is much dimmer than it can be when the light has fully powered batteries in it, so you'll end up going through batteries faster than normal (thankfully, the \"Amazon Basics\" AA batteries are very good quality & are very cheap compared to name-brands, so this is a solveable issue, just wasteful, seeing as you end up tossing batteries which still hold some charge- I've ended up using the 1\/2 dead flashlight batteries in my cable box remotes in an effort not to waste them).\n2- Like many of the economical flashlights being sold of this design type, sometimes the power-button press to cycle between modes happens without your input, turning on the strobe setting or the lower light output setting without my intending to do so by pressing the power button.\nPROS:\n1- These lights are very compact, yet with fully charged batteries, they have a high light output for their size. Given the amount of light they provide when fully powered, they do a good job to the point that my wife always keeps one in her purse & her car for being about at night &\/or walking our dog after dark.\n2- Unlike many of the other flashlights I've bought of this design\/type, these lights have held up quality-wise over a decent amount of use- working just as they well as they did when they'd 1st arrived.\n3- The price asked would be inexpensive for 1 CREE-type LED light of this design & high quality, so very good value for a 2 pack!\n\nOverall I certainly recommend them if you're looking for a good, low-cost & compact CREE-type LED, zoomable flashlight which works well & is of good quality.."}
{"rating":"5.0 out of 5 stars","title":"It's a great personal LED flashlight that easily fits into a pocket.","author":"Coconut eater","date":"on February 10, 2018","body":"Tiny yet powerful and the battery charge seems to last a long time."}
{"rating":"5.0 out of 5 stars","title":"One battery and it lights up like a police helicopter","author":"Dr. LRF, DPT","date":"on February 10, 2018","body":"My husband is obsessed with this flashlight. One battery and it lights up like a police helicopter. Best flashlight ever. It can zoom or be diffuse. It's heavy and wish it had a wrist strap but otherwise awesome."}
{"rating":"5.0 out of 5 stars","title":"Works great. Husband and Dad liked the flash lights and ...","author":"victoria","date":"on February 10, 2018","body":"Works great. Husband and Dad liked the flash lights and size is easy to take with you anywhere. Will buy again"}
{"rating":"5.0 out of 5 stars","title":"Very good for the price!!","author":"M4RC3L0","date":"on February 7, 2018","body":"Awesome value for the price!! Well build and powerful enough - the lenses are a smart way of defusing the light - it works well."}
{"rating":"4.0 out of 5 stars","title":"Great for the price, but not for your “main” light","author":"Drew","date":"on February 6, 2018","body":"Considering how little it costs for two of them, they are well built and very bright. The issue is with the switch logic. There is a single switch that turns it on\/off (hard press) and changes the mode (half press). The problem is that each time you turn it on, it switches to the next mode. So if you are using it in “high” and turn it off, you will get “strobe” next time. Not a deal breaker, but annoying.\n\nAgain, great buy to throw in a drawer, but look elsewhere for something to carry every day."}
{"rating":"5.0 out of 5 stars","title":"Great flashlights for the price.","author":"Cris0911","date":"on February 6, 2018","body":"I loved these Rockbird flashlights. I already have these flashlights for over a year, and they still work wonderfully. I lived in Florida and they came in handy when we got hit with hurricane Irma."}
{"rating":"5.0 out of 5 stars","title":"Perfect size and very bright","author":"Stuart","date":"on February 3, 2018","body":"Got it for my granddaughter camping trip. Small size which was great and very bright light."}
{"rating":"5.0 out of 5 stars","title":"This little lights are awesome!","author":"Josh B.","date":"on February 3, 2018","body":"These are my favorite! Very bright, compact, and zoomable. Plus they come in 2 pack. One for the car, and one for home. These are awesome for their price."}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"zhuhuw","date":"on February 2, 2018","body":"terrible！！！"}
{"rating":"2.0 out of 5 stars","title":"Two Stars","author":"David S.","date":"on January 29, 2018","body":"they stop working!!!!"}
{"rating":"4.0 out of 5 stars","title":"Great small flashlight!","author":"Amazon Customer","date":"on January 27, 2018","body":"The best thing on this phone is that it is sturdy and operates on one AA battery. I don't dislike anything about this phone."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"NPK","date":"on January 27, 2018","body":"BRIGHT! (and small)"}
{"rating":"2.0 out of 5 stars","title":"Two Stars","author":"Troy","date":"on January 26, 2018","body":"Not as bright as i thought it would be"}
{"rating":"3.0 out of 5 stars","title":"Uhh","author":"Amazon Customer","date":"on January 25, 2018","body":"These lights seem to have issues after a little use but as to be expected from a low priced light. It’s good as a light for the kids or in a tool box but don’t plan on performance."}
{"rating":"3.0 out of 5 stars","title":"Three Stars","author":"Amazon Customer","date":"on January 20, 2018","body":"GREAT LITTLE FLASH LITE"}
{"rating":"2.0 out of 5 stars","title":"... a long time of carrying these disappointments I am glad to say I can buy a new flash light","author":"Seth","date":"on January 18, 2018","body":"After a long time of carrying these disappointments I am glad to say I can buy a new flash light. They are okay for throw away flash lights but they are very undependable and aren't really worth keeping for more than a week. I run a small business that requires me to constantly use a flash light and I bought these as a test run. After about a week they started going in and out. I replaced the batteries and still it only worked about 45% of the time. I'm not a picky person but these had a pretty bad short in their switch so I just kept them in a drawer and used them intermittently. Glad to say though they are finally dead as a door nail and I can replace them with something a lot better."}
{"rating":"3.0 out of 5 stars","title":"Just ok","author":"Tasha Barnes","date":"on January 17, 2018","body":"U get what u pay for"}
{"rating":"5.0 out of 5 stars","title":"Powerful, tough, inexpensive","author":"Amazon Customer","date":"on January 17, 2018","body":"GREAT little flashlights! Powerful, tough, inexpensive. Strongly recommend!"}
{"rating":"1.0 out of 5 stars","title":"I have had excellent service life from other LED merchants","author":"REALDEAL","date":"on January 16, 2018","body":"BOTH flash lights stopped operating in less than a week! I have had excellent service life from other LED merchants. No excuse\nfor such dismal performance. Steven Belaus"}
{"rating":"3.0 out of 5 stars","title":"won't turn off) but the other is just fine.","author":"g","date":"on January 16, 2018","body":"one was broken (button turns on, selects through modes, won't turn off) but the other is just fine."}
{"rating":"3.0 out of 5 stars","title":"Three Stars","author":"sciera","date":"on January 14, 2018","body":"Good buy for the price but are not as bright as other flashlights on this site"}
{"rating":"4.0 out of 5 stars","title":"Small, cheap flashlights but thats what we paid for, right?","author":"Brett Wilson","date":"on January 14, 2018","body":"Super cheap. These are kind of our tiny emergency flashlights so I wasn't expecting a big sturdy flashlight. These are barely bigger than chapstick and are not that easy to put batteries in. They work but I wouldn't buy again."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"jesus de la torre","date":"on January 13, 2018","body":"Great for hikes. Light. Easy to use"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Pedro","date":"on January 13, 2018","body":"Great product"}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Tom","date":"on January 12, 2018","body":"Pretty good, well made. not real sure about 300L"}
{"rating":"4.0 out of 5 stars","title":"Works great and even survived a hand washing submerged in water","author":"Michael Cardone","date":"on January 12, 2018","body":"Works great and even survived a hand washing submerged in water.\nMy personal gripes would be when you focus the light it looks like a logo instead of a generic beam and between the different flashlights the \"logo\" isn't even placed at the same consistent angle. And I wish there was a option on the side to toggle modes instead of hitting the power. If you turn it off and on you will have bright light, dimmer light, and the strobe mode and it's somewhat annoying when you're trying to just use a damn flashlight and have to turn it off and on just to get the right light or at least not turn on in strobe mode. Minor stuff and I can't think of a multi-mode LED flashlight that isn't setup like that, but I sure with someone would set them up that way."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"ELWJR","date":"on January 11, 2018","body":"Works as advertised. No issues."}
{"rating":"2.0 out of 5 stars","title":"Uses focused beam rather than bright LEDs","author":"Josquin DesPrez","date":"on January 10, 2018","body":"These RockBirds 7W LED Mini Tactical flashlights are not that bright (but many LEDs flashlights are really too bright for most uses). They use a lens to give a highly focused beam, which isn't very good for just walking around. I like that they don't need special batteries, just AAs"}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"L. Bare","date":"on January 10, 2018","body":"No instructions as to how to open and replace batterys, they did not light when button was pressed."}
{"rating":"1.0 out of 5 stars","title":"Total JUNK!","author":"John Bingham","date":"on January 9, 2018","body":"Junk. One had the on off button quit working after a few uses and the other won’t turn on half the time. Oh yeah and sometimes it just blinks and blinks and won’t shut off. Have to take battery out to shut it off."}
{"rating":"2.0 out of 5 stars","title":"You get what you pay for.","author":"jimmy","date":"on January 8, 2018","body":"very cheap. Light does not go very far in dark. You get what you pay for. Fast shipment."}
{"rating":"5.0 out of 5 stars","title":"Big light, little package","author":"DM","date":"on January 8, 2018","body":"Great bang for the buck. It provides a lot of light for a product so small."}
{"rating":"2.0 out of 5 stars","title":"Dropped it one time from about 3ft on to dirt ...","author":"Shawna Hardy","date":"on January 7, 2018","body":"Dropped it one time from about 3ft on to dirt and the piece that focuses the light broke. Will not buy these ever again"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Johnny K.","date":"on January 7, 2018","body":"pleased with purchase, just as described"}
{"rating":"5.0 out of 5 stars","title":"These flashlights are AWESOME!!","author":"A. Brubaker","date":"on January 6, 2018","body":"These flashlights are AWESOME!!! They are very compact and do the job they need to do. They are great for around the house. Keep one in the car in case you break down. They have that neat flashing feature to warn other motorists. Take one with you while you are out walking or while you are out with your pets. The little pocket clip is a bonus. I think for the money and the size, this is the best flashlight I've ever bought."}
{"rating":"5.0 out of 5 stars","title":"So good looking, durable and bright!!","author":"Mina","date":"on January 6, 2018","body":"I love them!! OMG they look so cool and are so bright!!! I was checking the tires a few days ago and suddenly the whole \"neighborhood\" went visible! lol..\nAwesome design and I love how durable they are!\nI'll definitely recommend to my everyone I know.."}
{"rating":"2.0 out of 5 stars","title":"Not bright at all","author":"Jerry","date":"on January 5, 2018","body":"The low price is the only reason I am giving this flashlight a 2 star rating instead of a 1 star rating. This is not bright at all even on the \"high\" setting. The metal finish on the ones I received is spotty and not finished. Not impressed at all."}
{"rating":"2.0 out of 5 stars","title":"They look nice but bad quality","author":"Amazon Customer","date":"on January 5, 2018","body":"They look nice but bad quality, they rarely come on when u push the button. Have to twist the battery cover part to get it to work"}
{"rating":"5.0 out of 5 stars","title":"overall they both work great and as described","author":"Suite 201 Escape Room","date":"on January 4, 2018","body":"drains my battery quick even when of, COULD BE my personal rechargeable battery that isn't working as it should. overall they both work great and as described."}
{"rating":"4.0 out of 5 stars","title":"Nice product for a good price","author":"Amazon Customer","date":"on January 4, 2018","body":"Nice product for a good price. Wish it had a setting to remember the last light mode used instead of having to cycle through all the settings each time you turn the light off."}
{"rating":"1.0 out of 5 stars","title":"NOT SUITABLE AS BIKE LIGHT!","author":"Carol C.","date":"on January 3, 2018","body":"I bought these to use as a bike headlight. My commute to work is about 20min., which I do by bike after dark 3-4x\/wk. I always used the strobe because it is more conspicuous and drains the battery less than a steady beam, and is legal for a bike headlight in Florida. At first I was very happy with the brightness, but after 2-3wks. the light would require many clicks of the switch to turn on. Then it would go dark during my trip, and afterwards it wouldn't come on at all. This started after a total use of less than 3hrs. in strobe function, and the battery still had plenty of charge. I tried the 2nd light, and had a similar experience. Not wanting to continue risking my life, I tried to return the item, but it was not eligable. I am very dis-satisfied."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"jadek38","date":"on January 2, 2018","body":"Works well. Thank you."}
{"rating":"5.0 out of 5 stars","title":"Handy with the clip on side","author":"CJ","date":"on December 31, 2017","body":"These are good to have everywhere, especially like the clips on side so handy. Great when walking dog after dark, in car, bedside, to hold somewhere while hands busy repairing anything. Not tremendously bright but worth owning. Great stocking stuffers. Affordable."}
{"rating":"5.0 out of 5 stars","title":"These flashlights are amazing I have one in my car for emergencies and ...","author":"norman avelenda","date":"on December 30, 2017","body":"These flashlights are amazing I have one in my car for emergencies and I have another one to use when I walk my dog. The lighting is great for long distance As well as short."}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"Marykatherine Meyer","date":"on December 29, 2017","body":"Didn’t work even tried several batteries"}
{"rating":"1.0 out of 5 stars","title":"Defective. Don’t buy","author":"Sara L Walls","date":"on December 29, 2017","body":"I was VERY disappointed with these flashlights. The very first time I pushed the button to turn on the button collapsed in. Apparently they can’t be returned which is awesome."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"David Gunter","date":"on December 27, 2017","body":"Didn't realize how much I'd be using these little flashlight but I use them nightly."}
{"rating":"4.0 out of 5 stars","title":"Great Price! Horrible Square Light However..","author":"Mike Holmes","date":"on December 26, 2017","body":"I had to get a flashlight that fitted my 1” light mount for an upcoming airsoft skirmish. Thought I might as well get a combo pack! These little things pack quite a punch, and they’re tough. There not fully water resistant but they lasted through some rainfall and condensation. The lens is also quite thick because I also drop them on a concrete floor and not even a slight scratch. I ended up using them periodically over a time span of 7 hours in below 26° F weather and haven’t notice them go dim. Would recommend them because of the great value!"}
{"rating":"5.0 out of 5 stars","title":"Great, strong flashlight.","author":"sailr","date":"on December 24, 2017","body":"Small and convenient. Can never have enough flashlights in case of emergency."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on December 23, 2017","body":"Great value for the money would recommend to all. I am an appliance repairman use one every day"}
{"rating":"4.0 out of 5 stars","title":"Rockbirds LED Flashlight - small but mighty","author":"A. Carroll","date":"on December 23, 2017","body":"Excellent product at an excellent price! Arrived on time and was as described."}
{"rating":"1.0 out of 5 stars","title":"Absolutely terrible trash. Have yet to work properly","author":"diesel","date":"on December 23, 2017","body":"If i could give this product a zero i would. Absolutely terrible trash. Have yet to work properly. Wish i could have returned them. I wouldn't recommend this to anyone."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on December 22, 2017","body":"Very bright nice flashlight."}
{"rating":"1.0 out of 5 stars","title":"Do Not Buy!!!! Very Poor Quality & short lifespan!","author":"Cane Corso","date":"on December 22, 2017","body":"What a waste of money! These things looked like they'd be great, and I liked the adjustability of the beam angle. But they both stopped working within 1 week of being used. I've had lower quality cheaper crap from the dollar store last longer than these! I only rated them 1 star because there isnt an option for ZERO stars or even negative stars!"}
{"rating":"5.0 out of 5 stars","title":"Great Utilily Light for the Emergencies","author":"Hemlockfen","date":"on December 22, 2017","body":"Great for the car. Inexpensive. Cheap on batteries. Small and can be put anywhere. A lot of light for a single AA battery."}
{"rating":"3.0 out of 5 stars","title":"one broke the other was lost","author":"gary","date":"on December 21, 2017","body":"one broke the other was lost"}
{"rating":"5.0 out of 5 stars","title":"Great product","author":"lori ann","date":"on December 21, 2017","body":"Light is bright, material is good and it worked as advertised"}
{"rating":"4.0 out of 5 stars","title":"Great deal. Size and weight have made them a ...","author":"Man Day","date":"on December 20, 2017","body":"Great deal. Size and weight have made them a go to light for camping, hiking, or working around the yard\/home."}
{"rating":"3.0 out of 5 stars","title":"They aren’t super high quality","author":"Jeremy","date":"on December 19, 2017","body":"These are decent lights to keep around the house or in the car. They aren’t super high quality, one of mine the rubber cover over the on\/off switch was installed wrong and it makes it hard to operate the light. I don’t think they are really 300 lumens either. I have a 300 lumen light that I compared it to and these are a lot dimmer. Good cheap flashlight."}
{"rating":"5.0 out of 5 stars","title":"very nice set comes in handy","author":"Amazon Customer","date":"on December 19, 2017","body":"very nice set comes in handy, one for the wife an one for me. I like the clip so that I cant loose it. small compact bright, great unit"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"bob k.","date":"on December 17, 2017","body":"Awesome lights!"}
{"rating":"5.0 out of 5 stars","title":"Great! Great!","author":"Raimundo Lopes","date":"on December 17, 2017","body":"Great!"}
{"rating":"5.0 out of 5 stars","title":"and I love that it comes in a pair","author":"Sarah","date":"on December 14, 2017","body":"Small, incredibly bright, and I love that it comes in a pair."}
{"rating":"5.0 out of 5 stars","title":"great flashlight and size makes them convenient","author":"Harley chik","date":"on December 14, 2017","body":"These things seriously have range...great flashlight and size makes them convenient. Wicked bargain would buy again!"}
{"rating":"2.0 out of 5 stars","title":"I really liked these.","author":"Z.R","date":"on December 13, 2017","body":"I really liked these.. Until they just broke about a month after use. Changing battery and then never worked again. Same for both flashlights in pack"}
{"rating":"3.0 out of 5 stars","title":"weak","author":"Frank","date":"on December 13, 2017","body":"Light is weak, the strobe-light is pointless, and maybe just barely worth $5. Expected more quality, but it's all looks."}
{"rating":"5.0 out of 5 stars","title":"Bright Light","author":"reallylooney","date":"on December 12, 2017","body":"they are a great deal. they are not high end, but for the price, they throw a lot of light with 1 battery. Put them in all of the cars."}
{"rating":"4.0 out of 5 stars","title":"Great light, inexpensive","author":"Chris Miller","date":"on December 12, 2017","body":"Great light, very bright for the price. Don't really care for the strobe mode, and you have to cycle through it to get back to the brightest mode. But what can you expect for such a cheap price."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"edward chambers","date":"on December 11, 2017","body":"great"}
{"rating":"3.0 out of 5 stars","title":"It gives a good amount of light","author":"Jay","date":"on December 11, 2017","body":"One did not work. Switched the tail caps and they both work for now.. . It gives a good amount of light, but 3 stars because now I can’t rely on the light."}
{"rating":"3.0 out of 5 stars","title":"one worked, one didnt","author":"Olivia","date":"on December 11, 2017","body":"i gave it 3 stars because only one of the flash lights worked. it didnt seem worth it to send them back since i really only needed one for a Christmas gift, just seemed easier and cheaper to get the two pack. I put the batteries in and one worked right away while the other only pretends to work if the spring touches the side wall while the battery is in it and that's impossible to use since you have to close the cap to keep the battery inside. The one that works however is awesome and more than what i expected it to be, flashes, zooms and expands and is very bright for its small size. just wish the other one worked. overall happy with the one that works but disappointed only one worked"}
{"rating":"2.0 out of 5 stars","title":"Not happy with modes!!!!","author":"BillyBobBooooooJohnson","date":"on December 10, 2017","body":"I ordered similar lights to this in the past... LOVED THEM! These however constantly cycle the features each time you turn the light on.\n\nFor example:\nFirst time you turn it on... Super bright.\nNext time... Dim mode.\nNext time... Flashing pattern.\n\nNORMALLY... These types of flashlights should function:\nMomentary press button = Changes mode.\nTurn unit off = Remembers where it was."}
{"rating":"5.0 out of 5 stars","title":"Really good low cost flash lights","author":"Jonathan","date":"on December 9, 2017","body":"Really good low cost flash lights. I got them last minute for a camping trip and they worked amazing."}
{"rating":"4.0 out of 5 stars","title":"I belive there are better batteries for it but idk","author":"Carlos","date":"on December 6, 2017","body":"Its a lot brighter with duracell batteries. I belive there are better batteries for it but idk."}
{"rating":"5.0 out of 5 stars","title":"Great light, rechargeable battery friendly","author":"Mike M","date":"on December 6, 2017","body":"These are very lightweight and last forever on a single AA battery.\n\nI use them for evening strolls around (an increasingly dark as winter is upon us) set of streets and the flash mode make me very obvious to oncoming cars.\n\nSuper lightweight, and built to last. I have been using them for months without an issue. They even work well with rechargeable batteries.\n\nOne caution: Rechargeable batteries + LED's mean that when the power drops below the minimum the LEDs need, you will find that the light just stops working, unlike a bulb which dies slowly, this can cut off entirely. But keep a good charge and you won't be disappointed."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Debra","date":"on December 5, 2017","body":"Thank you"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Douglas","date":"on December 4, 2017","body":"THEY PUT THE OLD FLASH LITES TO SHAME. I HAVE BOUGHT MANY"}
{"rating":"4.0 out of 5 stars","title":"Solid","author":"Spunos","date":"on December 2, 2017","body":"goes perfectly with my bug out bag"}
{"rating":"5.0 out of 5 stars","title":"Not bad for the price","author":"Mohit Gangwani","date":"on December 1, 2017","body":"Lights work well and are bright. You have to cycle by pressing buttons for the three different settings. Not bad for the price."}
{"rating":"5.0 out of 5 stars","title":"great value for the money and brighter beam than expected","author":"Amazon Customer","date":"on November 30, 2017","body":"great value for the money and brighter beam than expected. Nice telescoping feature that allows you to adjust the light beam width\/brightness"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on November 27, 2017","body":"These little things pack a punch! They let out tons of light despite the small size."}
{"rating":"5.0 out of 5 stars","title":"They worked well and I loved the clip","author":"amat92","date":"on November 27, 2017","body":"Bought these to keep on us during hurricane Irma. They worked well and I loved the clip. Made it a bit harder to lose track of."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"D. Agnone","date":"on November 26, 2017","body":"These lights are EXCELLENT for the price!"}
{"rating":"5.0 out of 5 stars","title":"Nice bright compact light for the price","author":"Buckeye","date":"on November 25, 2017","body":"Nice bright compact light for the price. The focused beam is an odd square shape, but not an issue for me. Have been using for about 3 months and seem to be good quality. Will buy more."}
{"rating":"5.0 out of 5 stars","title":"Great little light.","author":"Nicole M. Friez","date":"on November 24, 2017","body":"Great little light. Well worth the money. Built well for a small light."}
{"rating":"4.0 out of 5 stars","title":"Surprising!","author":"James R Anderson","date":"on November 24, 2017","body":"The switch button on the end operates easily, but not so easily as to come on when, say, searching for my keys and being dead the next day.\nI like the single AA battery.\nI like the compact size. It's bright for its size-and this goes to the one thing I disliked: one photo shows this lite brightly illuminating both sides of a sidewalk. This doesn't quite do that. That overstatement is what gets this 4 stars instead of 5 from me. I got over that quickly. Ounce for ounce, this unit pulls its weight."}
{"rating":"4.0 out of 5 stars","title":"these are working great. I've had them for a few months and ...","author":"Ryan Reilly","date":"on November 23, 2017","body":"So far, these are working great. I've had them for a few months and they've been on a few camping trips. I like this size flashlight because they are easy to give to the kids and have them put them in their pockets. Big flashlights get set down, and forgotten."}
{"rating":"4.0 out of 5 stars","title":"looks like a toy","author":"H.Bekmuradov","date":"on November 22, 2017","body":"Small than expected, looks like a toy, not a real big torch."}
{"rating":"5.0 out of 5 stars","title":"Very good little lights. Nice and bright. Need to buy more of them.","author":"Coz","date":"on November 21, 2017","body":"Very good little lights. Nice and bright. Need to buy more of them."}
{"rating":"2.0 out of 5 stars","title":"Well one worked great, the other one did not work since day ...","author":"Octavio","date":"on November 21, 2017","body":"Well one worked great , the other one did not work since day one, was not so bright and just went off. Got a new battery and turned on and then off. DEAD NOW...SO , I WOULD NOT BUY! DID I MENTION THAT WE got HIT BY MARIA? YEAH AND REALLY NEEDED IT!"}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"steve","date":"on November 20, 2017","body":"Very good."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"stevi","date":"on November 20, 2017","body":"fantastic lights! great value super bright."}
{"rating":"5.0 out of 5 stars","title":"Perfect!","author":"Ronnie945","date":"on November 20, 2017","body":"These guys are perfect. I love their little size. And even though small they provide so much light. I love that I can spotlight or shine a large area. I am very satisfied and would order another one of these packs anytime!"}
{"rating":"5.0 out of 5 stars","title":"Great flashligths","author":"O. Andino","date":"on November 20, 2017","body":"Highly potent beams, sturdy and compact, great flashligths."}
{"rating":"5.0 out of 5 stars","title":"Good, solid, small flashlights - great for camping","author":"Leslie Jensen","date":"on November 19, 2017","body":"Great little flashlights for camping\/hiking. I kept one in my backpack for any emergency that might arise while hiking. And the other in the car to use at my campsites. I used the campsite flashlight EVERY night - it's small enough to comfortable fit in your pocket and bright enough to walk the dog and\/or walk to the bathroom in near complete darkness and only had to replace the battery once. The only complaint I have is that it seems to always rotate into strobe mode when I would turn it on - a little irritating, but not a deal breaker."}
{"rating":"5.0 out of 5 stars","title":"Great lights","author":"jamie fiore","date":"on November 18, 2017","body":"Very bright and durable"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Hyder Abadin","date":"on November 17, 2017","body":"Great flashlights!"}
{"rating":"5.0 out of 5 stars","title":"Love these cute little flashlights","author":"Amazon Customer","date":"on November 17, 2017","body":"perfect little flashlights!"}
{"rating":"4.0 out of 5 stars","title":"The price for these was great. For such a tiny item","author":"Healthnut","date":"on November 16, 2017","body":"The price for these was great. For such a tiny item, they are very bright. Great in case of a hurricane when candles just won't do."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Paun Marin","date":"on November 16, 2017","body":"Gooooooood"}
{"rating":"2.0 out of 5 stars","title":"for $10 i guess it's barely acceptable. but annoying","author":"anonymous","date":"on November 14, 2017","body":"fairly dim.\nalso you have to adjust the tension of the battery cap just so. if you tighten it all the way the flashlight wont function, usually. inconsistent."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Chase P.","date":"on November 14, 2017","body":"These are awesome, one has already started shorting out. Also be sure to have a spare battery with you!"}
{"rating":"1.0 out of 5 stars","title":"Not a good quality","author":"fastiger","date":"on November 14, 2017","body":"One of the flash light stop working after about a month to use. It seems like the switch problem to something internal. Not recommendable"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Pete Felicijan","date":"on November 13, 2017","body":"what a great deal"}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"MXN","date":"on November 13, 2017","body":"One DOA, second one can't use button to turn light off."}
{"rating":"2.0 out of 5 stars","title":"I was expecting too much out of these little guys ...","author":"Verdez Reviews","date":"on November 11, 2017","body":"I was expecting too much out of these little guys. Ad says 300 lumens if im remembering correctly. Id say theyre more around 90-110lumens. 3\/4 have scratched lenses which isnt too much of an issue but considering theyre scratched on the inside, it could come as a concern to others."}
{"rating":"2.0 out of 5 stars","title":"CHEAP IN PRICE, CHEAP IN QUALITY","author":"Daniel N.","date":"on November 11, 2017","body":"Expect what you pay for. These started malfunctioning after ±6 uses. Really cheaply made. Expect to have these break very fast."}
{"rating":"2.0 out of 5 stars","title":"Two Stars","author":"sandra l smith","date":"on November 11, 2017","body":"Not bright at all but handy enough"}
{"rating":"4.0 out of 5 stars","title":"Light","author":"loveldo","date":"on November 11, 2017","body":"great value"}
{"rating":"3.0 out of 5 stars","title":"i guess i need to read description better or measure better","author":"indymojo","date":"on November 10, 2017","body":"would not buy again. why to small. i guess i need to read description better or measure better. these are sooooo small. They work ok too but just to sarn small."}
{"rating":"5.0 out of 5 stars","title":"Very good item!","author":"RonV","date":"on November 9, 2017","body":"Though these were cheap quality but they are metal and really brite.Very good item!"}
{"rating":"5.0 out of 5 stars","title":"Good buy","author":"Angelo B","date":"on November 9, 2017","body":"It works as described. Does the job for me. Kids use it all the time and they're still intact. Batteries last decent amount of time so worth the money"}
{"rating":"5.0 out of 5 stars","title":"Great buy. Good price and they have three modes","author":"Ulysses gonsalez","date":"on November 8, 2017","body":"Great buy. Good price and they have three modes. Low high and sos. They also come with zoom that will allow more light and will put up a nice square when you pull the front on the flash light forward."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"b w","date":"on November 8, 2017","body":"these things put out a lotta light ."}
{"rating":"3.0 out of 5 stars","title":"Great for the kids while Camping","author":"Snax","date":"on November 7, 2017","body":"Even though, the wide angle gives a decent spray of light. With a fresh battery, these lights struggled to light the bushes from 50 yards away. That does not mean if you want to use these babies in the attic, while checking the rat traps, you wont have great light, but when you zoom the lens for a tighter Beam... you'll find a \"square\" which is emitted by the LED module\/crystal. Which is okay, (for kids) but not great if you need to really see that \"thing\" that is right there... LOOKIN BACK AT YOU ...... All in all, this is great deal for a four pack of flashlights that you can give to the kids for a camping trip, to keep them all on the same wave, but if you're looking for something else to keep you out of the dark, and give yourself a chance to stay ahead of the critters... try something else."}
{"rating":"5.0 out of 5 stars","title":"They work great. Light weight","author":"tugce","date":"on November 7, 2017","body":"Bought these as back up flashlights for the recent hurricane season. They work great. Light weight. Good price."}
{"rating":"5.0 out of 5 stars","title":"I love","author":"Angie S.","date":"on November 7, 2017","body":"Bright, small, adjustable. I love these"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Cliente de Amazon","date":"on November 7, 2017","body":"Very good, with high and low bright"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on November 7, 2017","body":"very good Item... My recomendation 100%... only used a Battery...."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Kyser15","date":"on November 6, 2017","body":"Works as expected good product! A+"}
{"rating":"5.0 out of 5 stars","title":"Highly recommend","author":"Jacqueline Jones","date":"on November 4, 2017","body":"Great product! Was very Impressed how much light they produce. Perfect for walking my dog at night. Feel a lot safer with these !!!!"}
{"rating":"5.0 out of 5 stars","title":"Superb quality, extremely bright flashlight","author":"Michael Salemi","date":"on November 4, 2017","body":"Superb quality, extremely bright flashlight at an astoundingly low price. You will NOT be disappointed. I have them all over the house and in every car...ended up buying 8 of them."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Marc P. Fregeau","date":"on November 4, 2017","body":"good value"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Serpico322","date":"on November 4, 2017","body":"Good quality construction, bright light, working with no issues, using for hiking, back packing and on the nightstand"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"William Douglas","date":"on November 4, 2017","body":"Great lights."}
{"rating":"3.0 out of 5 stars","title":"Very small in size","author":"CL0338745","date":"on November 4, 2017","body":"VERY small in size (like 3 inches at most). Good for purses or kids backpacks.\nThey work well tho."}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"Amazon Customer","date":"on November 4, 2017","body":"weak"}
{"rating":"3.0 out of 5 stars","title":"Three Stars","author":"Annette Willmore","date":"on November 3, 2017","body":"Works fine for close up lighting but distance is a problem. Not the brightest either."}
{"rating":"5.0 out of 5 stars","title":"My favorite small flashlight","author":"ps","date":"on November 3, 2017","body":"Really great flashlights, very bright, well made, for an excellent price."}
{"rating":"5.0 out of 5 stars","title":"Police grade luminescence","author":"ODB","date":"on November 1, 2017","body":"So bright it can be used as a weapon"}
{"rating":"3.0 out of 5 stars","title":"Three Stars","author":"Megan","date":"on November 1, 2017","body":"Have to press the button repeatedly to cycle through the options."}
{"rating":"3.0 out of 5 stars","title":"Quality small size flashlights","author":"Harsha B","date":"on November 1, 2017","body":"The build quality is great and they were very useful during Hurricane Harvey but one of the flashlight in the 2-pack was defective and is hard to get it working."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on November 1, 2017","body":"Awesome flashlights!"}
{"rating":"4.0 out of 5 stars","title":"good product","author":"Amazon Customer","date":"on October 31, 2017","body":"handy. don't know how long batteries last yet as they're still too new. :)"}
{"rating":"4.0 out of 5 stars","title":"HELP","author":"Jerrold Winters","date":"on October 31, 2017","body":"One of the units does not work!!! It should be replaced . There was no info as to who to contact. All the others work well."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Cami Gener","date":"on October 31, 2017","body":"I love these things. Such a steal for the price."}
{"rating":"5.0 out of 5 stars","title":"Buy These great brightness for the size and adjustable lens is awesome!","author":"Max H. Morse","date":"on October 30, 2017","body":"I love them the,1 fo me and 1 for mom very bright!!"}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"ROBERT R.","date":"on October 30, 2017","body":"good product"}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Larry basile","date":"on October 29, 2017","body":"Ok nothing spectacular"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on October 28, 2017","body":"Great lights"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on October 28, 2017","body":"Perfect"}
{"rating":"4.0 out of 5 stars","title":"Sturdy and bright","author":"Geeksquad","date":"on October 27, 2017","body":"Super bright and only takes one AA cell. Seems very sturdy."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Amazon Customer","date":"on October 26, 2017","body":"Great flash Light for a great price."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Michael Fabiano","date":"on October 26, 2017","body":"Very bright and compact"}
{"rating":"5.0 out of 5 stars","title":"Bright","author":"HG","date":"on October 26, 2017","body":"Great gifts"}
{"rating":"4.0 out of 5 stars","title":"Batteries not included.","author":"bluedot","date":"on October 25, 2017","body":"Nice. Well made. Adjustable lens. Minimal packaging. Batteries not included."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Jose","date":"on October 25, 2017","body":"Great product!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"butta yehonatan yaakove","date":"on October 25, 2017","body":"very good"}
{"rating":"2.0 out of 5 stars","title":"Wish it did not flicker","author":"Vanessa Koch","date":"on October 24, 2017","body":"I thought the flashlight was good but I did not know that it flickers and I can’t use it for the intended purpose, which is to seat guest in a performing arts center. Kind of disappointed"}
{"rating":"5.0 out of 5 stars","title":"Good working flashlights.","author":"Vladimir Vinokurov","date":"on October 24, 2017","body":"I used this type of flashlights before (they are rather generic), and these also perform as well or better than many brand name units. One thing to make sure is to tighten the clip screws using thread locker, as those screws tend to get loose over time and my get lost rendering the clip useless."}
{"rating":"1.0 out of 5 stars","title":"Not rugged. Not even a little...","author":"DenverDawg","date":"on October 24, 2017","body":"I got this in June of this year. After less than four months, it's broken. Something is rattling around inside, it won't zoom in all the way any more, and there are two rubber band like things that (I'm guessing) used to be inside the flashlight and are very likely related to why it isn't working any more. My work backpack has a pocket on the shoulder strap. It had been in that pocket for maybe a month before I discovered it had broken.\n\nThis flashlight is not rugged. Not even a little. If clipping it on an office worker's backpack for a month breaks something... Well let's just say I'm glad I didn't get into a situation where I was relying on this light. Very glad.\n\nOh, and nothing at all on this product offering about warranty, how to return it, etc. Honestly, I wouldn't accept a replacement. Only a refund.\n\nOne other and less important gripe: The pocket clip is way too rigid and is really hard to get on anything. That's why I put it on the pocket on my backpack shoulder strap. I couldn't even get the clip over the edge of my jeans pocket without using a tool to pry it open.\n\nMove on...get something else. Anything. A glow stick would be better and last longer."}
{"rating":"4.0 out of 5 stars","title":"They are decent!","author":"Sutiikare","date":"on October 24, 2017","body":"They work well, lightweight and somewhat powerful. They do the job. Good on the battery also."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"JoBean","date":"on October 23, 2017","body":"Very bright and good for the price!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Jamie Naylor","date":"on October 23, 2017","body":"Very bright"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Ed","date":"on October 23, 2017","body":"Works very well.."}
{"rating":"5.0 out of 5 stars","title":"Tough, bright, compact and inexpensive, what more could one want?","author":"Robert Wenaas","date":"on October 23, 2017","body":"The preformance and quality of these little flashlights is amazing. I haven't used one long enough to expend the single AA cell but the amount of light they put out from 1.5 volts defies belief. The color temperature is higher (bluer) than I would like for longer duration use, their small size makes up for that in convenience and their billet aluminum housing is as rugged as more expensive competitors"}
{"rating":"1.0 out of 5 stars","title":"WORST PRODUCT and CUSTOMER SERVICE","author":"Sam","date":"on October 22, 2017","body":"Unable to open battery cap of flashlights. Contacted supplier, still no response. Worst Product & Service."}
{"rating":"2.0 out of 5 stars","title":"Two Stars","author":"Amazon Customer","date":"on October 21, 2017","body":"Very dim. Not worth the money."}
{"rating":"3.0 out of 5 stars","title":"Don’t like the strobe light function","author":"J J","date":"on October 21, 2017","body":"One would not work. Amazon returned it. Don’t like the strobe light function."}
{"rating":"5.0 out of 5 stars","title":"Love that it comes in a two pack","author":"Amazon Customer","date":"on October 21, 2017","body":"Very Bright and very portable. Love that it comes in a two pack. Would purchase again."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"CU","date":"on October 21, 2017","body":"Great price, small and very bright- Easy fit in any pocket One can't have too many flashlights"}
{"rating":"5.0 out of 5 stars","title":"these flashlights are great. They seem very durable as well","author":"Seth L. Baer","date":"on October 21, 2017","body":"For the price, these flashlights are great. They seem very durable as well."}
{"rating":"5.0 out of 5 stars","title":"Great little things, but I lost one.","author":"baconschteam","date":"on October 20, 2017","body":"I was about to give it two stars since I was so sad that I lost one but then I realized that was silly. These are so bright and small! Great for camping or anything. Solid construction. Batteries haven't died. I'll buy more of these if I need more flashlights."}
{"rating":"5.0 out of 5 stars","title":"Right Size","author":"J. Dal","date":"on October 19, 2017","body":"Right size. Easy to store in small emergency bag."}
{"rating":"5.0 out of 5 stars","title":"Works great. I like having only one AA batter to ...","author":"creekapeake","date":"on October 19, 2017","body":"Works great. I like having only one AA batter to replace."}
{"rating":"2.0 out of 5 stars","title":"One works great and the other has a disfunction when trying to ...","author":"Sampen78","date":"on October 19, 2017","body":"One works great and the other has a disfunction when trying to use the “spot light.” It won’t stay in place and I manually have to hold it."}
{"rating":"3.0 out of 5 stars","title":"Not as bright as the Solaray one I have. ...","author":"MMTech1","date":"on October 18, 2017","body":"Not as bright as the Solaray one I have. These always want to start out flashing so I have to remember to push button twice."}
{"rating":"5.0 out of 5 stars","title":"Love this little, bright light.","author":"HarishS","date":"on October 18, 2017","body":"Excellent flashlight. Puts out a lot of light from a compact, durable body, uses only a single AA battery."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Basel M Humaidah","date":"on October 18, 2017","body":"Nice"}
{"rating":"1.0 out of 5 stars","title":"this isnt the one","author":"dward","date":"on October 17, 2017","body":"update. both flashlights have ceased working after less than a month. so the verdict is"}
{"rating":"5.0 out of 5 stars","title":"Sending tons of these al9ng with batteries and led lamps ...","author":"Omar Lopez","date":"on October 17, 2017","body":" do not buy this product.\n\nfantastic little flashlight!! very bright and love the zoom feature. I use it to walk dogs in the dark and it is perfect."}
{"rating":"5.0 out of 5 stars","title":"Great lights! Extremely bright","author":"BrianSalvi","date":"on October 16, 2017","body":"Sending tons of these al9ng with batteries and led lamps to 0yerto Rico. Folks having sone seruoys power issues there."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on October 15, 2017","body":"Great lights! Extremely bright. The cost makes these quite the bargain. I placed one in each of my cars. I plan on buying more to put in my squad car for an emergency, and to carry while I am on duty. By far the brightest light I have ever owned for the size."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Shirley","date":"on October 15, 2017","body":"nice flashlight for the value....."}
{"rating":"3.0 out of 5 stars","title":"Three Stars","author":"Melissa","date":"on October 14, 2017","body":"This was a great buy and they work well. Good to keep in the car glove box."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Duane R. Collie","date":"on October 13, 2017","body":"They're bright but very small. Gets the job done tho"}
{"rating":"5.0 out of 5 stars","title":"Great little flashlight","author":"Bernard G. Reeb","date":"on October 13, 2017","body":"Terrific lights you can carry for a walk, etc. Fits in your pocket. Recommended."}
{"rating":"5.0 out of 5 stars","title":"Great gift for a guy as mine keep dissapearing!","author":"Rosalie A. Strawcutter","date":"on October 12, 2017","body":"Great little flashlight. Bright and adjustable for close up or distance."}
{"rating":"5.0 out of 5 stars","title":"Solidly-Constructed Mini Flashlights","author":"La Cabaña","date":"on October 11, 2017","body":"I really liked these...so did the repairmen in my home as they walked away with the two I owned! Great gift for a man apparently!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Bobby K.","date":"on October 9, 2017","body":"This is a pair of solidly constructed, bright mini flashlights.\n\nPlan to leave one home and use the other for travel."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"miguel arellano","date":"on October 9, 2017","body":"Great"}
{"rating":"5.0 out of 5 stars","title":"Great flashlights","author":"kbn","date":"on October 8, 2017","body":"super bright, and very handy. great buy for under $10"}
{"rating":"4.0 out of 5 stars","title":"Nice Little Light - Good Value","author":"Robert","date":"on October 8, 2017","body":"These flashlights are the BOMB! Love their size and brilliant light. Reminds me of the flashlight seen on the tv show CSI."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Thomas R Fox","date":"on October 8, 2017","body":"For the money - these are very good little flashlights. Slightly bulky to carry in a pants pocket. Easy to carry in a purse, pack, coat pocket, or car. I use these with the mini butterball 14500 batteries. The total cost for the flashlights, batteries, and charger is about $20 for two. I like the strobe mode for use as an emergency signal. My only \"beef\" with the flashlight industry in general is the black color. Seriously? The point of a flashlight is to improve visibility in the darkness. Try finding a jet black flashlight during a power outage! Flashlights should be neon yellow or orange. I don't care what they look like. I want something I can easily find and use. Please stop making black colored flashlights or provide options."}
{"rating":"5.0 out of 5 stars","title":"Tactical... Why not?","author":"Amazon Customer","date":"on October 8, 2017","body":"It was just as described"}
{"rating":"5.0 out of 5 stars","title":"They are easy to use and provide sufficient light despite their small ...","author":"D,G.G.","date":"on October 8, 2017","body":"Bought them because who wouldn't want to have a tactical flash light for about $7? My friends and I laughed that we all had one for the same reason lol Until I had to use it during Hurricane Maria in Puerto Rico, it is a really good product."}
{"rating":"5.0 out of 5 stars","title":"Great!","author":"Tabitha","date":"on October 8, 2017","body":"All six flashlights worked perfectly out of the box and allows us to have quality flashlights in multiple rooms around the house. They are easy to use and provide sufficient light despite their small form factor."}
{"rating":"5.0 out of 5 stars","title":"Small but very bright.","author":"Edward F. Powers","date":"on October 6, 2017","body":"These are very sturdy, durable flashlights. They are also decently bright with two different light settings. Would definitely recommend."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Customer","date":"on October 6, 2017","body":"Small but very bright. Bought four and keep in various places around house!"}
{"rating":"2.0 out of 5 stars","title":"Besides metal casing, lower quality than Harbor Freight $2 LED flashlights","author":"Cogito ErgOsUm","date":"on October 6, 2017","body":"These are great"}
{"rating":"1.0 out of 5 stars","title":"Crap!","author":"Luis Rodriguez","date":"on October 5, 2017","body":"So I was hoping for a durable metal flashlight that had better than average candle power. What I got was essentially a $3 flashlight with a metal casing.\nFirst impressions were it was alittle lighter than I imagined.\nThe light was not even that bright. I dug out a $1.99 Harbor Freight LED flashlight and compared the 2 on my basement wall. The H Freight one out shined the Rockbird one easily. Not terrible enough to junk or return, a small metal casing flashlight could come in handy.\n\nBut when I need a bright light, I wont be reaching for this"}
{"rating":"5.0 out of 5 stars","title":"I donated these to people that needed them in Texas ...","author":"just joe","date":"on October 5, 2017","body":"Pure crap! They end up in garbage can two days after arrival. Very low quality."}
{"rating":"5.0 out of 5 stars","title":"Bright, efficient, easy to use.","author":"SilentMira","date":"on October 4, 2017","body":"I donated these to people that needed them in Texas for the hurricane. I am sure they are getting used"}
{"rating":"5.0 out of 5 stars","title":"Super powerful and bright.","author":"Tiffany Best","date":"on October 4, 2017","body":"Very bright and efficient. Easy to use."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on October 4, 2017","body":"Awesome little flashlights. Super powerful and bright. Would recommend."}
{"rating":"5.0 out of 5 stars","title":"Very good lights","author":"Sean L. Merritt","date":"on October 3, 2017","body":"Good light at cheap price"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Scot S.","date":"on October 3, 2017","body":"Very good lights use them to look into computers and copiers. Came in real handy during the tropical storm.."}
{"rating":"4.0 out of 5 stars","title":"Good but TINY","author":"Mar Quise","date":"on October 3, 2017","body":"Super bright light in a small package."}
{"rating":"4.0 out of 5 stars","title":"Overall a very useful light. However be aware that it chews up ...","author":"William Van Nostrand","date":"on October 2, 2017","body":"These are extremely tiny, they fit in the palm of my tiny lady hands but they are powerful and work great....I just want people to know because the picture can be deceiving. I would still recommend these as I use them alot."}
{"rating":"5.0 out of 5 stars","title":"Powerful little handheld flashlights and extremely useful to have","author":"Kathy w","date":"on October 2, 2017","body":"Overall a very useful light. However be aware that it chews up AA batteries. Battery life is frankly awful."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Amazon Customer","date":"on October 2, 2017","body":"Powerful little handheld flashlights and extremely useful to have! They come in handy and I have them in several rooms, my car and tucked away where I would need them inthe dark. Easy to carry, they are unobtrusive so make it very easy to stash them."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Kasa R. Reid","date":"on October 1, 2017","body":"Good little lites! A bit cheaply made, however, you can't beat the price!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"jaybird38","date":"on October 1, 2017","body":"Theses are very nice soon buy some more"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"K. Nakagawa","date":"on October 1, 2017","body":"Great deal on a 4 pack. Light works good."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"GottaBlast","date":"on October 1, 2017","body":"Great deal and very small and compact. Easily fits in a pocket or car glove box. Extremely bright!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Ed De Simone","date":"on September 29, 2017","body":"They work great and it only takes one battery but it is nothing special"}
{"rating":"4.0 out of 5 stars","title":"Great deal","author":"Matthew Thomas","date":"on September 29, 2017","body":"Well made, really inexpensive"}
{"rating":"5.0 out of 5 stars","title":"Good product","author":"Lee Wilson","date":"on September 28, 2017","body":"Great deal"}
{"rating":"5.0 out of 5 stars","title":" sweet deal($)","author":"K. Larson","date":"on September 28, 2017","body":"Good product"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Brent M.","date":"on September 27, 2017","body":" sweet deal($)"}
{"rating":"5.0 out of 5 stars","title":"Good buy.","author":"Dennis Donlon","date":"on September 27, 2017","body":" quick delivery."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Richard B.","date":"on September 27, 2017","body":"Very well made aluminum lights for a great price."}
{"rating":"5.0 out of 5 stars","title":"Works great.","author":"Richard Warner","date":"on September 27, 2017","body":"Excellent quality."}
{"rating":"4.0 out of 5 stars","title":"Rock solid flashlight","author":"Steelman","date":"on September 27, 2017","body":"Excellent flashlight and a very good value."}
{"rating":"5.0 out of 5 stars","title":"Solidly made","author":"Kevin Acharya","date":"on September 27, 2017","body":"Arrived in perfect condition, on time. Each one works great. Very happy. Have them scattered around the house."}
{"rating":"2.0 out of 5 stars","title":"Best of the best","author":"ShoreD","date":"on September 27, 2017","body":"Great flash light"}
{"rating":"5.0 out of 5 stars","title":"One of 2 has failed","author":"Peggy Lankford","date":"on September 26, 2017","body":"Very solidly made. Very bright and the beam is easily changed from concentrated to broad by sliding the lens. Runs on one AA battery which is easy to change. The LED is easily changed as well if needed. There were two in the package. The main problem is that there are three modes: bright, dim and bright strobe and you need to cycle thru all of them to get to the one you want. Every time you turn it on. It does not stay on the last mode used."}
{"rating":"3.0 out of 5 stars","title":"Good Deal!","author":"Troy Phillips","date":"on September 26, 2017","body":"Best of the best, use regular AA battery, just one battery. Similar flashlight I had in the past use 3.7v battery. Pain in the neck to get one. So I discarded. This one is the best. I am giving it as a gift to many people. Thanks for designing with common sense battery."}
{"rating":"5.0 out of 5 stars","title":"not bad but not 300 lumens","author":"Chyral","date":"on September 26, 2017","body":"I use the flashlight with a 14500 battery. The flashlight works well - however one of the 2 flashlights has failed - I guess you get what you pay for"}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"Bubbleteacrzy","date":"on September 26, 2017","body":"These are very nice, sturdy little flashlights, and it's hard to beat the price. They might not be as bright as other flashlights, but they certainly put out enough light for my needs."}
{"rating":"5.0 out of 5 stars","title":"Happy with it","author":"ED CARLISLE","date":"on September 26, 2017","body":"these are decent lights for the price but are not 300 lumens more like 100. compared it to a 125 lumens I already have and its not even as bright"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Mark Daniels","date":"on September 26, 2017","body":"Great for the kids camping trips. Light is bright!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Jim Warren","date":"on September 26, 2017","body":"Bright light! Happy with it."}
{"rating":"3.0 out of 5 stars","title":"Delighted with this 6-pack of small","author":"Alex Ingram","date":"on September 26, 2017","body":"Great for suitcases, cars, etc., while traveling"}
{"rating":"5.0 out of 5 stars","title":"not bad.","author":"A. Collins","date":"on September 25, 2017","body":" we now have 5 of them for our travels."}
{"rating":"1.0 out of 5 stars","title":"Good value","author":"philip sinson","date":"on September 25, 2017","body":"Best yet"}
{"rating":"5.0 out of 5 stars","title":"One Star","author":"Jason...","date":"on September 25, 2017","body":"Delighted with this 6-pack of small, VERY bright flashlights.\nOnly minor quibble is that it's unclear when pressing the \"On\" button will turn on a solid light, versus turning on a rapidly-flashing light.\n(Apparently the flashing light - which may or may not come on - is to confuse all those terrible criminals that are trying to attack you ... 'cause, you know, you're so likely to face that \"tactical\" situation.)\nOther quibblette is that it'd be nice to be able to remove the pocket-clip (but it's attached with 2 unusual screws). On the other hand, if it was removed, then the flashlight would roll freely on any surface on which one might lay it - which would NOT be \"desirable\". So, at least the pocket-clip keeps the otherwise completely round flashlight from rolling when layed-down.\nAll in all, I LIKE 'em - a LOT! :-)"}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"Sylvia","date":"on September 24, 2017","body":"Theyre flashlights, not incredible, not bad."}
{"rating":"5.0 out of 5 stars","title":"I love them, very compact and bright light","author":"Kasey","date":"on September 24, 2017","body":"Nice, bright little flashlight for the money. I bought a couple to have on hand for power outages and I think these will be just what I need (although I have larger, camping lantern style lights if I need to light a bigger area)."}
{"rating":"2.0 out of 5 stars","title":"... when they were only $8 They are such a great value and only take one AA battery","author":"Amazon Customer","date":"on September 24, 2017","body":"does not work"}
{"rating":"5.0 out of 5 stars","title":"Poor quality","author":"PHOENIX IKKI","date":"on September 24, 2017","body":"Great Quality ... Very durable"}
{"rating":"5.0 out of 5 stars","title":"Great light and tough material for the price","author":"DAN","date":"on September 22, 2017","body":"I love them , very compact and bright light."}
{"rating":"5.0 out of 5 stars","title":"Impressed","author":"Amazon Customer","date":"on September 22, 2017","body":"I bought these (2) when they were only $8 They are such a great value and only take one AA battery."}
{"rating":"5.0 out of 5 stars","title":"Great deal","author":"B D","date":"on September 22, 2017","body":"Poor quality. I thought these would be pretty decent, like the J5 tactical flashlights, but they are not. The reflector and insides of one has already come apart and is not easily repairable."}
{"rating":"5.0 out of 5 stars","title":"nice and bright for as small as they are,","author":"CC","date":"on September 22, 2017","body":"For the price I paid I expected to be no so tough, but they have lasted so far, and the light they provide is very bright, my only complain one of them had a defective switch, but was an easy task to tear it apart and fix it."}
{"rating":"4.0 out of 5 stars","title":"Great little light!","author":"the eliminator","date":"on September 22, 2017","body":"I typically do not write reviews, but I was impressed when I put in a AA battery. Very small flashlight, but super bright. I did not notice a big difference in brightness between the spray view and the focused view, but there could be a difference in distance (just guessing). My purpose for these was to be prepared during power outages and to maybe use while camping. I am buying some more soon. I could see these as a nice gift."}
{"rating":"5.0 out of 5 stars","title":"These are great little flashlights for the price","author":"Brent Smith","date":"on September 22, 2017","body":"Amazing little lights. Very bright and well made.Incredibly inexpensive for what you get."}
{"rating":"5.0 out of 5 stars","title":"Super Bright","author":"Nic Ng","date":"on September 22, 2017","body":"I like these little light, bought for the tool box, and are bright,"}
{"rating":"5.0 out of 5 stars","title":"Bright for small","author":"Eric","date":"on September 21, 2017","body":"Very bright and compact. Work great around the grill."}
{"rating":"5.0 out of 5 stars","title":"Works great","author":"Aleisha","date":"on September 21, 2017","body":"Nice sized, bright flashlights. They have 3 settings - bright, dim and strobe, and you can adjust the lens so it either floods or is very narrow. You really can't beat them for the price, and the form factor is great for throwing one in a drawer, one in your truck, etc.\n\nAlso running on only 1 AA battery is nice! Battery is not included though."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"J. Dodson","date":"on September 21, 2017","body":"Love these little lights. Super bright. The strobe light can be used as a defensive weapon. It totally can slow someone down."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"MR C.","date":"on September 21, 2017","body":"It is bright for a little flashlight. I always have it with me. I keep one in the car and one in my bag. I would buy this one again."}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"Cory Douglas","date":"on September 21, 2017","body":"Very bright and compact"}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"Koopay","date":"on September 21, 2017","body":"Great product"}
{"rating":"5.0 out of 5 stars","title":"Small but mighty!","author":"Robert Ackerman","date":"on September 21, 2017","body":"Excellent pocket or purse protection. We ordered these for the hurricane season. Perfect."}
{"rating":"5.0 out of 5 stars","title":"Love the AA battery size","author":"Matt Macurdy","date":"on September 20, 2017","body":"Works great, small, light and bright,"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on September 20, 2017","body":"Good little lights for the money."}
{"rating":"1.0 out of 5 stars","title":"Blinded by the light","author":"Bookworm32","date":"on September 20, 2017","body":"I’m actually surprised the amount of lights it puts out... and the ability to change the focus is amazing... Lowell made and compact.... After receiving the flashlight, I end up ordering another pair... try it and you won’t be disappointed..."}
{"rating":"5.0 out of 5 stars","title":"One Star","author":"J. B. Dian","date":"on September 20, 2017","body":"very bright. Love the AA battery size. I assume it can burn for many hours?"}
{"rating":"4.0 out of 5 stars","title":"Very practical product.","author":"chelsea","date":"on September 19, 2017","body":"Bright. 3 settings, strobe, bright and dim. Can focus light smaller."}
{"rating":"5.0 out of 5 stars","title":"Three Stars","author":"Steven J. Charles","date":"on September 19, 2017","body":"Wow these work great, can't believe you get 2"}
{"rating":"5.0 out of 5 stars","title":"Very Useful, & Bright!","author":"Mike","date":"on September 19, 2017","body":"One worked and the other would not."}
{"rating":"5.0 out of 5 stars","title":"They work just fine.","author":"Eric","date":"on September 19, 2017","body":"I'm really glad I got these. I keep one in the kitchen (for finding equipment in all the dark corners of cabinets) and one next to the attic door (I'm afraid I use the attic as kind of an extended storage closet). They're very bright and I particularly like the ability to broaden or narrow the beam. They're generally all-around handy for those of us with poor vision who need an extra boost of light at times. They're also great for finding a pet that's hiding from you because it doesn't want it's medicine."}
{"rating":"1.0 out of 5 stars","title":"Pretty good.","author":"Nathan","date":"on September 18, 2017","body":"Weird it doesn't come with batteries"}
{"rating":"2.0 out of 5 stars","title":"One Star","author":"Guy","date":"on September 18, 2017","body":"Nice bright light. And it's cool that you can widen or narrow the beam, depending on the situation. Very happy with them."}
{"rating":"5.0 out of 5 stars","title":"I like the size and that it takes just one AA ...","author":"Jan Durham","date":"on September 17, 2017","body":"The small flash lights are just what we needed. They work just fine."}
{"rating":"5.0 out of 5 stars","title":"Irma tested!","author":"Penny Lane","date":"on September 17, 2017","body":"works good. Love that it takes 1 AA and its pretty bright for what it is."}
{"rating":"3.0 out of 5 stars","title":"Five Stars","author":"Johnny S.","date":"on September 17, 2017","body":"Light does not go on sometimes and sometimes it switches itself into strobe mode on its own."}
{"rating":"1.0 out of 5 stars","title":"Great but be Careful of Quality!","author":"William R.","date":"on September 15, 2017","body":"One of the two lights had a defective switch. The one working light is lower quality than similar products I have seen, but is bright enough. I like the size and that it takes just one AA battery. I'll keep this in my office for emergency use during power outages."}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"Bacon fan","date":"on September 15, 2017","body":"They ran all night during hurricane Irma. Really did the job! Great quality."}
{"rating":"5.0 out of 5 stars","title":"Seemed high quality, power\/selector button is flawed","author":"Nicola B","date":"on September 15, 2017","body":"Great little light"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Twix","date":"on September 14, 2017","body":" good beam quality"}
{"rating":"1.0 out of 5 stars","title":"It works great and the magnification is such a helpful thing","author":"Kenneth","date":"on September 14, 2017","body":" heavy duty case."}
{"rating":"1.0 out of 5 stars","title":"Neither flashlight worked. Checked my batteries in another light ...","author":"Amazon Customer","date":"on September 14, 2017","body":"I'd gotten these previously and it was time to get a few more.\n\nI was happy with the initial batch but while they're intelligently designed, the quality of the last batch I got wasn't great. 2 of the 4 didn't function properly. Though I will say the price is pretty exceptional."}
{"rating":"3.0 out of 5 stars","title":"Honestly not worth it I tried to use them for ...","author":"Ivan's girl","date":"on September 14, 2017","body":"after the First time using the flashlight it fell out of my pocket and it hasnt worked since."}
{"rating":"5.0 out of 5 stars","title":"meh","author":"Gusto Paraganos","date":"on September 14, 2017","body":"These seem solid and good quality. However after using for one camping trip (right out of the box) the power button\/mode selector on the flashlight has developed a short. It is indecisive on whether or not it will turn on at all when clicked, and the half click to change modes guarantees it shuts off and you're hard pressed to get it to turn back on again. I should have been thorough about putting these through the paces during the return window before trying to rely on them."}
{"rating":"4.0 out of 5 stars","title":"Flashy!","author":"Jessica Milbrand","date":"on September 14, 2017","body":"Very bright, neat can hold on a keyring very helpful around the home etc."}
{"rating":"5.0 out of 5 stars","title":"Good Flashlights","author":"judi batton","date":"on September 14, 2017","body":"This flashlight deal is a steal! This light put out a strong beam for its size and its very durable. I am a locksmith and this has become my everyday flashlight. It works great and the magnification is such a helpful thing. I would highly highly recommend this product because the brightness, durability and the cost. Get you one and i promise you will not regret it!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"SusanF","date":"on September 13, 2017","body":"Neither flashlight worked. Checked my batteries in another light , problem with Rockbirds flashlight ,"}
{"rating":"5.0 out of 5 stars","title":"Very efficient and versatile little flashlights.","author":"CJ","date":"on September 13, 2017","body":"Honestly not worth it I tried to use them for work and they worked half the time. The light would randomly start to change then just stop working. Just stay away from these"}
{"rating":"4.0 out of 5 stars","title":"Bought before hurricane Irma. Wanted led flashlights. Small ...","author":"JTL","date":"on September 13, 2017","body":"They are okay, but not very bright if only using regular batteries. Don't get these unless you want to invest in the extra powerful battery\/charger. This doesn't put out nearly the light that the duracell 350 puts out with 4 aaa batteries(I use rechargables)"}
{"rating":"3.0 out of 5 stars","title":"Small, but mighty","author":"Tina Silmon","date":"on September 12, 2017","body":"Great product at a great price!"}
{"rating":"5.0 out of 5 stars","title":"These flashlights had high and low beam as well flashers ...","author":"Amazon Customer","date":"on September 12, 2017","body":"Very small flashlights but they work well. I would have given a full 5 stars but one of them wanted to be annoying and not work 100% of the time. The light exposure was great, it gave a lot of bright light. They only take 1 AA battery which is great. I purchased a 24 pack of AA's with these flashlights- both were a good purchase."}
{"rating":"5.0 out of 5 stars","title":"Awesome Flashlights!","author":"Kody R. Latham","date":"on September 12, 2017","body":"nice and bright"}
{"rating":"1.0 out of 5 stars","title":"Perfect","author":"Joshua D. O'byrne","date":"on September 12, 2017","body":"Great little flashlights with good power and variable light beam to fit different situations. They were very useful and efficient in a power outage during a hurricane. I ordered two more."}
{"rating":"5.0 out of 5 stars","title":"One Star","author":"Spaniel luver Todd","date":"on September 11, 2017","body":"Bought before hurricane Irma. Wanted led flashlights. Small enough to fit in pocket. They were exactly what we needed , as our power was off several days.\nDon't overlook this pair of mini flashlights. They do the job."}
{"rating":"3.0 out of 5 stars","title":"Very bright!","author":"Seve","date":"on September 11, 2017","body":"These ended up being very handy, but I didn't realize how small they would be. To be fair to the manufacturer I probably didn't grasp what the dimensions they posted really meant so it's in. I way their fault. For those of you who are not as found of math or lack basic sense of spatial awareness (like me), these little guys are about palm size. Maybe a little smaller or bigger depending on your body proportions, but that's my best comparison out the gate.\n\nAll that being said these are some nifty flashlights. They have a bright, medium, and strobe setting which you change by halfway pressing the power button. I found that out a bit of a startling way, but was none the less impressed. Overall I am satisfied with my purchase."}
{"rating":"5.0 out of 5 stars","title":"Not as bright as expected. One very irritating feature ...","author":"Frederick","date":"on September 11, 2017","body":"These flashlights had high and low beam as well flashers...my only complaint their size..looking at the picture,I was expecting something bigger."}
{"rating":"3.0 out of 5 stars","title":"Five Stars","author":"Michael simpson","date":"on September 10, 2017","body":"Awesome flashlights! Definitely recommend!"}
{"rating":"5.0 out of 5 stars","title":"Three Stars","author":"svkru","date":"on September 9, 2017","body":"Perfect little flashlight. Feels very durable and rugged. Has three settings: bright, less bright, and strobe. Runs on a single battery, so it's cheap and easy to use."}
{"rating":"5.0 out of 5 stars","title":"So much light from such a tiny flashlight","author":"Casey W","date":"on September 9, 2017","body":"No durability, both of them broke quickly after purchase."}
{"rating":"3.0 out of 5 stars","title":"Nice!","author":"Glenn Sanders","date":"on September 9, 2017","body":"Surprisingly small flashlights, but work great and are very bright. Like the option to focus or in focus (spread the beam) the light."}
{"rating":"5.0 out of 5 stars","title":"smaller than expected","author":"Amazon customer","date":"on September 9, 2017","body":"Not as bright as expected. One very irritating feature is that pressing the ON button cycles through the flashlight's modes. So, whenever you turn it on, it turns on in low light, strobe, or high (in that order)."}
{"rating":"5.0 out of 5 stars","title":"Excellent flashlight!","author":"Bigwolf Alpha","date":"on September 9, 2017","body":"These are great, light up the night, need to order 8 more!"}
{"rating":"1.0 out of 5 stars","title":"Drains battery fast but very bright and compact","author":"superhombre11","date":"on September 8, 2017","body":"NOT REAL BRIGHT"}
{"rating":"5.0 out of 5 stars","title":"Unreliable","author":"Jorge Reyes","date":"on September 8, 2017","body":"Very happy with my purchase! They are tiny metal\nmagic flashlights as they illuminate so much light!!!\nPerfect feeling in your hand and great for kids as well! Three modes: bright light, refular light and strobing ligh."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Pablo Caballero","date":"on September 8, 2017","body":"Pretty brigt for their size"}
{"rating":"5.0 out of 5 stars","title":"A very good product","author":"patrick","date":"on September 8, 2017","body":"good lights and feel sturdy but way smaller than expected."}
{"rating":"3.0 out of 5 stars","title":"Best frickin lil light at great price you can see ...","author":"Shawn","date":"on September 7, 2017","body":"Excellent flashlight! Love it. Very bright. Requires only one battery. Would buy more if needed."}
{"rating":"5.0 out of 5 stars","title":"Decent flashlight, but mediocre design regarding the battery","author":"Emonroe","date":"on September 7, 2017","body":"A little bummed at how fast it's draining the battery, but it is very bright. Loving the bright and dim modes but kind of hating the strobe. I guess if you have a BYO strobe party it's cool or you have to defend yourself against a racoon, but otherwise it's another button you have to push to get to bright mode again"}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"mek","date":"on September 7, 2017","body":"These are totally unreliable. Most of the time they don't On when you need them to."}
{"rating":"3.0 out of 5 stars","title":"Based on the good reviews, I bought this pack of two flashlights ...","author":"Ms Dee","date":"on September 6, 2017","body":"Great product."}
{"rating":"5.0 out of 5 stars","title":"... I thought it would be but it's still a great price for the amount of flashlights you","author":"Jillian E.","date":"on September 6, 2017","body":"Incredible product for 9.99. I have rechargeable batteries and bought these because of hurricane Irma but the power save mode is much appreciated. It is very bright and the ability to focus the light if you need too is very helpful too. They are a little small (pocket sized) but they are quite strong. Like I said, incredible product for 9.99 ($5 each flashlight)"}
{"rating":"1.0 out of 5 stars","title":"Handy little flashlights","author":"B","date":"on September 5, 2017","body":"Best frickin lil light at great price you can see 300 feet in the dark I have bought over 20 of them . JUST AWESOME PRODUCT"}
{"rating":"5.0 out of 5 stars","title":"Do not buy!","author":"Amazon Customer","date":"on September 5, 2017","body":"Bought these to put in my hurricane preparedness kit. They are ok. They feel solid, and the brightness is fine. However, when I put in the battery and tightened the cap the light came on and stayed on despite depressing the button. I loosened the cap a bit and it worked properly, but it seems like a design flaw. Not the best flashlight I've purchased, but I got two for $9.00, so for the price they are ok."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Paul Robinson","date":"on September 5, 2017","body":"Great product, well worth the money...."}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"BobR","date":"on September 5, 2017","body":"Based on the good reviews, I bought this pack of two flashlights in preparation for Hurricane Irma, as I live in Central Florida. One of the two in the pack is defective. The on\/off switch does not work so that the light shines as soon as the battery is in and it cannot be turned off without taking out the battery."}
{"rating":"1.0 out of 5 stars","title":"Big beam in small package","author":"Rosalie","date":"on September 4, 2017","body":"they are not as bright as I thought it would be but it's still a great price for the amount of flashlights you receive"}
{"rating":"1.0 out of 5 stars","title":"The others are fine, but disappointing to have one be defective","author":"Amazon Customer","date":"on September 3, 2017","body":"I wasn't expecting much out of these and bought them as a quick fix for a camping trip, but I ended up loving them and I'll use them for more than camping! It's great that they only take one AA battery and the light is still quite bright. The clip is handy, and they feel much more durable than I was expecting."}
{"rating":"5.0 out of 5 stars","title":"Cheap \/ Broken - Do Not Buy","author":"Dagny","date":"on September 2, 2017","body":"Horrible lights!! The lights change modes with any bump of the flashlight. I cannot keep them on one mode without them changing modes from power saving to flashing to high beam. Every single bump or vibration will change modes and cause the lid to come off and the battery pop off! Cheap and not worth the money!"}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"nicholas caporusso","date":"on September 2, 2017","body":"Wonderful and very bright product for the price."}
{"rating":"4.0 out of 5 stars","title":"One Star","author":"Osmar L.M","date":"on September 2, 2017","body":"Great for the pocket and traveling"}
{"rating":"3.0 out of 5 stars","title":"Four Stars","author":"Picky Nancy","date":"on September 2, 2017","body":"These are great little lights and put out a big adjustable magnified beam. They last about 3 years before switch or other problems develop but worth every bit of the money paid."}
{"rating":"1.0 out of 5 stars","title":"Small flashlights with okay light.","author":"Sandi","date":"on September 2, 2017","body":"One of the four flashlights doesn't work. The others are fine, but disappointing to have one be defective. Actually,a second one has stopped working. I am going to see if I can contact the seller."}
{"rating":"4.0 out of 5 stars","title":"BE AWARE--NO RETURN","author":"D. K.","date":"on September 2, 2017","body":"Very unhappy with these -- they feel cheap, and one looks like it's been damaged. And now I find out that I can't return them."}
{"rating":"5.0 out of 5 stars","title":"Solid feel.","author":"Amazon Customer","date":"on September 1, 2017","body":"Great little flashlights, make good gifts. Sturdy and provide bright light."}
{"rating":"4.0 out of 5 stars","title":"Worth it","author":"dudetoml","date":"on September 1, 2017","body":"No returns and that's no good"}
{"rating":"5.0 out of 5 stars","title":"Initial Quality Issues","author":"RaddMan","date":"on September 1, 2017","body":"Good flashlight for a price."}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"UK Wildcats","date":"on September 1, 2017","body":"Small flashlights with okay light. Not something I'd use except maybe to find my way to the bathroom in the middle of the night"}
{"rating":"4.0 out of 5 stars","title":"Love them","author":"Amazon Customer","date":"on September 1, 2017","body":"I ordered these last week and after putting a battery in the first one thought it seemed like a good product, especially liking the small size. I tried putting a battery in the second one and it will not close. Apparently the grooves are stripped so it will not hold the end which secures the battery. I tried to return and today discovered they are NOT ELIGIBLE FOR RETURN so I have one flashlight instead of two. I am wondering how long this one will last."}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"James B.","date":"on September 1, 2017","body":"These lights have a nice, solid feel to them. I like'em. I have not used them much so I can't comment on the operational quality. All too often, cheap flashlights tend to start having problems with the on\/off buttons or you have to smack them to get the light to turn on. We'll see how these hold up."}
{"rating":"5.0 out of 5 stars","title":"Great price on this two pack","author":"SOR","date":"on September 1, 2017","body":"Nice little flashlight. A lot of light for something this size. Definitely worth the price."}
{"rating":"5.0 out of 5 stars","title":"Nice small and handy flashlights","author":"M. Brown","date":"on September 1, 2017","body":"One of the flashlights worked great right out of the box. The second light had an issue with the focusing collar. Extending the collar took a greater amount of effort over the first one and it snapped back upon releasing it. If there's an o-ring inside, it's too snug and is creating vacuum on extension. It doesn't snap back all the way leaving about one-eighth inch gap. The only way I could retract it all the way was by rotating the collar as I pressed down and as I pulled up. Eventually I could fully extend it and retract it with no issues. The same flashlight had a short issue with the switch. One day upon pressing the on-off button it flashed on momentarily then remained off. Pushing down on the button had no effect and the switch would not lock in position. It wouldn't even rotate to the next position. I Removed the switch portion from the main body and tapped it on a table and tried pressing again. No change. I eventually screwed the switch back figuring that it was broken. After screwing it back on I tried pushing the button one last time. It worked again! Probably some debris inside the switch worked free. I was going to ask the seller for a new switch as the problem could occur again at some inconvenient future time."}
{"rating":"5.0 out of 5 stars","title":"Bargain LED Flashlight.","author":"Jessbandit","date":"on September 1, 2017","body":"two small flashlights that light things you point at."}
{"rating":"1.0 out of 5 stars","title":"Handy lil light","author":"Vicki Church","date":"on September 1, 2017","body":"They work great."}
{"rating":"5.0 out of 5 stars","title":"Flashlights are ok better than I expected can't really beat 2 flashlights for ...","author":"Roxanne Hayes","date":"on August 31, 2017","body":"Handy little things to have around the house and in the car. Very bright."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Aaron","date":"on August 31, 2017","body":"these babies are bright and do not really go through the batteries. Great price on this two pack."}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on August 31, 2017","body":"Nice small and handy flashlights. I kept one myself (always in my pocket), gave one to my wife and one to my grown-up son, and am keeping one in my car. Will be handy during very likely upcoming (now as the temperature has hit 100F) power outage and soon approaching Fall season's power outages."}
{"rating":"1.0 out of 5 stars","title":"Not a good product!","author":"A. Mazon Customer","date":"on August 30, 2017","body":"For $4.50? This is nuts. One for each car."}
{"rating":"5.0 out of 5 stars","title":"You get what you pay for","author":"ibmford","date":"on August 29, 2017","body":"I got them today n love them. Small n handy. I put one in my daughters car"}
{"rating":"4.0 out of 5 stars","title":"Good for dealing with emergencies","author":"Kris","date":"on August 29, 2017","body":"Flashlights are ok better than I expected can't really beat 2 flashlights for the price only had for a few days but so far so good.\n2nd review haven't had the flash lights longs and starting to not work thought was good first 2 weeks then work half the time"}
{"rating":"1.0 out of 5 stars","title":"Not great, but worth the price.","author":"JJ","date":"on August 29, 2017","body":"These are great. Experienced a power outage. We're very helpful."}
{"rating":"5.0 out of 5 stars","title":"One for the price of two","author":"Chris","date":"on August 29, 2017","body":"A must for everyone. Works very well"}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"keith owens","date":"on August 29, 2017","body":"They aren't very bright and only turn on half the time. Don't waste your money."}
{"rating":"3.0 out of 5 stars","title":"DONT BUY!!!","author":"Paul Rodas","date":"on August 28, 2017","body":"One of them, the threads holding the battery cap in, stripped the first time that I took it off."}
{"rating":"3.0 out of 5 stars","title":"Three Stars","author":"Adam","date":"on August 28, 2017","body":"These work even when repeatedly submerged under water about 12\" deep. Good for dealing with emergencies, floods, surf fishing..."}
{"rating":"5.0 out of 5 stars","title":"good for the vehicle","author":"Able Devildog","date":"on August 28, 2017","body":"These flashlights aren't as bright as I expected, but they work. I don't really like how each press of the power button cycles through the three settings (bright, dim, flashing). When I press the power, I expect it to always start on the bright setting, but it doesn't. It goes to whatever setting was next in the rotation. It's not a big deal, but it's a little annoying.\n\nI would give these 3 stars, but the good price point bumps it up to 4. I didn't pay much for these, so they're mostly worth the price. I have another small flashlight I much prefer, but it was also a lot more expensive."}
{"rating":"4.0 out of 5 stars","title":"Outstanding buy for the price","author":"Linda K.","date":"on August 25, 2017","body":"Opened the box, grabbed one of the flashlights, twisted the top off, placed the battery. Seemed to work pretty good. Then, I grabbed the other flashlight, twisted the... twisted the stuck top, pull the top, WD40 the top, twist the top while holding the body with pliers, threw in trash. The top was welded on and stripped so badly there was nothing I could do to open it and place the battery. If you're going to seal it shut, at least provide the battery. Ridiculous."}
{"rating":"4.0 out of 5 stars","title":"Follow the light","author":"Nalo","date":"on August 25, 2017","body":"These are amazingly good little flashlights. Ten stars for the set!"}
{"rating":"5.0 out of 5 stars","title":"One Bright, One Dim!","author":"Karen","date":"on August 25, 2017","body":"Don't buy these little flashlights. When I got them one of the button on the back of the flashlight doesn't work and this product did not allow returns."}
{"rating":"5.0 out of 5 stars","title":"Great Flashlight","author":"Charles P. Mcalpin","date":"on August 24, 2017","body":"Fair value, very cheap and functional."}
{"rating":"5.0 out of 5 stars","title":"im shocked","author":"circuitbored","date":"on August 24, 2017","body":"Work well, good for the vehicle."}
{"rating":"5.0 out of 5 stars","title":"Solid little light.","author":"Stephen P.","date":"on August 24, 2017","body":"After a power outage, I decided we needed more flashlights available. The cheap 9 LED flashlights just didn't cut it and it was a lot of trouble having to insert three batteries into the flashlight cartridge. I have only tried out one Rockbird but the results were good. It isn't the most powerful flashlight around but it does the job. It puts out plenty of light and inserting one AA battery is very easy. For general use, it is a very good flashlight. My only con is that it is black and hard to find in the dark and in dark drawers. Wish I was able to get them in silver."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"ROTTO","date":"on August 22, 2017","body":"Perfect size for purse or glove box. Great for carrying on night walks. Would give 5 star but i prefer sa wrist strap added."}
{"rating":"5.0 out of 5 stars","title":"Don't waste your money on flash lights that take AAA batteries","author":"uclafan","date":"on August 22, 2017","body":"Handy little flashlights and I thought the clip would be great for for those times I don't happen to have pockets. So far I found that the metal bar is so tight that I can't it to clip on any clothing and I am afraid to pry it open too far in case it snaps off.\n\nI also received one that was great and one that was significantly dimmer. Can't blame the batteries as I switched them out with the same results.\n\nIf they were both the same intensity I would rate them 5 stars."}
{"rating":"5.0 out of 5 stars","title":"Great little lights. Strong light.","author":"kiersten bender","date":"on August 22, 2017","body":"Nice, durable flashlights that are surprisingly very bright. This was a great addition to my emergency pack."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Jimmylee Almen","date":"on August 22, 2017","body":"it is a bright,durable and cheap little light perfect for camping and the like. i even used as an ice hammer when i forgot to close the lid on my ice chest and the top layer froze solid. still works btw"}
{"rating":"5.0 out of 5 stars","title":"Thank you","author":"Hiten U.","date":"on August 21, 2017","body":"Bright, well built, handy little flashlights. Easy to carry in one's pocket. Like that they only need a single AA battery."}
{"rating":"5.0 out of 5 stars","title":"Great item as expected","author":"miguel","date":"on August 21, 2017","body":"Good quality for the price. Feel sturdy."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"James","date":"on August 21, 2017","body":"Incredibly bright! Don't waste your money on flash lights that take AAA batteries. These take just"}
{"rating":"3.0 out of 5 stars","title":"Five Stars","author":"Jesus Andrade","date":"on August 20, 2017","body":"Excellent. Just what I needed."}
{"rating":"5.0 out of 5 stars","title":"Review on bockbirdes LED flashlight A 100 mini superbright","author":"V. L. Caruso","date":"on August 19, 2017","body":"kinda small but will update when we go camping this thursday!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Zero","date":"on August 19, 2017","body":"Thank you very much."}
{"rating":"5.0 out of 5 stars","title":"Small but bright","author":"FreeFlow","date":"on August 18, 2017","body":"Great item as expected"}
{"rating":"1.0 out of 5 stars","title":"Bright LED Flashlight","author":"B-Rad","date":"on August 18, 2017","body":"I like it"}
{"rating":"4.0 out of 5 stars","title":"Don't waste your money","author":"Amazon Customer","date":"on August 18, 2017","body":"Great light"}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"Robert","date":"on August 18, 2017","body":"A OK flashlight for the price good for fishing hunting and outdoor activities Like the fact that it's made with a metal material very bright Love the belt clip Good product"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on August 17, 2017","body":"Great little flashlight. It works well and is very bright for its size."}
{"rating":"5.0 out of 5 stars","title":"just like me: )","author":"RMSMITH","date":"on August 15, 2017","body":"Very bright, well made, I like that it only uses one battery. Small enough to fit in my pocket. I use it for dog walks at night. It lights up the ground very well and has a decent light projection for being so some. It was a very good buy."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"James W. Bixler","date":"on August 15, 2017","body":"The lights are great LED lights. They came in handy during a recent camping trip and a late night going trip. Great Bargain!!"}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"tj&mw67","date":"on August 14, 2017","body":"These things are junk. They work for about 2 minutes and then they die. Not battery dead just dead. Don't waste your money"}
{"rating":"5.0 out of 5 stars","title":"Absolute Garbage","author":"Michael Bonde","date":"on August 14, 2017","body":"nlce flashligh like the fact aa battery"}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"Josh Hollingsworth","date":"on August 14, 2017","body":"Great product"}
{"rating":"5.0 out of 5 stars","title":"Dangerous","author":"Mike","date":"on August 12, 2017","body":"Small and powerful...just like me :)"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Justin Johnson","date":"on August 11, 2017","body":"I installed the batteries and they both worked great."}
{"rating":"5.0 out of 5 stars","title":"Perfect little flashlights","author":"Amazon Customer","date":"on August 10, 2017","body":"Great flashlight. Great price!"}
{"rating":"3.0 out of 5 stars","title":"Five Stars","author":"LOUIS MCLEAN","date":"on August 10, 2017","body":"I bought these flashlights to keep in the glove box of both cars to use in case of an emergency. They both failed only after using them several times. The product is garbage and i threw both of them away. Not even worth the hassle of packaging them back up to send back. You get what you pay for I guess."}
{"rating":"5.0 out of 5 stars","title":"Three Stars","author":"Amazon Customer","date":"on August 10, 2017","body":"Nice light."}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on August 9, 2017","body":"One worked fine but the other heated up to an unsafe temperature, hot enough we removed the battery and disposed of it. If we had left it much longer it could have been seriously bad news."}
{"rating":"2.0 out of 5 stars","title":"Very sad bout this","author":"Matthew","date":"on August 8, 2017","body":"Great for the price!"}
{"rating":"5.0 out of 5 stars","title":"Ok for price, didn't last super long.","author":"DOUGLAS W. BRESCHINI","date":"on August 8, 2017","body":"These little guys are rugged, durable, functional, and easy to use. Great purchase! Especially for the price, you cant go wrong."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Todd","date":"on August 7, 2017","body":"Blinding light one battery love it"}
{"rating":"5.0 out of 5 stars","title":"fantastic product.","author":"Amazon Customer","date":"on August 7, 2017","body":"Not as expected"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"R Merten","date":"on August 7, 2017","body":"Nice little flashlights."}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"Michael C.","date":"on August 7, 2017","body":"Was really excited for these lights. Poor quality the on\/off button on one is failing it doesn't turn on and the others internals aren't holding together where it should slide to zoom very disappointed in this product."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Nic","date":"on August 7, 2017","body":"The flashlights haven't been very durable. The back button get's kind of finicky where you have to click it several times for it to turn back on."}
{"rating":"5.0 out of 5 stars","title":"Not the brightest","author":"Kathi S","date":"on August 5, 2017","body":"Awesome Product works really good."}
{"rating":"5.0 out of 5 stars","title":"Excellent!","author":"MAN OF STEEL","date":"on August 5, 2017","body":"For the price, fantastic product."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on August 5, 2017","body":"Awesome light and wicked bright"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Annabelle Lee","date":"on August 5, 2017","body":"love the AA, bright, use it everyday"}
{"rating":"5.0 out of 5 stars","title":"These LED Flashlights are so amazing an they last FOREVER","author":"Robin","date":"on August 3, 2017","body":"Good"}
{"rating":"5.0 out of 5 stars","title":"Quality - probably the best one made","author":"Rhinestone Mom","date":"on August 2, 2017","body":"Not as bright I thought it would have but works good."}
{"rating":"5.0 out of 5 stars","title":"Nifty little flashlights!","author":"Rasalin","date":"on August 2, 2017","body":"Small and bright! Excellent!"}
{"rating":"5.0 out of 5 stars","title":"For the price these are very nice and worth it","author":"Abdullah","date":"on August 1, 2017","body":"Thought they would be larger but works good.."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Julio Caezar","date":"on August 1, 2017","body":"perfect"}
{"rating":"4.0 out of 5 stars","title":"Don't Think, Perfect High Quality Carry Ons","author":"Greystone","date":"on July 30, 2017","body":"OMG"}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"E. Jones","date":"on July 30, 2017","body":" who would buy regular flashlights anymore? LED is the new bright light.... These LED Flashlights are so amazing an they last FOREVER!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Als View","date":"on July 30, 2017","body":"Exactly as described, and more. Well engineered item, water resistant 100%. Super bright white beam. Battery easy to replace. I will buy again - these make excellent gifts for friends and family (just make sure you order them some AmazonBasic AA batteries too :-)"}
{"rating":"2.0 out of 5 stars","title":"Nice lite for carrying or just extras in the glove box.","author":"Mega Matt","date":"on July 29, 2017","body":"These are pretty nifty flashlights! They are super bright but still nice and small. They seem to be very well made."}
{"rating":"2.0 out of 5 stars","title":"Two Stars","author":"EischMan","date":"on July 29, 2017","body":"For the price these are very nice and worth it. They easily compete with my more expensive Fenix flashlights. I can't speak to battery life yet though. I am definitely happy so far with them. I will update this review if they break down or die quickly."}
{"rating":"4.0 out of 5 stars","title":"You get what you pay for!","author":"Reeping Way","date":"on July 29, 2017","body":"i like this flashlight, its size and weight are perfect for its performance"}
{"rating":"4.0 out of 5 stars","title":"Feel safe with these lights","author":"james porter","date":"on July 28, 2017","body":"Bright as can be. Best survival kit addition. You should buy two of these sets. One for your back pack, one for you car, one for your apartment, and one for your travel bag. Seriously a great flashlight to carry along with you, everywhere. Very bright, focused and wide light adjustments, and durable!\n\nBuy buy buy! Ok Bye"}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"William Lee Hannibal","date":"on July 28, 2017","body":"Compact and solid"}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"brad whittaker","date":"on July 28, 2017","body":"Great little flashlights!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Tom Ward","date":"on July 28, 2017","body":"These are great... great size, excellent beam. Used them while camping."}
{"rating":"5.0 out of 5 stars","title":"Ok so far.....had about 2 months.,","author":"Stratto4","date":"on July 28, 2017","body":"These are cheap knockoffs of a more quality product. Not very bright. Not worth the money."}
{"rating":"5.0 out of 5 stars","title":"Rockbirds LED Flashlight","author":"The Irishman","date":"on July 28, 2017","body":"Used around 10 times, already stopped working, when you can get it to turn on it goes from high to low to flashing all by its self!"}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"MHSOCAL","date":"on July 28, 2017","body":"I wish they had come with some instructions, but one can figure it out. Bright light, great for small places, like a car or purse, and easy to tuck ito a pocket for an evening walk."}
{"rating":"5.0 out of 5 stars","title":"Don't work","author":"Amazon Customer","date":"on July 27, 2017","body":"Good Deal."}
{"rating":"5.0 out of 5 stars","title":"A1","author":"Ryan Peterson","date":"on July 27, 2017","body":"It would've been nice if you could've adjusted the size of the light ? But still enjoy the light."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on July 27, 2017","body":"Awesome"}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"George Morales","date":"on July 26, 2017","body":"Nice - in past flash lights crapped out after a few months - corroded with white stuff inside...will see how these do.."}
{"rating":"5.0 out of 5 stars","title":"Got both light and was excited about them (from the ...","author":"Cliente de Amazon","date":"on July 26, 2017","body":"Perfect size for evening walks! Nice and bright for the size!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on July 26, 2017","body":"Great Flashlight"}
{"rating":"5.0 out of 5 stars","title":"Cool flashlights","author":"James W. Kelly","date":"on July 26, 2017","body":"They don't work. I bought them for a trip and they don't work. What a waste of money"}
{"rating":"4.0 out of 5 stars","title":"Great buy","author":"bdj4882","date":"on July 26, 2017","body":"perfect"}
{"rating":"5.0 out of 5 stars","title":"Small and very bt\\right.","author":"David R.","date":"on July 26, 2017","body":"Great little flashlights!!!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Hack","date":"on July 24, 2017","body":"very good"}
{"rating":"4.0 out of 5 stars","title":"Buy in bulk","author":"Salman Farooq","date":"on July 24, 2017","body":"Got both light and was excited about them (from the description) one would not hold batteries because the threads were stripped. The other would not zoom\/focus light the description stated it could 🤦🏻‍♂️ Very disappointing to say the least"}
{"rating":"1.0 out of 5 stars","title":"Four Stars","author":"george","date":"on July 24, 2017","body":"Very good very good"}
{"rating":"5.0 out of 5 stars","title":"came as a 2 pack one flashlight only turns on ...","author":"richard","date":"on July 24, 2017","body":"Nice flashlights. Seem to be durable and perfect fit for a pocket."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Ricardo\/Patricia","date":"on July 23, 2017","body":"Bright light and inexpensive."}
{"rating":"3.0 out of 5 stars","title":"Five Stars","author":"donna knapp","date":"on July 22, 2017","body":"Small and very bt\\right."}
{"rating":"5.0 out of 5 stars","title":"Three Stars","author":"Amazon Customer","date":"on July 22, 2017","body":"Good, sturdy, bright flashlight."}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"Chicken Little","date":"on July 22, 2017","body":"Never can have enough flashlights!"}
{"rating":"4.0 out of 5 stars","title":"Great for bedside service.","author":"Reyes Eli Banda","date":"on July 22, 2017","body":"One out of 4 light was bad, other than that was ok."}
{"rating":"1.0 out of 5 stars","title":"Four Stars","author":"Roge","date":"on July 22, 2017","body":"came as a 2 pack one flashlight only turns on in dim mode, flash and high mode no longer work, was used on two or three times. The second one still works"}
{"rating":"5.0 out of 5 stars","title":"Don't buy. Unreliable","author":"Rob in So. Calif","date":"on July 21, 2017","body":"works great."}
{"rating":"5.0 out of 5 stars","title":"Very Nice Flashlight(s)","author":"Amazon Customer","date":"on July 20, 2017","body":"good"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Rosalund","date":"on July 20, 2017","body":"they did not come with any info."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"bpl3","date":"on July 20, 2017","body":"Good size, great intensity"}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"MangoMan","date":"on July 18, 2017","body":"Excellent flashlights."}
{"rating":"5.0 out of 5 stars","title":"Danger!Danger!","author":"richard tienken","date":"on July 18, 2017","body":"Great flashlight just wish you didn't have to cycle through the modes everytime."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Tony","date":"on July 18, 2017","body":"One does not work."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Villmater","date":"on July 18, 2017","body":"This small flashlight is small and shines very bight. Great deal for 2 Flashlights!"}
{"rating":"4.0 out of 5 stars","title":"I like this flashlight. I recommend it.","author":"Bonecat","date":"on July 17, 2017","body":"Great, powerful little flashlight that can focus its beam. Seems solid and sturdy."}
{"rating":"2.0 out of 5 stars","title":"Rockbirds LED Flashlight","author":"Happy Camper","date":"on July 16, 2017","body":"Perfect size for my purse."}
{"rating":"4.0 out of 5 stars","title":"Poor quality.","author":"john d.","date":"on July 16, 2017","body":"Excellent value."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Richard","date":"on July 16, 2017","body":"Flashlight would not turn off and almost burned my hand. It seems there is a short and the battery power is turned into heat in the handle!"}
{"rating":"5.0 out of 5 stars","title":"They're decent little lights","author":"Amazon Customer","date":"on July 14, 2017","body":"they are very useful"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Crazy Cattle Dog Lady","date":"on July 13, 2017","body":"Great Value"}
{"rating":"4.0 out of 5 stars","title":"Perfect size for dusk dog walking","author":"Dustin G.","date":"on July 13, 2017","body":"I like this flashlight, they are very bright and focus adjustable. Compare with MINI MAGLITE, this is very good and save more using 1 AA battery compare with the other brands. I recommend it."}
{"rating":"5.0 out of 5 stars","title":"Pretty good","author":"PSH","date":"on July 12, 2017","body":"The light is super Bright for its size. I am not sure how long it last on 1 set of batteries yet. I wish it had a rechargeable battery option so I gave it a 4 star."}
{"rating":"1.0 out of 5 stars","title":"Bright! Just what I wanted!","author":"KC","date":"on July 12, 2017","body":"one worked one did not work"}
{"rating":"3.0 out of 5 stars","title":"TERRIBLE","author":"Amazon Customer","date":"on July 12, 2017","body":"good little and bright light"}
{"rating":"1.0 out of 5 stars","title":"Three Stars","author":"Amazon Customer","date":"on July 12, 2017","body":"for the price its worth it. no batteries included."}
{"rating":"5.0 out of 5 stars","title":"Terrible product.","author":"FunMa of 3","date":"on July 11, 2017","body":"This is an incredibly cool flashlight. Very powerful for the size. Impressed with quality. Great deal!"}
{"rating":"4.0 out of 5 stars","title":"Great lights for a great price.","author":"randomdude1978","date":"on July 11, 2017","body":"I bought these in lightening deal not entirely realizing the compact size (my husband is a flashlight fanatic). Wow, was I ever excited to open these up and realizing they fit into my dog walking bag. It's also a nice compact size to stash in my center console. Needless to say, hubby hasn't gotten one finger on these flashlights. These are mine, all mine."}
{"rating":"3.0 out of 5 stars","title":"Four Stars","author":"Dan","date":"on July 10, 2017","body":"Good bang for the dollar."}
{"rating":"3.0 out of 5 stars","title":"liked them enough to order four more","author":"Mary","date":"on July 10, 2017","body":"Great price for the same basic light I had purchased for a higher price from another vendor. Excellent! Small, lightweight and light stream can be narrow or wide angle."}
{"rating":"5.0 out of 5 stars","title":"Three Stars","author":"LCB","date":"on July 10, 2017","body":"Complete junk. Worked for like a day"}
{"rating":"4.0 out of 5 stars","title":"Great light","author":"Amazon Customer","date":"on July 9, 2017","body":"they are cool"}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"Oleksandr G.","date":"on July 9, 2017","body":"As arrived, upon inserting the battery, the flashlight didn't turn on. Only 1 of the flashlights worked. The second flashlight, trash."}
{"rating":"2.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on July 9, 2017","body":"These mini LED flashlights are perfect for my little ones to use while we are out camping. They are heavy duty yet light and water resistant so they can withstand the rain (it always rains while camping). With these you have the ability to focus and adjust the intensity of light. There are 3 different modes: high beam, low beam and flashing and it only takes one AA battery. My son loves the handy built-in clip"}
{"rating":"4.0 out of 5 stars","title":"but not happy description and actually product functions do not match","author":"mTodd","date":"on July 9, 2017","body":" he can clip the flashlight to his pant pocket, on his shirt or where ever it fancies him. Only flaw to me is that the clip is quite stiff so it can be difficult trying to clip it on but it definitely stays in place. Overall, these are great, sturdy little lights for the money. You get alot of light from such a small flashlight."}
{"rating":"5.0 out of 5 stars","title":"Im not bright, but my flashlight is.","author":"Dan","date":"on July 8, 2017","body":"Good flashlights so far. touch design. bright light."}
{"rating":"4.0 out of 5 stars","title":"Got a good deal on these $5 s piece","author":"StormMaster","date":"on July 8, 2017","body":"Bought two of these...liked them enough to order four more. Recently opened a two pack of the second ones I ordered. Good light overall not great. Disappointed to find out one flashlight doesn't work out of the box brand new. Would've given five stars based on the value. Not an extremely bright light but better than average considering price. They also burn through AAA batteries quickly. Can't get past only getting half of what I paid for...that kills the value part that compensated for the average brightness."}
{"rating":"3.0 out of 5 stars","title":"Four Stars","author":"Happy","date":"on July 8, 2017","body":"Too small for regular use. They are listed as mini though."}
{"rating":"2.0 out of 5 stars","title":"Not bad. One of them doesn't turn on anymore","author":"Neal","date":"on July 8, 2017","body":"This was a daily deal. Gave one to my husband-he loves it."}
{"rating":"5.0 out of 5 stars","title":"Poor quality","author":"Jago","date":"on July 8, 2017","body":"Good cheap flashlight."}
{"rating":"4.0 out of 5 stars","title":"Looks can be deceiving","author":"Kenneth johnson","date":"on July 7, 2017","body":"The light is much brighter when you use 14500 3.7 v battery."}
{"rating":"5.0 out of 5 stars","title":"Good and helpful.","author":"KeriB","date":"on July 6, 2017","body":"The flashlight description stated online does not match the actual product. The product zoom is COMPLETELY different as stated in the pictures shown as what it actually does. Will keep flashlight, but not happy description and actually product functions do not match!!!"}
{"rating":"1.0 out of 5 stars","title":"love them!","author":"The End","date":"on July 6, 2017","body":"These are cery good flashlights and exactly what I expected. Flashlight doesnt stay on the same mode when turning off and on, but they do have a bright, dim, and strobe, and you can change the mode with a half push of the button while it is on."}
{"rating":"5.0 out of 5 stars","title":"ONLY ONE WORKS LIKE IT SHOULD...","author":"Greg D.","date":"on July 6, 2017","body":"Got a good deal on these $5 s piece, are very bright, or dimmer battery saving mode as well as strobe."}
{"rating":"5.0 out of 5 stars","title":"Great Little Flashlights","author":"will","date":"on July 6, 2017","body":"Bought as a gift."}
{"rating":"1.0 out of 5 stars","title":"Awesome.","author":"Candace Lovett","date":"on July 6, 2017","body":"Not bad. One of them doesn't turn on anymore, and not sure why. Battery is good, and all connections seem good. ???"}
{"rating":"5.0 out of 5 stars","title":"Rip off","author":"Walter","date":"on July 5, 2017","body":"Only one out of the two worked. Something in the switching mechanism that turns the light on and off did not work."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"hellokitty","date":"on July 5, 2017","body":"At first I was going to give it 1 star....Upon opening my package, I see this tiny box. No way that's 1 flashlight, let alone 2. I open the tiny box and see 2 tiny flashlights. Great, I got ripped off. I put in a battery to try one out just for the hell of it. Was I wrong.....these tiny things are sweet. They pack as much light power as a bigger flashlight I have, which looks similar. These are great for BOB or EDC equipment. I might even buy a couple more."}
{"rating":"5.0 out of 5 stars","title":"good deal work great and seem very durable thx","author":"love it!!!!!!!!!!!!!!!!!!!!!!!!!","date":"on July 4, 2017","body":"Wish they were brighter. Have been very helpful around the house to look in dark closets or searching for things in the car. Good product."}
{"rating":"3.0 out of 5 stars","title":"Five Stars","author":"Stimpy","date":"on July 4, 2017","body":"Awesome produced, you will not be disappointed."}
{"rating":"5.0 out of 5 stars","title":"Just ok.","author":"Amazon Customer","date":"on July 4, 2017","body":"only one of the two i received works correctly. one of them does the hi and lo and strobe. the other one shines a light only. china..."}
{"rating":"5.0 out of 5 stars","title":"Best damn little 5 buck flashlight for EDC I like ...","author":"Barb V","date":"on July 3, 2017","body":"Totally worth the price. Much brighter than the LED flashlights you buy at the checkout counter for the same price and this needs just 1aa battery rather than 3aaa like the checkout counter models. These are tiny -FYI. They fit in your palm so don't expect something bigger. Great little lights. I bought 2 just to check them out. Now I'll order the six pack and stash them all over.\n\nJust ordered 4 more. They arrived and work great."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Daniel Salminen","date":"on July 3, 2017","body":"I was so impressed by the first set that I ordered a second set. Will make a great Christmas gift. Heavy duty and great lighting."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Musicman1972","date":"on July 2, 2017","body":"This didn't work at all when I got them and they didn't refund me the price I paid🙃😐"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"iRC aDiKz","date":"on July 1, 2017","body":"Bright light"}
{"rating":"4.0 out of 5 stars","title":"Manual","author":"M. Champion","date":"on July 1, 2017","body":"these lights work great nice and bright good to keep in auto just incase thx"}
{"rating":"1.0 out of 5 stars","title":"these are super bright, need only one common AA battery","author":"Pablo Ramon","date":"on July 1, 2017","body":"compact and work great."}
{"rating":"5.0 out of 5 stars","title":"Quick shipping. Flash light is week compared to other ...","author":"Salie Yates","date":"on June 30, 2017","body":"I don't like the modes that it forces you to cycle through. I have to click through dim and flasher modes before I get to the regular bright mode which is all I wanted in the first place. For the price it's a marginally ok product."}
{"rating":"5.0 out of 5 stars","title":"Love these lights!","author":"Tom K","date":"on June 30, 2017","body":"Best damn little 5 buck flashlight for EDC I like the nuts that are on the outside holding the clip on, several other types I've had used screws but screws require very small driver to tighten, these any pliers and your good to go again, the light with 1 AA gives almost as much as the NEBO I\nhave that requires 3 AAAs strobe and multiple intensity beams all work very well. My only critique would be for a slightly less stiff clip it definitely stays on but requires an assist to clip on, or take out of pocket"}
{"rating":"2.0 out of 5 stars","title":"These are as good as any light I have used","author":"Matthew","date":"on June 30, 2017","body":"These flashlights are AMAZING and so portable and bright!"}
{"rating":"1.0 out of 5 stars","title":"These flashlights are not actually 300lumens. They are not ...","author":"Katelyn","date":"on June 30, 2017","body":"work great, super handy."}
{"rating":"5.0 out of 5 stars","title":"50\/50 chance","author":"Justan P.","date":"on June 30, 2017","body":"Excellent quality and workmanship!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"juan martinez","date":"on June 29, 2017","body":"The only problem was there is no manual instruction."}
{"rating":"5.0 out of 5 stars","title":"Feels like I'm using a 100 dollar flashlight so worth it ...","author":"Chuck1545","date":"on June 29, 2017","body":"these are super bright, need only one common AA battery. fit easily in glove box or center console of car. they don't weigh hardly anything so I imagine ideal for a purse as well. I'd purchase again in the future"}
{"rating":"5.0 out of 5 stars","title":"Worked well and were priced well.","author":"Sean","date":"on June 29, 2017","body":"Quick shipping.\nFlash light is week compared to other 300 lumens flash lights. This may be due to the fact that it uses a single AA battery.\nNot recomended."}
{"rating":"2.0 out of 5 stars","title":"Great Value","author":"hope it helps","date":"on June 29, 2017","body":"OMG! I love these flash lights! I originally I got these for my survival kit. I put one in my survival pack and the other one in my purse. I use the one in my purse all the time! My purse is so big, I loose things! Lol!"}
{"rating":"5.0 out of 5 stars","title":"not as expected","author":"Datel","date":"on June 29, 2017","body":"These are as good as any light I have used. I live in the woods and they light up the country side. I have one on my shotgun and it works great.\nSuper compact size allows for east carry and mounting on a weapon."}
{"rating":"1.0 out of 5 stars","title":"Great little light.","author":"AT","date":"on June 29, 2017","body":"These flashlights are not actually 300lumens. They are not even 200 lumens. When compared to other 300 lumen and a 200 lumen flashlight I found that with new batteries at its highest setting folly zoomed in, was still visibly dimmer than the 200 lumen flashlight. I bought the two pack, and compared both to each other with both new alkaline and fully charged nickle-cadmium rechargeable batteries and found that they do not even match each other in brightness. They're inexpensive, and were the compact size I was looking for, but it seems you get what you pay for, and in this case you pay for under 200 lumens."}
{"rating":"5.0 out of 5 stars","title":"I did not expect much from this light at this ...","author":"Ryan Dickerson","date":"on June 29, 2017","body":"One works fine, the other was DOA"}
{"rating":"1.0 out of 5 stars","title":"Amazing little light!","author":"Joe","date":"on June 27, 2017","body":"More than I expected. Got these for 5 dollars a piece."}
{"rating":"5.0 out of 5 stars","title":"One Star","author":"Michael D.","date":"on June 27, 2017","body":"This item for 10 dollars is so worth it!!! Feels like I'm using a 100 dollar flashlight so worth it ordering more!!!!!"}
{"rating":"2.0 out of 5 stars","title":"great item","author":"Chris","date":"on June 27, 2017","body":"Worked well and were priced well. The lights are bright, they include a strobe light and a wide to narrow beam focus and a belt clip. They are made well from sturdy metal with no plastic parts."}
{"rating":"5.0 out of 5 stars","title":"So far so good, not super bright but not bad either","author":"Craig B.","date":"on June 27, 2017","body":"Good value and quality. perfect for my needs"}
{"rating":"5.0 out of 5 stars","title":"Great buy at a great price.","author":"NHS","date":"on June 27, 2017","body":"One failed within 5 days.the on off switch stopped working"}
{"rating":"5.0 out of 5 stars","title":"Birght light","author":"Juan franco","date":"on June 27, 2017","body":"Got two of these on deal of the day. I should have bought a dozen and stashed them everywhere. They work great and are small enough to use wherever a light is needed. Very intense for a small light."}
{"rating":"1.0 out of 5 stars","title":"tiny flashlights big area of light!","author":"Kirk Szczepkowski","date":"on June 26, 2017","body":"I did not expect much from this light at this price, but I did expect it to last longer than one day. It did not."}
{"rating":"5.0 out of 5 stars","title":"Disappointing.","author":"Jay Foster","date":"on June 26, 2017","body":"I got a 2 pack on sale for like 8$. These are incredible little lights and being adjustable can focus on at a distance."}
{"rating":"1.0 out of 5 stars","title":"Five Stars","author":"Frak","date":"on June 26, 2017","body":"little rust inside and poor quality"}
{"rating":"1.0 out of 5 stars","title":"Very Dim and Disappointing.","author":"reb","date":"on June 25, 2017","body":"great item"}
{"rating":"1.0 out of 5 stars","title":"One Star","author":"Mark","date":"on June 25, 2017","body":"Just received these today. So far so good, not super bright but not bad either. They feel a little \"flimsy\" so not sure how long they will hold up. About what you'd expect for $9, definitely wouldn't spend more than that."}
{"rating":"2.0 out of 5 stars","title":"One unit works great. It will be good for my tool box ...","author":"John","date":"on June 25, 2017","body":"I purchased the 2 pack. They arrived quickly. Only take 1 AA battery and it was easy to install. I bought them so I could keep one in my cars glovebox and one either on me or in my apt. For the price they are perfect. Heavy duty housing that doesn't feel cheap. Also has strobe function."}
{"rating":"5.0 out of 5 stars","title":"Not all that good.","author":"Amazon Customer","date":"on June 24, 2017","body":"This flashlight is like having your own personal automobile headlight. set to high beam. Very bright flashlight and barely the size of you pinky finger, incredible!!"}
{"rating":"5.0 out of 5 stars","title":"BRIGHT LIGHT FOR NIGHT","author":"**BlackStar**","date":"on June 24, 2017","body":"tiny flashlights big area of light! A++"}
{"rating":"5.0 out of 5 stars","title":"super bright","author":"tdemp3","date":"on June 24, 2017","body":"Does not return to bright after powering off, full clicks cycle through modes the same way that half-clicks do. Brightness seems below what is advertised. Will likely return."}
{"rating":"5.0 out of 5 stars","title":"Nice portable flashlights.","author":"Ellen Harris","date":"on June 24, 2017","body":"these flashlights are awesome!"}
{"rating":"5.0 out of 5 stars","title":"Buy yourself a few of these great flash lights.","author":"Linda L.","date":"on June 23, 2017","body":"Incredibly dim. The rubber on the button is warped and bubbled. I found metal shavings in the threading of the battery chamber. Did I mention that it is so dim it's pathetic? I was going to give this as a gift but after trying it out I would be so ashamed if I had given it. Other than the metal shavings, warped rubber button and a pretty poor battery fit it does feel like it does feel like it is a well built flashlight, too bad that its so weak at actually producing light."}
{"rating":"2.0 out of 5 stars","title":"Five Stars","author":"Tom W","date":"on June 23, 2017","body":"The flashlights were defective when received. One could not be opened to insert a battery. Cheap and unreliable."}
{"rating":"5.0 out of 5 stars","title":"The one light is nice for the price but I paid for","author":"Amazon Customer","date":"on June 23, 2017","body":"I know they were not expensive. One unit works great. It will be good for my tool box at work. The other .. the lens is messed up and not half as bright as the first. So in closing 50\/50 dosnt work for me."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Jonathan N.","date":"on June 23, 2017","body":"To be honest, I'm not impressed. I'm comparing these to my Streamlight Protac, which is also 300 lumens.\n\nFirstly, at first glance the construction seems fine. Quality of materials is ok.\n\nSecondly, there is no way in Hell that these flashlights are 300 lumens. I'd wager that they aren't even 100 lumens. Not bright at all."}
{"rating":"5.0 out of 5 stars","title":"Don't pass em up","author":"Amazon Customer","date":"on June 22, 2017","body":"SUPER BRIGHT COMPACT"}
{"rating":"3.0 out of 5 stars","title":"Five Stars","author":"Michelle Montvai","date":"on June 21, 2017","body":"i was really surprised how bright they were and they only take 1 AA battery per flashlight"}
{"rating":"4.0 out of 5 stars","title":"Three Stars","author":"Michael Grafton","date":"on June 21, 2017","body":"Very bright light, non adjustable beam"}
{"rating":"4.0 out of 5 stars","title":"Not too shabby","author":"Bart R.","date":"on June 21, 2017","body":"I work at a hospital, at night. These work perfect when I don't want to disturb my patients and wake them up with a bright light. They are so cute and fit in my pocket of my uniform. I also keep one in my purse."}
{"rating":"5.0 out of 5 stars","title":"Great product, one minor issue.","author":"Mark K","date":"on June 19, 2017","body":"VERY Bright lights for the cost. Plus uses common AA Batteries."}
{"rating":"5.0 out of 5 stars","title":"Rockbirds LED small flashlights","author":"Raymond K. Rodgers","date":"on June 17, 2017","body":"Only received one light in my order. The one light is nice for the price but I paid for two"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Richard Ackerman","date":"on June 16, 2017","body":"ty...I like"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"David H.","date":"on June 16, 2017","body":"Bright, nice portable size. they fit in my glove box."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"LUIS MIGUEL NIÑO LARA","date":"on June 15, 2017","body":"They are small yet brilliant light. Great product!"}
{"rating":"5.0 out of 5 stars","title":"Luis Miguel Niño","author":"Sherrie","date":"on June 11, 2017","body":"One of the three flashlights did not work"}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"Martin","date":"on June 11, 2017","body":"Not too bad for the price I paid. They are bright. The area where the battery goes is a little hard to turn, but still worked just fine."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Surisack Panmeesai","date":"on June 10, 2017","body":"Overall love the light. Only thing keeping it from being 5 stars for me is that switching the modes around can be a pain because it switches the mode as soon as it is turned off."}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"Warren Jenkins","date":"on June 10, 2017","body":"Nice bright little LED flashlights, can't beat them for the price, love the adjust-ability and the different light modes."}
{"rating":"5.0 out of 5 stars","title":"Buy It","author":"george","date":"on June 9, 2017","body":"Work good. Batteries last a long time. Really bright"}
{"rating":"3.0 out of 5 stars","title":"good lights","author":"Pat Smith","date":"on June 9, 2017","body":"Perfect"}
{"rating":"5.0 out of 5 stars","title":"great if you want to warm your hands in say-Alaska","author":"Daniel F. Kent","date":"on June 8, 2017","body":"Great, sturdy little light for the money. A lot of light from such a small flashlight."}
{"rating":"5.0 out of 5 stars","title":"Great little flashlights","author":"Paulette T","date":"on June 7, 2017","body":"Excelente producto"}
{"rating":"5.0 out of 5 stars","title":"A GREAT DEAL!","author":"George Molina","date":"on June 6, 2017","body":"Husband loves them."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Kandra Spaulding","date":"on June 6, 2017","body":"Uses just one AA battery, features adjustable beam by sliding the front part with the lens."}
{"rating":"5.0 out of 5 stars","title":"Nice flashlight","author":"Gary T.","date":"on June 6, 2017","body":"Good to have"}
{"rating":"5.0 out of 5 stars","title":"Flash light","author":"~*~Tracy~*~","date":"on June 5, 2017","body":"Fantastic deal. Buy it."}
{"rating":"5.0 out of 5 stars","title":"great flashlight(s)","author":"James R Yelle Sr","date":"on June 4, 2017","body":"bought these on sale, they came 2 to the package. nice quality, good light output, appear to be long lasting on the batteries."}
{"rating":"5.0 out of 5 stars","title":"best flashlight to have","author":"Rhonda","date":"on June 3, 2017","body":"When using for any amount of time these get really warm in your hand, great if you want to warm your hands in say-Alaska!"}
{"rating":"5.0 out of 5 stars","title":"Bright!","author":"Nikki sotelo","date":"on June 2, 2017","body":"They work great, my some love them. Had a little problem figuring them out, but good now."}
{"rating":"5.0 out of 5 stars","title":"and they look and feel pretty durable. Perfect to have in the house just ...","author":"Peggy Lightner","date":"on June 1, 2017","body":"These little flashlights are mighty. They feel like they are going to last, metal not plastic. Lots of light!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"GaTrader","date":"on May 31, 2017","body":"Wow, can't believe how much light we get out of this little one."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Jessie","date":"on May 31, 2017","body":"Love the size of these flashlights. Makes them easy to carry with you until you need it. Nice that they come in a pair. Can put one in my purse and one in the car. Very bright for the size it is."}
{"rating":"5.0 out of 5 stars","title":"easy to use","author":"Amazon Customer","date":"on May 31, 2017","body":"Awesome light if you get this you'll like it I keep one in my room and one in the truck"}
{"rating":"5.0 out of 5 stars","title":"Great pocket sized flashlight","author":"Mary H","date":"on May 30, 2017","body":"great flashlight, and whats even better is that they come in a pair!! and a great size, they easily fit in your pocket or sporting vest. Click the on\/off button 1\/2 way and you get the strobe effect. Strobe effect is great for walking at night making yourself more visible to cars, or also great for self defense if needed."}
{"rating":"5.0 out of 5 stars","title":"Very small but VERY bright I LOVE them!!!!","author":"JinnyRoseto","date":"on May 30, 2017","body":"great Flashlight ,"}
{"rating":"5.0 out of 5 stars","title":"I like this pack of flashlight so much","author":"FiveSistersO","date":"on May 30, 2017","body":"These are tiny, but mighty. I can keep one in my pocket when needed. The light is very bright and illuminates well."}
{"rating":"5.0 out of 5 stars","title":"Excellent for your go bag.","author":"George R. Miller Jr.","date":"on May 30, 2017","body":"I ordered these because it's hurricane season here in Hawaii. They came just in time, and they look and feel pretty durable. Perfect to have in the house just in case."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Christine","date":"on May 29, 2017","body":"These small flashlights are a lifesaver!"}
{"rating":"2.0 out of 5 stars","title":"Great compact flashlights","author":"Thomas Weinstein","date":"on May 29, 2017","body":"Super happy with how bright they are just wish they had come with batteries"}
{"rating":"5.0 out of 5 stars","title":"Way smaller than I thought.","author":"Elizabeth","date":"on May 29, 2017","body":"They are small and light, easy to use. The best thing I like is it only need one battery, not three."}
{"rating":"5.0 out of 5 stars","title":"Campact and Bright light","author":"James Stallman","date":"on May 28, 2017","body":"Great pocket sized flashlight. These are the best around. Super bright and I love that these can switch in several modes. Flash light can dim to safe on battery life, zoom in for a smaller focus, flash patterns, this is a must for every bug out bag or emergency kit"}
{"rating":"5.0 out of 5 stars","title":"I really like these little flashlights","author":"sh","date":"on May 28, 2017","body":"I love this set of 2 mini but very powerful flashlights I keep 1 in my purse and 1 in the drawer of my nightstand next to my bed for an emergency if the power ever goes out during a storm. You can pull the top part up and down to make the light wider or smaller to fit the amount of light you need. It also has a flashing light on it as well. You can even clip the light to your pants belt clip that is on it. The LED bright light is perfect for helping you find your keys in the dark and also when walking at night time. I will be getting me another set so my kids can have 1 for them to keep in they backpacks."}
{"rating":"5.0 out of 5 stars","title":"Bright and perfect size","author":"Rosa Mendoza","date":"on May 27, 2017","body":"I like this pack of flashlight so much!! It comes 4 pieces in one package. Also it is very convenient to carry, you can also clip on your pocket!! The light is bright! I will consider buying another set."}
{"rating":"4.0 out of 5 stars","title":"Great lighting","author":"Rich","date":"on May 27, 2017","body":"Good quality."}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"Che","date":"on May 26, 2017","body":"Very well made and super bright."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Samantha","date":"on May 26, 2017","body":"I used these flashlights at night when I take my dog out. They are very bright and work great. They are so small they fit in your pocket! I actually keep one on the leash at night. You can tell it's made of great quality! I can't believe 2 were only $10, it's an amazing value. You need these if you go outside in the dark at all!"}
{"rating":"5.0 out of 5 stars","title":"Awesome flashlight","author":"Jenna Buckman","date":"on May 26, 2017","body":"Way smaller than I thought. My fault"}
{"rating":"4.0 out of 5 stars","title":"I am very happy with how well these lights have worked","author":"Ted C","date":"on May 25, 2017","body":"Love the size, husband and I just got back from a camping trip to the beach. At night we used the flashlights for sand crabs. Also perfect fit in the small pocket of my beach bag. Also has a belt clip, my husband wore his. Bright light and has a blinking setting."}
{"rating":"5.0 out of 5 stars","title":"Like the fact in only takes 1 AA battery","author":"leilachen","date":"on May 25, 2017","body":"I really like these little flashlights.  They are perfect for keeping in your purse. They also can easily hook onto your waistband. This is what I carry for convenience and safety since they are such a compact size. Gave one to my teenage daughter too. The price is great for two"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Burg400","date":"on May 25, 2017","body":"This set of two flashlights is a great deal. I bought these so I would have one for my purse and an extra around the house. They are super small and compact but brighter than most flashlights. Small and only takes up about as much room as some lip glosses.I love that it only takes one AA to function. These flashlights are great to keep around."}
{"rating":"4.0 out of 5 stars","title":"Great Buy","author":"JD1112","date":"on May 25, 2017","body":"I purchased these flashlights to add to my bug out bag that I carry in my car. They're small, good quality, and only require 1 AA battery. It has a zoom in\/out feature that is very handy. I also like that the power on and off button is at the end of the flashlight for quick access, whereas some other lights I've purchased have them on the side. My husband is using one for when he takes the dogs out to use the restroom at our apt complex and likes it."}
{"rating":"4.0 out of 5 stars","title":"Flashlights","author":"Tarek Mousa","date":"on May 25, 2017","body":"good size and bright enough for the price."}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"Robert Clouden","date":"on May 25, 2017","body":"cheap item but excellent"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Robert M.","date":"on May 25, 2017","body":"These flashlights are awesome. They are small and able to be carried easily. They give a lot of light and we got them just in time to use for a power outage which was perfect!"}
{"rating":"5.0 out of 5 stars","title":"Great little flashlight","author":"Amazon Customer k4gwg.2@gmail.om","date":"on May 25, 2017","body":"These flash lights are small but they put off so much light. I bought these for my family and I to take to the beach and use them to go crab hunting. I am very happy with how well these lights have worked.Great quality and compact which makes it easier to take anywhere or carry in purse."}
{"rating":"5.0 out of 5 stars","title":"They are excellent and meet my every need","author":"Carmen Ferraioli","date":"on May 24, 2017","body":"handy little light to have. Like the fact in only takes 1 AA battery."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Jeanie C. Martin","date":"on May 24, 2017","body":"Very nice! A luxury box to cover these items."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"tnymnfrt","date":"on May 23, 2017","body":"They work and price is unbeatable."}
{"rating":"5.0 out of 5 stars","title":"great","author":"mjc6063","date":"on May 23, 2017","body":"Nice sized little flashlight! They are really bright and compact. Perfect for pocket sized emergencies and for keeping in your purse for extra reassurance."}
{"rating":"3.0 out of 5 stars","title":"Great value","author":"Chubaca","date":"on May 23, 2017","body":"good"}
{"rating":"5.0 out of 5 stars","title":"Okay flashlight","author":"Jonathan Tilley","date":"on May 23, 2017","body":"Great miniature lights with big light output."}
{"rating":"5.0 out of 5 stars","title":"Amazingly bright flashlight","author":"Amazon Customer","date":"on May 23, 2017","body":"Great little flashlight. Uses one AA battery. Bright and very compact. Can take it anywhere. It has three modes: very bright, bright and a flashing mode."}
{"rating":"5.0 out of 5 stars","title":"works great. Warning - keep away from kids","author":"Travis Germany","date":"on May 23, 2017","body":"Thank you for the Rockbirds LED Flashlights. They are excellent and meet my every need. I have have used them almost daily. The brightess of the light is great and they hold a charge over a longer period of time."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Ben C","date":"on May 23, 2017","body":"Very good."}
{"rating":"5.0 out of 5 stars","title":"Awesome little flashlights!!!","author":"Kami Christian","date":"on May 23, 2017","body":"Awesome flashlight! Solid construction and the light range is amazing. You will not be disappointed with this purchase."}
{"rating":"5.0 out of 5 stars","title":"Rockbirds LED Flashlight","author":"Meghan","date":"on May 23, 2017","body":"unbelievable how bright for a little light with rechargeable battery. great price"}
{"rating":"5.0 out of 5 stars","title":"like they like to do","author":"Rich S","date":"on May 22, 2017","body":"I picked these up for a song during one of the Amazon deals. They are outstanding little flashlights, plenty bright. I'd recommend the 14500 Li rechargeable batteries at 3.7V if you want the intensity to go up about 3x."}
{"rating":"4.0 out of 5 stars","title":"Small and bright, good handy personal light.","author":"RimRock","date":"on May 22, 2017","body":"I was hoping the flashlight would be brighter based on the description, but it's not as bright as advertised."}
{"rating":"5.0 out of 5 stars","title":"Good could be better","author":"Sandy Chen","date":"on May 22, 2017","body":"These little flashlights outshine some of the bigger flashlights I've taken with me on camping trips. I also really like the strobe feature, if I ever became lost in the woods, this would come in handy for flagging down assistance. The flashlight also has a clip on it, which makes it very convenient for attaching to my waist or my backpack."}
{"rating":"5.0 out of 5 stars","title":"Amazing!!!!","author":"Amazon Customer","date":"on May 21, 2017","body":"Bright, works great. Warning - keep away from kids. Disconcertingly way too bright for the little ones."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"shaohua,cheng","date":"on May 21, 2017","body":"Great flashlight, use it all the time. Also a great deal!"}
{"rating":"5.0 out of 5 stars","title":"Love it!","author":"Andrew","date":"on May 21, 2017","body":"Awesome little flashlights!!! Very bright. Would recommend getting. I am buying a second set."}
{"rating":"2.0 out of 5 stars","title":"Five Stars","author":"Jag","date":"on May 21, 2017","body":"Bought these little Led flashlights for my grandsons. I don't know why but all my grandkids love flashlights I can't ever have too many.This is the type of flashlight that they can just slip into their pocket without feeling bulky and heavy.Great product for the price. Only downside is that I didn't think they were very bright, but the boys love them."}
{"rating":"5.0 out of 5 stars","title":"Meh...","author":"Richard Ortisi","date":"on May 20, 2017","body":"I needed two mini flashlights to keeps by my kids' bedside ... these work perfectly. They are the right brightness for using when you need to get up out of bed in a dark room -- not blinding, but fully illuminates what you shine it on. Actually brightened the whole room. Not blinding when kids shine it at each other, like they like to do! Great product for the price."}
{"rating":"3.0 out of 5 stars","title":"Five Stars","author":"Richard S. Melton","date":"on May 20, 2017","body":"These are great little lights, small, cheap, and bright. What more can I ask for... ? Well, I could ask for a switch that always comes on in bright mode instead of the next mode from when you used it last, very annoying, But overall, a handy little light to drop in your pocket."}
{"rating":"2.0 out of 5 stars","title":"Cheap but bright","author":"Unshine","date":"on May 20, 2017","body":"So far these seem like good solid lights I would compare them to the \"csi\" nebo lights the only thing I would like better is if you could make then only bright mode and not have to cycle the switch 3 times through dim and strobe to get to bright again"}
{"rating":"1.0 out of 5 stars","title":"only marginally average, at best. and that's if all of the flashlights work.","author":"yyz222","date":"on May 20, 2017","body":"I received this light couple days ago. I was actually amazed how bright it is. Blindingly so. Focuses from beam to spot. I'm using it with a 2000 mAh NiMH AA battery. It seems to be made of pretty resilient materials. The strobe mode was an added plus not mentioned in the specs. I plan to use the light as a backup signal device for night walk. I was so impressed, I just ordered 2 more for my family. Highly recommends!!!!"}
{"rating":"5.0 out of 5 stars","title":"Disappointed","author":"J. King","date":"on May 19, 2017","body":"Awesome shine low price about 12 hours on a battery"}
{"rating":"5.0 out of 5 stars","title":"Good to have as backups around the house or for","author":"Stban Franco","date":"on May 19, 2017","body":"I like it and my daughter too. We will use them for camping next week!! ⛺️"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on May 19, 2017","body":"Great pair of flashlights that works great and actually have switches that works, unlike many of the cheap flashlights."}
{"rating":"5.0 out of 5 stars","title":"only 1 AA battery needed","author":"Rick Casey","date":"on May 18, 2017","body":"Not impressed. These aren't much better than the dollar store flashlights, not very bright, as the high dollar flashlights are."}
{"rating":"5.0 out of 5 stars","title":"Great Value Flashlights","author":"John M","date":"on May 18, 2017","body":"Great flashlight. Small but powerful."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Aaron","date":"on May 15, 2017","body":"really cheaply made and flimsy. The light is bright and there's a flimsy lense you can move to adjust the beam... not bad all in all but not great... you get what you pay for."}
{"rating":"3.0 out of 5 stars","title":"Great little light for the money.","author":"Adam de Garis","date":"on May 15, 2017","body":"short and sweet -- one worked, one didn't.\n\nthey're pretty dim, granting powered off a single, AAA battery. That's only 1.5v. their rather small size is appealing for storage in an automobile or a purse, i suppose. those were the purchase designs here, anyway or it's highly unlikely would have gone this route.\n\ncontacted the company twice, indicating one worked\/one didn't. IDK yet if they've responded"}
{"rating":"5.0 out of 5 stars","title":"Three Stars","author":"Red Shoe Lover","date":"on May 15, 2017","body":" I don't manage this account. my wife's account and I'm the occasional buyer. that said, looking at the order history, there's no clear Amazon indication that any adjustments have been made.\n\nlastly, seems one can reasonably expect a hit & miss scenario with these -- notice the irregular pricing, strongly nudging a buyer toward a larger collection. to whit -- we bought a 2-pack for $9.99"}
{"rating":"5.0 out of 5 stars","title":"This is the best little flashlight","author":"VK","date":"on May 15, 2017","body":" now i see both that same 2-pack but also a 4-pack for $12.99.\n\ncaveat emptor"}
{"rating":"5.0 out of 5 stars","title":"great value","author":"A. Harkins","date":"on May 15, 2017","body":"Delivery and packaging was great but the item is poor quality, cheap feeling although it has a metal body. When screwing on the cap to battery compartment the metal sheered on the threads. I do not imagine it will be very long lasting. The light is good, though the pinpoint beam, I expected, would be more spot focused, it is still a fairly wide beam"}
{"rating":"5.0 out of 5 stars","title":"Fits in my purse","author":"mary","date":"on May 15, 2017","body":"Very inexpensive and bright. Good to have as backups around the house or for camping"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"JQ","date":"on May 15, 2017","body":"I like"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Andre Shilenko","date":"on May 15, 2017","body":"best single AA battery flashlight"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"H. Pighetti","date":"on May 15, 2017","body":"These are Great, Small, and Bright flashlights. We use them often and are excellent replacements for the large bulky flashlights we carry in our cars."}
{"rating":"5.0 out of 5 stars","title":"These are great little flashlights","author":"Anneudys H.","date":"on May 15, 2017","body":"Very bright and compact"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"moneygodkillsthesoul","date":"on May 14, 2017","body":"I got this 2-pack for $8 shipped, so I guess there's little to complain about. I bought them for the cars since the small size doesn't require a space premium. Surprisingly bright for a single AA battery. I'm curious to try them with 14500 batteries to see how they perform. For the price, it can't be beat. They are solid and perform well. Definitely recommendable if on sale."}
{"rating":"4.0 out of 5 stars","title":"Perfect for camping","author":"C. Fowler","date":"on May 14, 2017","body":"nice for a small every day use"}
{"rating":"3.0 out of 5 stars","title":"Bright idea!","author":"Larry Maleszewski","date":"on May 14, 2017","body":"This is the best little flashlight. It is so bight and such a good size for my purse. I gave the other one to a friend, who was delighted to receive it.\nI love it."}
{"rating":"2.0 out of 5 stars","title":"They do the job, but be realiztic","author":"cowgirl386","date":"on May 14, 2017","body":"Very nice-was a gift. Fast shipping"}
{"rating":"5.0 out of 5 stars","title":"Not happy","author":"AtoZGuy","date":"on May 14, 2017","body":"Perfect size flashlight for my purse and one for my car. It provides a bright light for such a small flashlight and the price was excellent."}
{"rating":"5.0 out of 5 stars","title":"Good for walking the dog at night.","author":"Amazon Customer","date":"on May 13, 2017","body":"prompt shipping and great item"}
{"rating":"5.0 out of 5 stars","title":"low price and perfect around the house","author":"MsT","date":"on May 12, 2017","body":"Great little flashlight for nightstand, car or travel."}
{"rating":"1.0 out of 5 stars","title":"Small but powerful flashlight.","author":"Amazon Customer","date":"on May 12, 2017","body":"Powerful enough and handy tools to run quick inspections of my car."}
{"rating":"2.0 out of 5 stars","title":"Piece of Crap - Don't Buy","author":"Aaron Dobkin","date":"on May 10, 2017","body":"These are great little flashlights! I bought more of them because I loved them so much! They are extremely bright and easy to carry in your pocket."}
{"rating":"5.0 out of 5 stars","title":"Very poor light for a flash light","author":"Chris","date":"on May 10, 2017","body":"Great item thanks"}
{"rating":"5.0 out of 5 stars","title":"lightweight,good for group camping","author":"dogsnguitars","date":"on May 9, 2017","body":"Small but solid and bright. Three click light modes. High, low and strobe. Perfect for camping."}
{"rating":"2.0 out of 5 stars","title":"Perfect","author":"Earl G Limbird","date":"on May 7, 2017","body":"Tiny cheap flashlights that are very bright. I haven't tried freezing them in a block of ice or running over them with a Humvee but there's still time."}
{"rating":"5.0 out of 5 stars","title":"poor buy","author":"WI Farm Family","date":"on May 7, 2017","body":"Yes, just ok. Runs on a single AA battery. Ok light in a pinch. We're not talking about a zillion lumens, by any stretch. But, click the button, the light goes on. Simple three mode mechanism. Adjustable bezel, push\/pull, to adjust beam size. Flood setting looks best, but not the brighest. Worth the buy, in case of an emergency. Besides, AA batteries are cheaper than dirt, and so easy to find."}
{"rating":"5.0 out of 5 stars","title":"These work wonderfully well!","author":"Josh Pennay","date":"on May 7, 2017","body":"The batteries in BOTH flashlights were no good. It took 6 AAA batteries. Not happy."}
{"rating":"5.0 out of 5 stars","title":"Small but very handy ","author":"Partyof7","date":"on May 6, 2017","body":"Awesome for taking the dog for a walk at night."}
{"rating":"4.0 out of 5 stars","title":")","author":"Homer Tamez","date":"on May 5, 2017","body":"low price and perfect around the house. I slip one on my belt and take to job sites . Good light and easy to use"}
{"rating":"4.0 out of 5 stars","title":"Small and bright","author":"Road Scholar","date":"on May 5, 2017","body":"I bought these for my son and his friend to take camping on a school trip. They came in really handy because they got caught in the rain while hiking at night and these worked the entire time (almost one hour) until they got back to their campsite. They are small enough to fit in his jacket pocket so he was the only one to have one with him beside the counselor. We have them in a drawer in our kitchen in case the building loses power and it does all summer so they will come in handy. They are very bright and I would not expect that from such a small flashlight."}
{"rating":"1.0 out of 5 stars","title":"Four Stars","author":"greg","date":"on May 4, 2017","body":"I wasn't able to open one of them to insert a battery. Very poor design with the battery portal being combined with a light adjustment feature at the top. It just turns and turns as though the battery portal is stripped. What a piece a crap!! It was a waste of time trying to open it and an even bigger waste of money!! In addition, the strobe function should work off an exterior switch that can be activated when the light is on. Not when you turn it off and then turn it back on only to have a useless strobe function activated. That requires you to turn off the light again and turn it back on just to activate its normal function. One agitated customer!"}
{"rating":"5.0 out of 5 stars","title":"For the price, a good buy.","author":"The_cool_crat","date":"on May 4, 2017","body":"Don't let the edgy design fool you. Very poor light for a flash light. Gives off as much as much light as a 3 dollar harbor freight 2 pack."}
{"rating":"5.0 out of 5 stars","title":"they dont cost much but now i know why","author":"Michael N. Marcus","date":"on May 3, 2017","body":"I got the 4 pack camping lights the other day.I love them much as they are lightweight and practical.The lights are strong and have zoom in and out.\n3 light modes: strong,SOS,weak.and it has a clip that is sweet.and the price is so reasonable.We need more than 1 flashlight and buying 4 pack is saving some dollars.thanks!"}
{"rating":"5.0 out of 5 stars","title":"Solid","author":"Lisa","date":"on May 2, 2017","body":"We needed small strong flashlights so we could see our new very dark puppy in the yard in the dark. These are heavy, solid, bright and work perfectly. I would recommend for purse, car, or very dark puppies at night...."}
{"rating":"1.0 out of 5 stars","title":"lights up my life","author":"Mike","date":"on May 1, 2017","body":"One worked. The second one I could not get it open to put the battery in so do not know if it works or not. one good one bad"}
{"rating":"5.0 out of 5 stars","title":"Bright","author":"amber pafford","date":"on May 1, 2017","body":"We often need to head outdoors with no prior warning to deal with issues with the farm animals. A bright, reliable flashlight that can slip into a pocket is a must for us.\n\nShipping was fast with Amazon Prime and the packaging was excellent. These flashlights did not come with batteries, but I had some on hand for the flashlights we already own.\n\nThese flashlights are lightweight and very, very bright. The adjustable beam allows us to search the woods quickly and then to pinpoint what we're searching for. Most recently that was a wild raccoon who was tipping our waste cans and stealing food from the barn cats.\n\nThe clips are strong, enabling us to ensure that the flashlights won't fall out of our pockets while we're working.\n\nI have absolutely no complaints and intend to buy these again!"}
{"rating":"4.0 out of 5 stars","title":"One out of the two works. It did not ...","author":"The Great Buzzwami","date":"on April 30, 2017","body":"Great light use it for work. Super bright and you can adjust if you want the beam to be narrow and bright or have it cover more ground but not as bright. I've used one for a couple hours and still have not needed to replace the battery so that's super nice."}
{"rating":"5.0 out of 5 stars","title":"Super bright and light weight","author":"Kane P. Insomphou","date":"on April 30, 2017","body":"These lights are handheld lights and pretty bright. Easy to grip and can conveniently be stored just about anywhere. Good buy!"}
{"rating":"5.0 out of 5 stars","title":"Fantastic Little Flashlight, Except...","author":"Woodyard61","date":"on April 28, 2017","body":"A great light for little bucks."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on April 27, 2017","body":"Pretty darn good for the price. Clip is stout. No batteries included, but it's a single AAA, and puts out enough light to see well. Had to figure out which end to unscrew as the machining was in good tolerances. That was fun. Glad there were two. For the price, can't beat it."}
{"rating":"4.0 out of 5 stars","title":"Not for use with Vampires.","author":"Wolf Barber","date":"on April 27, 2017","body":"save your money if you drop them they don't shut off anymore both are broke in less then a week"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"paintednightsky","date":"on April 27, 2017","body":"These things are quality, didn't even know they had three light settings with purchase, pleasant surprise. Gonna buy my brother a couple"}
{"rating":"5.0 out of 5 stars","title":"Bright little lights. Good buy.","author":"K.C.","date":"on April 26, 2017","body":"I'm amazed that something so cool can be so inexpensive."}
{"rating":"4.0 out of 5 stars","title":"love these mini flashlights","author":"Bruce Robideau","date":"on April 26, 2017","body":"Really bright, especially for the size. Took them camping for the weekend, they worked great!"}
{"rating":"5.0 out of 5 stars","title":"Well worth the price, quality product!","author":"Amazon Customer","date":"on April 26, 2017","body":"One out of the two works. It did not light up when the battery was a applied. It just over heated."}
{"rating":"5.0 out of 5 stars","title":"Great little flashlight.","author":"Amazon Customer","date":"on April 26, 2017","body":"These flashlights are the most recent addition to my emergency\/camping equipment. They are super bright and only require one battery. You can use them as a spotlight or wide light which is convenient. I love how light weight they are and they have a clip that allows you to keep them on your belt, hat, or backpack and in easy reach. I will be purchasing more!"}
{"rating":"5.0 out of 5 stars","title":"Absolutely wonderful for that price","author":"Amazon Customer","date":"on April 25, 2017","body":"Really love these little flashlights, they're the best I've found on market. Small, VERY powerful for their size, focusable and only require one AA battery.\n\nWhy not 5 stars? Because of the three modes that you must cycle through every time. I have a couple of flashlights that stay in the same mode unless you repeatedly press the button, and then stay in that mode until changed again. That's the way all of these should work. It's a real pain to have to click so many times, just to get back to the only setting I'll use: high. Make that change and I'll buy a dozen for everyone in the family."}
{"rating":"4.0 out of 5 stars","title":"PRICE RAISED!","author":"DaytonaDan","date":"on April 25, 2017","body":"great!"}
{"rating":"5.0 out of 5 stars","title":"Go for it. For the price you pay it ...","author":"Susie","date":"on April 24, 2017","body":"I use this to fend off the demons that haunt me. Works good. So far, I am demon-less."}
{"rating":"4.0 out of 5 stars","title":"Bright, well made. But wait for a sale to buy them.","author":"IHeartArt","date":"on April 24, 2017","body":"Perfect size and got flashlight!"}
{"rating":"2.0 out of 5 stars","title":"surprised","author":"S. G. Shoemake","date":"on April 23, 2017","body":"Great little lights. The only two downsides are that the clip is tempered and will break if you try to bend it a little more so it's easier to clip on your pocket. The other is that when you turn it off, and then back on it goes to the next mode. So if you turn it off on the bright setting and turn it turn it back on, it'll be on the low setting. The modes are bright, low, & strobe. So I just switch it to strobe before I turn it off, that way it comes on bright. Not a deal breaker for me. But for some it might be."}
{"rating":"3.0 out of 5 stars","title":"Decent flashlights","author":"Kramer","date":"on April 23, 2017","body":"Great deal for a pair of mini flashlights. Very small and lightweight so very easy to throw in your purse to have just in case or around the house if the power goes out. Fits in the palm of my hand. Takes just one double AA battery. Very bright and you can adjust to turn it even brighter. Pictures I've taken below are in pitch black so you see how bright they are."}
{"rating":"2.0 out of 5 stars","title":"Toggle switch doesn't work","author":"Natalie G. Sanchez","date":"on April 23, 2017","body":"Well built , compact, nice light!"}
{"rating":"5.0 out of 5 stars","title":"These flashlights are OK. Nothing special. For as ...","author":"CHARLIE","date":"on April 23, 2017","body":"Awesome little flashlights! One AA battery and your set. Very bright for the size."}
{"rating":"5.0 out of 5 stars","title":"Disappointing with one light","author":"anthony","date":"on April 23, 2017","body":"Got the 2-pack for 8$. Absolutely wonderful for that price. Reasonably bright and the focus adjusts really well too.\n\nFor this price, I wouldn't think it twice."}
{"rating":"5.0 out of 5 stars","title":"Great price for pair","author":"Lobsta","date":"on April 23, 2017","body":"Great Flashlight and packs a lot of power for something so small. Purchased a pair for $8. Went back to get more and price went up to $29!"}
{"rating":"5.0 out of 5 stars","title":"Perfect","author":"Ron","date":"on April 22, 2017","body":"Go for it . For the price you pay it serves the purpose. Very small and portable"}
{"rating":"5.0 out of 5 stars","title":"Little blowtorches.","author":"thatdude5","date":"on April 22, 2017","body":"Very well made aluminium tube and very bright. What more could you want? Well, maybe a bigger flashlight. These things are tiny but crank an amazing amount of light given their size. Good for car, purse or pocket. Or to clip on your belt. The ability to focus the beam from narrow to wide is a plus. Be sure to wait for the sales. Prices are all over the map on these things, from as little as $8 (for 2) to almost $30. A good deal at the lower price point."}
{"rating":"5.0 out of 5 stars","title":"Very Good Quality","author":"Jacob Tucker","date":"on April 21, 2017","body":"very bright and portable. will use in the car as a light for maps, task lighting, or, emergencies. great for entering a dark movie theater. would love to try out other products from this supplier."}
{"rating":"5.0 out of 5 stars","title":"Buy It. You'll love it.","author":"debra","date":"on April 21, 2017","body":"Decent set of heavy flashlights. I like that they use standard batteries as opposed to rechargeable ones. These lights are bright and get the job done. Good set for the price"}
{"rating":"5.0 out of 5 stars","title":"Awesome! Really brute for its size","author":"Jessica","date":"on April 19, 2017","body":"Ordered 2 packages - 4 flashlights total. One of the push button toggle switches works only when it feels like it - and it's not often it feels like it. The other 3 flashlights work okay, but I wonder how long before their push button toggle switch craps out.\n\nThis is the first time in 14 years of shopping with Amazon that a product we purchased doesn't work. I guess it was bound to happen sooner or later.\n\nIt's not worth the hassle to send a $4 flashlight back. It should be thrown away, but then I'm throwing away $4 of my money. It's not the money, it's the principle. Come on Amazon, just suck it up and mail me a working replacement."}
{"rating":"5.0 out of 5 stars","title":"I am really pleased with this product","author":"STARBERRY","date":"on April 19, 2017","body":"These flashlights are OK. Nothing special.For as cheap as they are, I don't suppose you can set your sights too high!"}
{"rating":"5.0 out of 5 stars","title":"Bright and well made","author":"elanie slade","date":"on April 18, 2017","body":"Very disappointing one of the lights doesn't open, but the one that works is very bright."}
{"rating":"5.0 out of 5 stars","title":"Great quality","author":"Business mother","date":"on April 18, 2017","body":"it is REALLY bright for 1 AA battary"}
{"rating":"5.0 out of 5 stars","title":"I love these flashlights","author":"Shieldmaiden Mist","date":"on April 15, 2017","body":"Best flashlight ever"}
{"rating":"5.0 out of 5 stars","title":"Nice","author":"Ronda Reigada","date":"on April 15, 2017","body":"These units are very bright and powerful. Small but mighty. Fits in a glove box very well."}
{"rating":"1.0 out of 5 stars","title":"Nice and Compact","author":"Craig Taylor","date":"on April 13, 2017","body":"Nice and bright and well made. I recommend."}
{"rating":"5.0 out of 5 stars","title":"Bright little flashlights!!","author":"Plussizemakeup","date":"on April 13, 2017","body":"It just arrived this morning. After first glance and touch, I think it's well worth the cost... . Small, but rugged and with a great design."}
{"rating":"5.0 out of 5 stars","title":"A cimplete waste of money.","author":"Nicole W.","date":"on April 12, 2017","body":"Awesome! Really brute for its size. 1 AA battery is all it needs. Kids love playing with the 'blinking feature."}
{"rating":"4.0 out of 5 stars","title":"These are super handy and bright","author":"John D. Sissom","date":"on April 12, 2017","body":"I am really pleased with this product. They are lightweight and compact. They'll easily fit in my purse or even a pocket. The quality is great too, they're really bright and easy to operate. All in all, I'm very happy with them. They also arrived quickly and were packaged securely. I'd absolutely order again."}
{"rating":"4.0 out of 5 stars","title":"It's little but mighty","author":"Eric","date":"on April 12, 2017","body":"These little flash lights are so useful! I love the fact they are small enough to fit in my handbag, glove box or clip on my pocket. I was not expecting the light to be so bright, they are actually brighter than a bigger much more expensive flashlight my husband keeps in the garage. I will be purchasing a second set to keep in our camper!"}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"Charles A. Boy Jr.","date":"on April 12, 2017","body":"With a house full of boys my flash light are always turning up missing. So I find myself looking for smaller but strong and bright flashlights. These led flashlights from rockbirds are the perfect choice for my family. They are small and very sturdy. Strong and very bright. There are what I would call 3 different modes of light. The first is a regular flashlight beam. This light is very bright and shows a long distance from the user. Next is a more.focused beam just pull on the flashlight and you get a smaller more focused beam of light in a square. Next is a flashing mode. I like this one best because I will take the dogs for a walk in the morning before it is light out and I can use this in flashing mode attach it to my jacket so that drivers can see me.\nOverall I have been very impressed with the quality of this flashlight. It is small and light weight. Perfect to keep in your purse, car glove box or anywhere else you might need to."}
{"rating":"4.0 out of 5 stars","title":"Pretty Good, Not as expected for any pinpoint viewing","author":"B","date":"on April 12, 2017","body":"I love these flashlights. I bought for my son who's going on a camping trip. Very compact. Has three different settings."}
{"rating":"5.0 out of 5 stars","title":"great brightness. WIll get lots of use","author":"EttyOop","date":"on April 11, 2017","body":"Nice little flashlights... they have a distress flash as well as a dim and bright light!"}
{"rating":"5.0 out of 5 stars","title":"Just like other reviews say","author":"CouponinPfeif","date":"on April 11, 2017","body":"I ordered these because of their size. They fit nicely and discreetly into my purse and I can take it to go in case I need it.These flashlights are nice and bright, perfect for emergency situations or power outages. I don't like having huge bulky flashlights in my tiny apartment. They really take up way too much space. These are well built, strong and will last a long time. Really happy to have found these."}
{"rating":"5.0 out of 5 stars","title":"Great little flashlight!","author":"DMSAmazon Customer","date":"on April 10, 2017","body":"Great little flashlights! When we got them, we put the AA batteries in ( 1 per light) and they worked perfectly! When you click the button the light come on bright, click it again, and it's a different brightness, click it a 3rd time, and it strobes! They even have a little clip on it for a belt or a backpack! When you turn the front edge if it, the \"circle\" of light gets larger and smaller... this will be perfect for camping!!"}
{"rating":"5.0 out of 5 stars","title":"Very powerful lights","author":"GC Gallagher","date":"on April 10, 2017","body":"Absolute junk..Received the 2 lights today : 1 light does not telescope at all..The other turns to strobe whenever you put it down\non a hard surface."}
{"rating":"5.0 out of 5 stars","title":"I liked these. I didn't realize two came in the ...","author":"Heather","date":"on April 10, 2017","body":"These are super handy and bright! They fit in my pocket but can spot a coyote from a far these are going to be my lifeline out here in the country this year! So glad I purchased these and intend to order another set for my daughter."}
{"rating":"5.0 out of 5 stars","title":"Super bright, compact and a great value","author":"dee burdick-desanti","date":"on April 10, 2017","body":"Great little flashlight. At first glancethey look so little you wonder how much light they give. These little things give you just as much light as a full size flashlight but with the clip they fit anywhere!"}
{"rating":"5.0 out of 5 stars","title":"Good buy.","author":"Will's Review","date":"on April 9, 2017","body":"good for the price."}
{"rating":"5.0 out of 5 stars","title":"Great item to have","author":"jmbillet","date":"on April 8, 2017","body":"Pretty Good, Not as expected for any pinpoint viewing, also the AA battery depletes very fast. However, When you get 4 of them with the Flash Mode, you got yourself an Instant Seizure!"}
{"rating":"5.0 out of 5 stars","title":"Super Bright and very high quality tactical flashlight!","author":"Regina Castaneda","date":"on April 7, 2017","body":"Rugged, great brightness. WIll get lots of use."}
{"rating":"5.0 out of 5 stars","title":"I really like that you can pin point the light as well","author":"Minnchic","date":"on April 7, 2017","body":"Just like other reviews say, there is 3 settings. High, Low, and Strobe. You can't just use one, so you will have to push the button to go through the three settings. I have one set on high so when I go outside, and I have one set on the strobe that is locked up in the lockbox next to the pistol."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Mr.Charles B. keiper","date":"on April 7, 2017","body":"These are so much brighter than I expected! First of all, love that there are two. But the fact that there are different settings makes it a hit with the kids too! Personal flashlight for kid = win. It means that she can handle things on her own despite it being darker in the house than she prefers. On a less personal note, though - Small\/portable, easy to use, super bright. Love it!"}
{"rating":"5.0 out of 5 stars","title":"Great Flashlights in a small package","author":"Amazon Customer","date":"on April 7, 2017","body":"These are great handy little flashlights. I put one in my car and after using it my husband said he is taking my other one for his truck. I really love that you can adjust the light to sort of \"zoom in\" on something specific with the light."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"electrolytz","date":"on April 6, 2017","body":"I liked these. I didn't realize two came in the package so I was pleasantly surprised. They are extremely bright (which my toddler loves, she uses them to shine on the ceiling during the day). And they only require one AA battery, which is better than some since I don't always have larger batteries on hand."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Kelly","date":"on April 6, 2017","body":"I didn't expect that the mini flashlights would be as powerful as they are. They're great to keep in your toolbox, glovebox or purse. Also great to keep in a kitchen drawer for power outages, just in case.\nAt just over 3.5\" long they emit a super strong beam of LED light. They are really solid and have a nice weight to them. Two AA batteries (not included) is all it takes to operate them both. I'm going to keep one in the car and use one for camping.\nSince they're water-resistant I can bring it out on the kayak for those evening paddles and I won't have to worry about the flashlight getting splashed."}
{"rating":"5.0 out of 5 stars","title":"compact and practical","author":"Amazon Customer","date":"on April 5, 2017","body":"I got these for my older sons. They are very durable and compact. The light is bright enough. Good buy."}
{"rating":"5.0 out of 5 stars","title":"Very durable flashlights","author":"Mike L","date":"on April 5, 2017","body":"Great item to have. They are so compact that you can carry one in your purse, bag, or car, and not worry about it taking up much room at all. Easy on\/off button for someone with arthritis, or a young child."}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"jt69","date":"on April 5, 2017","body":"Rockbirds LED Flashlight is a very high quality, heavy duty, and super bright tactical flashlight. Extremely satisfied with this product!"}
{"rating":"5.0 out of 5 stars","title":"Good light - Good size","author":"Nick","date":"on April 5, 2017","body":"These are much brighter than I thought they would be. Its a must if you live in back in the woods. They will be used for alot more than taking the pups out at night. I really like that you can pin point the light as well. Makes for trying to seeing certain things much better. What is great about this is I get one and my husband gets one. Great purchase."}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"MS.Dimas","date":"on April 4, 2017","body":"I really like this product. They are the perfect soze."}
{"rating":"5.0 out of 5 stars","title":"Great and tough","author":"wade alexander wright","date":"on April 3, 2017","body":"Don't be fooled by their small appearance they pack a punch! Liked the fact that two came in a package. They are small enough that I kept one in my glove box in my car and one in the bathroom vanity in our upstairs bathroom. When the electricity goes out it always seems like I can never find the flashlights now I have them on every level of my home. With one simple Double A battery they are ready to go. They really give off a lot of light for a small flashlight. I also like the fact that they have a setting that is like a strobe light. That is why I decided to keep one in the car if we ever get stuck in the dark it can be used to flag someone down. I will be purchasing more of these!"}
{"rating":"5.0 out of 5 stars","title":"Two nice sturdy LED flashlights","author":"Akisha B.","date":"on April 3, 2017","body":"I really like this item..Very light,and strong..Built well,and very handy around the house...I wish i could have 2 more...Thanks..Mr.Keiper!"}
{"rating":"5.0 out of 5 stars","title":"This flashlight has exceeded my expectations so far, I've ...","author":"Alex","date":"on April 3, 2017","body":"Works really good"}
{"rating":"5.0 out of 5 stars","title":"Will definitely come in handy","author":"Brittney Peebles","date":"on March 30, 2017","body":"I always like to keep a small flashlight in my handbag in case of emergencies- you never know when an elevator will have a power outage or when you'll get stuck outside after dark. These are perfect for that purpose- they're lightweight enough yet comfortable to hold. I like that it comes in a pack of two, so I have a backup. The clip allows me to attach it to the pocket in my handbag for easy retrieval. And for a small flashlight, the LED light is strong, so I can see myself holding this for a long time in case of a power outage, unlike other powerful flashlights that are large, bulky and heavy."}
{"rating":"5.0 out of 5 stars","title":"Perfect size Flashlight for small spaces","author":"Darlene","date":"on March 30, 2017","body":"These flashlights work really well. The are heavy duty metal so they feel like they will take some abuse and not break. They get very bright which is obviously what you want from a flashlight. You get 2 so its a good value for your money. I keep one in the car for emergencies and my husband has the other one. I think these will last a very long time."}
{"rating":"5.0 out of 5 stars","title":"Great small flashlight","author":"Runya","date":"on March 26, 2017","body":"Awesome Light I love it Thank you Thank you"}
{"rating":"4.0 out of 5 stars","title":"Rockbirds LED flashlight.","author":"wildrice.","date":"on March 26, 2017","body":"Have only used a few times but are so far they are good, especially for the price paid."}
{"rating":"4.0 out of 5 stars","title":"Awesome flashlights, small and portable.","author":"Amazon Customer","date":"on March 24, 2017","body":"pretty bright for a little flashlight."}
{"rating":"5.0 out of 5 stars","title":"They work as advertised. It's a handy little light ...","author":"Rod Collins","date":"on March 24, 2017","body":"ran over it with a forklift still works fine nothing broke off of it"}
{"rating":"5.0 out of 5 stars","title":"Four Stars","author":"Edwin Y. Zhao","date":"on March 23, 2017","body":"I ordered my Rockbird led Flashlight thinking i was getting one. I am so surprised at the fact I recieved two. These by the way came so fast by prime. They didnt come with batteries so i loaded them today. Woot hoo. they are bright exactly what I aspected with LED. Nice and small fit so comfortly in my hand as a women the are about the size of my palm. I am totally keeping one of these in my kitchen and one in my SUV. Totally never know when its needed. Has a screw off top to change batteries as well as a nice sturdy clip to hold onto stuff. These Rock! Thank you again for the great Deal."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"rubecat","date":"on March 21, 2017","body":"This flashlight has exceeded my expectations so far, I've had it about a month I bought them because I have a lot of AA batteries and they were cheap. I had a similar Cree with rechargeable batteries it lasted three months barely on my last deployment, this one is a month in and going strong,it's been doused in jet fuel and dropped more times then I know but still shines bright for 10 bucks and you get two can't beat it."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Kindle Customer","date":"on March 20, 2017","body":"Don't be fooled by the size of these flashlights. They might be mini, but they give off so much light. These two flashlights are so convenient and handy. The fact that they are small, they can fit anywhere (glove department, purse, pocket- there's even a clip that you can attach to your pocket). Will be a great addition to a survival kit."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Chris C","date":"on March 17, 2017","body":"Definitely a fan of these flashlights, they are small but very bright. Really good quality and the clip on them is perfect for outdoor activities when not in use. The perfect size to keep in a convenient place, I put one in my glove compartment and another in my first aid kit. Definitely recommend these as you get an excellent product for the price."}
{"rating":"5.0 out of 5 stars","title":"I am very happy I purchased the Rockbirds LED Flashlights","author":"Darlene Sharpe","date":"on March 16, 2017","body":"My husband works in the oilfield so I grabbed this two pack for him and his friend to use while at work. They are simple, only take 1 battery, and they really liked the brightness of the light and the fact that it has a tight clip on it so it stays in their pocket well."}
{"rating":"5.0 out of 5 stars","title":"Great little flashlights that put out Great light","author":"Amazon Customer","date":"on March 15, 2017","body":"Always, always need flashlights in our house and only LED ones. The flashlight is bright, has a belt clip, fits perfectly in your hand and compact. It has a caution mode, where the light blinks to let others know something is wrong. HOpefully no one will ever have to use that setting. This flashlight being so compact is great for you need to look under cabinets and small spaces. My husband used it for the lower compartment on his boat."}
{"rating":"5.0 out of 5 stars","title":"small but powerful","author":"Deborah kriket","date":"on March 15, 2017","body":"Really cool little flashlights. These are fairly small and light but they are also very sturdy. They do not feel cheap or weak in any way. Really nice quality, well made. I like that they are small, makes them super portable. I also like the adjustable focus feature, could come in handy. I definitely like these and can surely recommend this product."}
{"rating":"5.0 out of 5 stars","title":"Good Buy","author":"Lauren Naturals","date":"on March 14, 2017","body":"They work as advertised. It's a handy little light."}
{"rating":"3.0 out of 5 stars","title":"i was looking for something to keep in my vehicle that wasnt big but was still bright wnought ro get the job down and this is th","author":"Sim Lucien","date":"on March 13, 2017","body":"They work good but are small. Only about 3 inches each but still strong light."}
{"rating":"5.0 out of 5 stars","title":"very bright led flashlights","author":"DBK_Cali","date":"on March 11, 2017","body":"Powerful!"}
{"rating":"5.0 out of 5 stars","title":"so they don't get held to super high standards","author":"Erin Stubbs","date":"on March 10, 2017","body":"Great quality for the price!"}
{"rating":"5.0 out of 5 stars","title":"Super bright little lights that work well.","author":"christyNsebastian","date":"on March 9, 2017","body":"Surprisingly bright for size."}
{"rating":"5.0 out of 5 stars","title":"Great little flashlights","author":"Adam S","date":"on March 9, 2017","body":"I am very happy I purchased the Rockbirds LED Flashlights. They are the perfect size for your purse, pocket, fanny pack or to store in the door of your car. They are easy to use and very bright. They come in a pack of two. I put one in my Jeep and the other in my husbands truck. I have used mine every time I have come home at night and needed to light my way to the door. I highly recommend these flashlights."}
{"rating":"5.0 out of 5 stars","title":"great, small and so bright","author":"Mars24","date":"on March 9, 2017","body":"Great little flashlights that put out Great light. I recently started with a volunteer Fire Department and was looking for tools to fill my pockets with. Flashlights are one of those key tools. This little flashlight is simple to use and even with it being so small and with wearing gloves, it is easy to turn on and off. Definitely worth the buy."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"RavSilver","date":"on March 9, 2017","body":"These are small enough to carry in a purse or backpack. I personally carry one in my purse for those times when I am going to my car late in the evening and need a light to see. I take evening classes and sometimes going to my car is a little scary, so I really like having the flashlight readily available. It eases my stress and fears waking to my car being able to actually see. We recently lost power and I used my rockbird flashlight most of the evening. I was amazed at how long and well it worked. I am very happy with these flashlights and look forward to using them for camping and hiking over the summer. I am impressed for as small as they are, they emit quite a bit of light."}
{"rating":"5.0 out of 5 stars","title":"Great EDC light","author":"Amazon Customer","date":"on March 8, 2017","body":"Great little flashlight for the price, super bright and sturdy."}
{"rating":"5.0 out of 5 stars","title":"Great Light","author":"Sav","date":"on March 8, 2017","body":"these are the bigest bang for youe buck. very very bright. i was looking for something to keep in my vehicle that wasnt big but was still bright wnought ro get the job down and this is the PERFECT flash light for that!\n\nI have no relation to the seller, this is my honest opinion. :)"}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"Eric Castillo","date":"on March 7, 2017","body":"Very bright flashlight. I like the LED glow vs the regular lens. Item come packed well in a box. Very good quality. Metal casing that can stand up to wear and tear. I plan on using these lights for emergency and also when we go camping. It is nice that there is a place to put a clip or lanyard."}
{"rating":"5.0 out of 5 stars","title":"This flash light is very nice. It has an option of a dimmed light","author":"jack","date":"on March 7, 2017","body":"They cheap, so they don't get held to super high standards. The slide to amplify light is only useful when at max power. The light gets focused into some logo I can't make out. Not good or bad, just an observation."}
{"rating":"5.0 out of 5 stars","title":"Good deal!","author":"MisterP","date":"on March 6, 2017","body":"Super bright little flashlights. The focus on them is fun, but usually not very necessary. They seem like they can handle a pretty good beating. I carry one on my belt at work as it is compact, lightweight, and it comes in really handy. The only complaint I have is I wish the belt clip was heavier"}
{"rating":"5.0 out of 5 stars","title":"Heavy Duty and Bright","author":"Michael Mills","date":"on March 5, 2017","body":" I snagged it on my bench the other day while I was working and bent it all up. I took off the clip (held on by two small allen screws) and applied some love with a pair of pliers and it works great again. I don't know if anyone else would have this problem and it's easy to fix, so it's not worth taking off a star. I may make a heavier clip for it myself though.\n\nOverall, they do what I expect them to do."}
{"rating":"5.0 out of 5 stars","title":"Awesome","author":"Kristi Fahlsing","date":"on March 5, 2017","body":"This set of two flashlights are a great deal in my opinion. I gave my husband one to use in his tow truck and one stays in the house for me. These flashlights are very bright and you can adjust the scope of the light from a large area to a precise close area. I use my flashlight in the house to check on eggs in an incubator so I pull the top of the flashlight out to narrow the scope. It is plenty bright for me to see the babies in the eggs. My husband has used his for lots of things in the tow truck. It is great for lots of jobs since it has adjustable lighting. It's also easy for him to keep on himself with the metal clip and non-slip grip. I like that they are made with aluminium so they are lightweight and durable. So far they show no wear and tear even though we are constantly using them."}
{"rating":"2.0 out of 5 stars","title":"Great flashlight.","author":"Edward McCarthy","date":"on March 5, 2017","body":"Tell you the truth... i bought them for my mother in law who was always complaining about not having flashlight when ahe loses power in the house and ahe bothered me to borrow mine. Now since I got her these flashlights she doesnt even use them and keep bugging me for flashlights... guess what i took flashlights back for myself and borrow her the ones i bought her... great , small and so bright... ask my mother in law!!"}
{"rating":"5.0 out of 5 stars","title":"A nice LED (small) flashlight!","author":"Charles J. Cole","date":"on March 4, 2017","body":"Very bright and no problems so far."}
{"rating":"5.0 out of 5 stars","title":"... bought a pair similar to these previously and really like the design","author":"GardenGuy","date":"on March 4, 2017","body":"These were purchased as gifts. Both recipients are very happy with the lights. These are being used as Every Day Carry (EDC) tools. These have been in daily carry\/use for three months with no complaints. Very bright, work great, good battery life and a variable beam at a great price....what is not to like?\n\nRemember...it is not a Streamlight, SureFire, Fenix, etc....but it works, and it's 5$. Worth every penny!"}
{"rating":"5.0 out of 5 stars","title":"Very fast shipping!","author":"pam mortensen","date":"on March 2, 2017","body":"These are great little flashlights. Very compact and very bright. Small enough to fit in my pocket"}
{"rating":"5.0 out of 5 stars","title":"Quality made and a fantastic deal! Let me show you how they work.","author":"KR","date":"on March 1, 2017","body":" and they are very sturdily built. Recommended."}
{"rating":"5.0 out of 5 stars","title":"great","author":"DAVID DUDLEY","date":"on March 1, 2017","body":"Great price, bright for a little flashlight."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"ROBAMA","date":"on February 24, 2017","body":"This flash light is very nice. It has an option of a dimmed light, flashing light, and also a bright and long extended light. I like it a lot and have used it lot."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Rodel P. Urmatan","date":"on February 23, 2017","body":"The flashlights are light weight and very bright. Once you put the battery on it's a bit difficult to put the bottom back on. But it's a clear white light and not that yellow hue. So it's a great find especially since you get two! I use them when I'm walking around at night and it doesn't take up space at all."}
{"rating":"3.0 out of 5 stars","title":"Five Stars","author":"A Customer 9999999","date":"on February 23, 2017","body":" These are good quality tactical flashlights. They have three modes and in the video I am posting along with this review you can see the difference in the 3 modes which are changeable with a click of the button at the end of the flashlight. There is a sturdy pocket clip mounted to the side of the flashlights with two small screws. So far I haven't had any problems with the flashlights which seem to be pretty durable and are just what I expected."}
{"rating":"5.0 out of 5 stars","title":"It's rock solid!","author":"M D B","date":"on February 23, 2017","body":"No problems at all ,strong lil lights"}
{"rating":"5.0 out of 5 stars","title":"Not for rugged use.","author":"Ray leon","date":"on February 18, 2017","body":"I use this flashlight for work. It has awesome brightness and uses one AA battery as opposed to the expensive special batteries the tactical flashlights usually take. Works great for up close or zoom it in for distance. Definitely a good buy, especially for the price."}
{"rating":"5.0 out of 5 stars","title":"Bright and Tough with only 1 AA Battery!","author":"Twinmom","date":"on February 17, 2017","body":"I purchased the LED Flashlight by Rockbirds because I wanted a flashlight I could easily put into the center console of my Jeep. This flashlight is perfect because it is small enough to fit just about anywhere that you want to put a flashlight. You could carry this in your purse, your vehicle, it even has a clip for a belt. Just remember, batteries are not included. So you will need two AA batteries. I am pleased with this purchase. :-)"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Calvin","date":"on February 16, 2017","body":"I had bought a pair similar to these previously and really like the design. This brand however was cheapened considerably. I was not impressed with the switch most of all. Being not as crisp as the other brand."}
{"rating":"4.0 out of 5 stars","title":"Great sporting flashlights","author":"Amazon Customer","date":"on February 16, 2017","body":"This is probably the best and most compact set of flashlights I've ever owned! I don't like candles so they are perfect for power outages and I'm always losing things so the ultra brightness is very effective for that too!"}
{"rating":"2.0 out of 5 stars","title":"Brighter Than Expected","author":"James King","date":"on February 15, 2017","body":" These Rockbirds LED Flashlights I bought came it a pack of 2 for only $9.99 which is a crazy good deal. I collect LED flashlights and have about 30 right now but I really like these smaller ones because I can just keep them in my pocket.\nThese are heavy duty and made with aluminum. The battery compartment has an O ring to keep moisture out. They are waterproof but not to be submerged in water but they will withstand rain.\nThe beam is adjustable and you can see that in the video I provided to go with this review and I also show all 3 modes of lighting. All you need to do is slightly tap the on and off switch and it will change modes.\nPlease watch the video to get a better idea of what I am talking about. Overall it is excellent for the price and you get 2! I give this 5 stars easily. I hoped this helped in some way."}
{"rating":"4.0 out of 5 stars","title":"Four Stars","author":"Leslie Dixon","date":"on February 13, 2017","body":"great little lights"}
{"rating":"5.0 out of 5 stars","title":"When turning these on, you get a different mode ...","author":"D. Griffin","date":"on February 6, 2017","body":"love them"}
{"rating":"4.0 out of 5 stars","title":"Best $4.00 dollar light we have had.","author":"Amazon Customer","date":"on January 21, 2017","body":"Excellent! These are great!"}
{"rating":"5.0 out of 5 stars","title":"GREAT VALUE","author":"John","date":"on January 20, 2017","body":"MUY BUEN PRODUCTO"}
{"rating":"1.0 out of 5 stars","title":"Santa Flew right by","author":"Happy","date":"on January 17, 2017","body":"Rock solid construction with great beams of light. Only use 1 AA size battery. It fits comfortably in my jeans pocket and compliments my EDC. Not to mention that the price is extremely reasonable.\n\nWhat's not to like? :))"}
{"rating":"4.0 out of 5 stars","title":"Five Stars","author":"Garden Walk","date":"on January 17, 2017","body":"Dropped the light one time. Now the slightest change in grip will turn it to strobe or off. But it's bright."}
{"rating":"5.0 out of 5 stars","title":"Changed battery stopped working","author":"Sherbear","date":"on January 15, 2017","body":"Really like these flashlights! Work very well. Very useful."}
{"rating":"1.0 out of 5 stars","title":"but very good light source","author":"Renee","date":"on January 10, 2017","body":"bright and compact design. have them all thru out my house."}
{"rating":"5.0 out of 5 stars","title":"They feel nice and hefty feel like theyre powerful","author":"Amazon Customer","date":"on January 6, 2017","body":"These are great flashlights. They are perfect for any outdoor activity - hunting, fishing, walking your dog and picking up poop... They are heavy duty so they can be packed in your gear and will stand up to the rugged outdoors."}
{"rating":"5.0 out of 5 stars","title":"Not durable","author":"rd5565","date":"on January 5, 2017","body":"Wow these were a lot brighter than I expected. I bought one to attach to my home defense shotgun and the other for my car. The only draw back was not being able to get the belt clip off without snapping it but no biggie."}
{"rating":"5.0 out of 5 stars","title":"and the illumination is great for the size","author":"Harvey Sherman","date":"on January 3, 2017","body":"Great for the price.No complaints so far."}
{"rating":"4.0 out of 5 stars","title":"Excellent Flashlights","author":"Peter Dandyk","date":"on January 3, 2017","body":"When turning these on, you get a different mode each time. Who wants a flashlight that shines a random mode each time? I use the same mode 99% of the time so have to change modes every time I turn it on. No thanks."}
{"rating":"5.0 out of 5 stars","title":"All of them are working great. Bought some from another company in colors","author":"Robert S. Nelson Jr.","date":"on January 2, 2017","body":"After getting screwed by the seller Vaya I bought this 2 pack. Not bad for a $4 flashlight. The clips are strong, might have to modify the clip. I'm happy with this product. Get what you pay for. I waited nearly 2 months for the Vaya and never did get it. This one I got overnight."}
{"rating":"5.0 out of 5 stars","title":"Nice compact light","author":"Amazon Customer","date":"on January 2, 2017","body":"These are GREAT!"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on January 1, 2017","body":"The lights are Nice. Several others are similar.however promised the Xmas Delivery.. no-show- Still waiting for some type of acknowledgement.\n\nps it kept saying out for delivery. im rural and i froze three days waiting for the driver"}
{"rating":"5.0 out of 5 stars","title":"Good","author":"Bret Harris","date":"on December 30, 2016","body":"They work as expected."}
{"rating":"3.0 out of 5 stars","title":"Five Stars","author":"Ben Kell","date":"on December 29, 2016","body":"Don't use to often very bright.Broken spring not making good contact. After changing battery.iI initially gave it 5 Stars but changed it after it stopped.working."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"Amazon Customer","date":"on December 20, 2016","body":"Wish they were smaller, but very good light source, and good price. Would buy again."}
{"rating":"5.0 out of 5 stars","title":"Ehh...Cheap","author":"CatCollins","date":"on December 20, 2016","body":"WOW are these bright. Theyre small but they pack quite the punch. They feel nice and hefty feel like theyre powerful. 10\/10 i love em"}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"bill","date":"on December 19, 2016","body":"Loved it at first, but after dropping it once, the flashlight will not turn on. I tried replacing the battery, and looking inside to see if I could fix it. I don't see any way."}
{"rating":"5.0 out of 5 stars","title":"Perfect","author":"F. Barcelona","date":"on December 18, 2016","body":"These are very small flashlights. They feel very solid though, and the illumination is great for the size. They easily clip inside the pocket of a pair of jeans and feel very similar to a clipped folding knife in my pocket. The housing at the end of the light slides in and out to adjust the beam, and there is a strobe setting on the light when you press the power button off and on again. Two lights come in the package. At first it seemed a little spendy for them when looking at their size, but as I have used it, and had it in my pocket, these are 20 times the light you get at a dollar store, or by spending less somewhere else. I bought 3 packs of 2. They have held up under the abuse my son's and friends dish out so far. And, they are very compact."}
{"rating":"5.0 out of 5 stars","title":"Five Stars","author":"C G","date":"on December 9, 2016","body":"These flashlights are awesome. They are very small but provide a super-bright light. I especially like the 3 settings: bright, dim and flash. The flash is almost like a strobe light and is perfect for walking the dog at night. The clip is great too. Highly recommend."}
{"rating":"2.0 out of 5 stars","title":"Five Stars","author":"anthony r.","date":"on December 8, 2016","body":"All of them are working great. Bought some from another company in colors, and a few had problems, so they are not prefect, but for the price, amazing even if one out of 10 does not work.\n\nSeem to use up batteries a bit faster, but with only one battery at a time, seems to be OK or on par with other flashlights on battery use.\n\nHave 10 now, all over house, use them all the time, fantastic."}
{"rating":"5.0 out of 5 stars","title":"great little light for working on cars underneath them it ...","author":"Sergio B.","date":"on December 5, 2016","body":"5 out of 6 were good."}